{
  "empty_pages_count": 0,
  "empty_pages": {},
  "special_pages_count": 0,
  "special_pages": {},
  "webpage_tree": [
    {
      "page_id": 4086,
      "title": "A Lifeline to Students During the Pandemic",
      "link": "https://www.schoolhealthcenters.org/a-lifeline-to-students-during-the-pandemic/",
      "content": {
        "full_text": "The impact of having a school-based health center (SBHC) that provides counseling services, health services, and a space for young folks to engage in wellness is one that I personally would have loved to experience as a young person. I have never been to a school that has developed such a culture of care, responsibility, and support for students that El Cerrito High has as a result of having its SBHC, The James Morehouse Project . I’ve seen school serve as a major lifeline for students who have no social support, who don’t have a trusted adult to share their experiences, to process trauma, and gather the resources and support that they need to make it through the school day, the year, and the rest of their lives. I met a number of students supported by the SBHC since they started high school who were unable to get the support offered through other venues that they received at the SBHC. These students have been able to transform themselves and ground themselves in their own values, their own truth, and their own terms in ways I have not seen at other schools. Even during the pandemic, I was able to maintain connections and support students as we experienced the collective trauma of quarantine and shelter in place and being removed from what often can be for many students one of the few safe spaces that they have in their day. Serving with just a phone call, an email, a text message, or video call was appreciated by the students I worked with who often had a hard time managing the different challenges that arose at home and that became more prevalent during the quarantine. Months into shelter in place and distance learning, we see that school-based health centers serve a vital role to continue to support students, families, and communities as we continue to face together the different challenges arising on a national level. <h3>Programs During the Pandemic Included</h3> Shared by Gilbert Gammad, MSW Candidate, UC Berkeley Counseling Intern at The James Morehouse Project SBHC, El Cerrito High School, Spring 2020",
        "chunks": [
          "The impact of having a school-based health center (SBHC) that provides counseling services, health services, and a space for young folks to engage in wellness is one that I personally would have loved to experience as a young person. I have never been to a school that has developed such a culture of care, responsibility, and support for students that El Cerrito High has as a result of having its SBHC, The James Morehouse Project . I’ve seen school serve as a major lifeline for students who have no social support, who don’t have a trusted adult to share their experiences, to process trauma, and gather the resources and support that they need to make it through the school day, the year, and the rest of their lives. I met a number of students supported by the SBHC since they started high school who were unable to get the support offered through other venues that they received at the SBHC. These students have been able to transform themselves and ground themselves in their own values, their own truth, and their own terms in ways I have not seen at other schools. Even during the pandemic, I was able to maintain connections and support students as we experienced the collective trauma of quarantine and shelter in place and being removed from what often can be for many students one of the few safe spaces that they have in their day. Serving with just a phone call, an email, a text message, or video call was appreciated by the students I worked with who often had a hard time managing the different challenges that arose at home and that became more prevalent during the quarantine. Months into shelter in place and distance learning, we see that school-based health centers serve a vital role to continue to support students, families, and communities as we continue to face together the different challenges arising on a national level. <h3>Programs During the Pandemic Included</h3> Shared by Gilbert Gammad, MSW Candidate, UC Berkeley Counseling Intern at The James Morehouse Project SBHC, El Cerrito High School, Spring 2020"
        ]
      },
      "modified": "2025-08-15T02:49:31",
      "slug": "a-lifeline-to-students-during-the-pandemic",
      "status": "publish",
      "excerpt": "<p>The impact of having a school-based health center (SBHC) that provides counseling services, health services, and a space for young folks to engage in wellness is one that I personally would have loved to experience as a young person. I have never been to a school that has developed such a culture of care, responsibility, [&hellip;]</p>\n",
      "children": [],
      "document_uuid": "020b5d21-45b2-579a-b570-5e6981eb9062"
    },
    {
      "page_id": 3345,
      "title": "California Students Creatively Share Health Knowledge at Y2Y",
      "link": "https://www.schoolhealthcenters.org/california-students-creatively-share-health-knowledge-at-y2y/",
      "content": {
        "full_text": "By Jubilee Adams Youth Board Member In November 2024, the California School-Based Health Alliance (CSHA) brought together over 250 attendees – including 180 youth – from across the state of California to connect with one another at the annual Youth 2 Youth (Y2Y) conference. This year’s conference took place in Ontario at the Inland Empire Health Plan (IEHP) headquarters, with the theme of Empowering Youth Driven Waves of Change . Students led and participated in workshops and activities based around topics such as substance use prevention, peer mentoring, improving community health, and helping youth develop leadership skills. There were 11 youth-led workshops targeting topics such as fostering healthy relationships, youth advocacy, and school wellness centers. Alongside the workshops were creative and fun youth-led activities such as “get to know each other Bingo” and group activities such as guessing objects depicted in close-up photos. Students enjoyed a photobooth as well as numerous “brain breaks” that fostered a fun and creative outlet for youth to relax and bond. These youth-only rooms included bouquet-making, collaging, bracelet-making, and many more opportunities for the attendees to connect with one another and try new things. The conference cultivated a space where young people could come together to connect with one another in a youth-centered space. CSHA’s Youth Board , which consists of 9 young adults from across California, worked together to envision a youth-centered safe space. Two youth board members , Rehma Shahid and Christian Lizaso, emceed the event. Attendees learned about the experiences of other young people as their peers presented about challenges impacting their communities. The environment at Y2Y helped to foster a feeling of hope and resilience as the attendees experienced the impact that youth-collective power can have in their school and their communities.",
        "chunks": [
          "By Jubilee Adams Youth Board Member In November 2024, the California School-Based Health Alliance (CSHA) brought together over 250 attendees – including 180 youth – from across the state of California to connect with one another at the annual Youth 2 Youth (Y2Y) conference. This year’s conference took place in Ontario at the Inland Empire Health Plan (IEHP) headquarters, with the theme of Empowering Youth Driven Waves of Change . Students led and participated in workshops and activities based around topics such as substance use prevention, peer mentoring, improving community health, and helping youth develop leadership skills. There were 11 youth-led workshops targeting topics such as fostering healthy relationships, youth advocacy, and school wellness centers. Alongside the workshops were creative and fun youth-led activities such as “get to know each other Bingo” and group activities such as guessing objects depicted in close-up photos. Students enjoyed a photobooth as well as numerous “brain breaks” that fostered a fun and creative outlet for youth to relax and bond. These youth-only rooms included bouquet-making, collaging, bracelet-making, and many more opportunities for the attendees to connect with one another and try new things. The conference cultivated a space where young people could come together to connect with one another in a youth-centered space. CSHA’s Youth Board , which consists of 9 young adults from across California, worked together to envision a youth-centered safe space. Two youth board members , Rehma Shahid and Christian Lizaso, emceed the event. Attendees learned about the experiences of other young people as their peers presented about challenges impacting their communities. The environment at Y2Y helped to foster a feeling of hope and resilience as the attendees experienced the impact that youth-collective power can have in their school and their communities."
        ]
      },
      "modified": "2025-08-14T20:06:36",
      "slug": "california-students-creatively-share-health-knowledge-at-y2y",
      "status": "publish",
      "excerpt": "<p>By Jubilee AdamsYouth Board Member In November 2024, the California School-Based Health Alliance (CSHA) brought together over 250 attendees – including 180 youth – from across the state of California to connect with one another at the annual Youth 2 Youth (Y2Y) conference. This year’s conference took place in Ontario at the Inland Empire Health [&hellip;]</p>\n",
      "children": [],
      "document_uuid": "9b466d98-f348-54c1-ae1e-8c81c17539dc"
    },
    {
      "page_id": 2941,
      "title": "Distributing Naloxone in SBHCs: Addressing a Public Health Challenge",
      "link": "https://www.schoolhealthcenters.org/naloxone-in-sbhcs/",
      "content": {
        "full_text": "By Sai Tulugu La Clínica is a federally qualified health center (FQHC) that operates several school-based health centers (SBHCs) in partnership with the Oakland Unified School District. The health center was founded in 1971 by a group of students at the University of California, Berkeley, as a community-based clinic to address the lack of high-quality and consistent healthcare for low-income residents in the East Bay. La Clínica has been a pioneer in its approach to training providers to administer Naloxone – a medicine that rapidly reverses an opioid overdoses in as little as 2-3 minutes – in SBHCs. The Naloxone distribution programs started out of a concern from an employee who noticed the hyper-prevalent use of narcotics in the community, often being found in colorful, attractive forms to draw the attention of children. Karen Gersten-Rothenberg, an associate medical director at La Clínica de la Raza, said SBHCs should focus on how opioids are distributed in the community when coming up with a strategy for addressing opioid use. A common strategy is a drug exchange where the community can safely dispose of excess prescription or recreational substances in a safe, hygienic center. These centers could also be an opportune setting to distribute naloxone and answer questions about the use of naloxone. Another strategy is an education program, where peer-health educators come to classrooms and explain to students what naloxone is and where they can access it. Gersten-Rothenberg underscores the importance of using the harm-reduction model to give students the autonomy to make their own decisions about their health, while providing them the resources to be safe in the case of a medical emergency. <h3>Addressing Concerns</h3> SBHCs may encounter concerns from the community, school board, or other entities. Focusing on community problems is an important strategy to explain to community members that the role of naloxone distribution is not to encourage opioid use, but rather to prevent emergencies from occurring due to misuse. Another long-term goal of some public health entities is to educate pharmacists about naloxone and change the standard of care to require naloxone prescription with a standard opioid prescription. Normalizing naloxone in the pharmaceutical setting, may influence opinions in the general public and lead to normalization in SBHC settings. <h3>Support for Schools & SBHCs</h3> The Naloxone Distribution Project (NDP) was created by the California Department of Health Care Services and provides free naloxone to registered entities including schools, universities, and community organizations. Some steps to take include: <h3>Using Naloxone</h3> Telltale signs of an opioid overdose include: When in doubt, it is usually best to administer Naloxone as this medication has no effects on a person not in overdose. In a person undergoing an opioid overdose, naloxone administration temporarily blocks opioid receptors and causes immediate relief. Side effects such as body aches, increased blood pressure, fever, etc., and professional medical help should be sought. Rescue breathing may be performed if possible. The person should also be watched until professional medical help is available. Sai Tulugu is a member of the California School-Based Health Alliance Youth Board .",
        "chunks": [
          "By Sai Tulugu La Clínica is a federally qualified health center (FQHC) that operates several school-based health centers (SBHCs) in partnership with the Oakland Unified School District. The health center was founded in 1971 by a group of students at the University of California, Berkeley, as a community-based clinic to address the lack of high-quality and consistent healthcare for low-income residents in the East Bay. La Clínica has been a pioneer in its approach to training providers to administer Naloxone – a medicine that rapidly reverses an opioid overdoses in as little as 2-3 minutes – in SBHCs. The Naloxone distribution programs started out of a concern from an employee who noticed the hyper-prevalent use of narcotics in the community, often being found in colorful, attractive forms to draw the attention of children. Karen Gersten-Rothenberg, an associate medical director at La Clínica de la Raza, said SBHCs should focus on how opioids are distributed in the community when coming up with a strategy for addressing opioid use. A common strategy is a drug exchange where the community can safely dispose of excess prescription or recreational substances in a safe, hygienic center. These centers could also be an opportune setting to distribute naloxone and answer questions about the use of naloxone. Another strategy is an education program, where peer-health educators come to classrooms and explain to students what naloxone is and where they can access it. Gersten-Rothenberg underscores the importance of using the harm-reduction model to give students the autonomy to make their own decisions about their health, while providing them the resources to be safe in the case of a medical emergency. <h3>Addressing Concerns</h3> SBHCs may encounter concerns from the community, school board, or other entities. Focusing on community problems is an important strategy to explain to community members that the role of naloxone distribution is not to encourage opioid use, but rather to prevent emergencies from occurring due to misuse. Another long-term goal of some public health entities is to educate pharmacists about naloxone and change the standard of care to require naloxone prescription with a standard opioid prescription. Normalizing naloxone in the pharmaceutical setting, may influence opinions in the general public and lead to normalization in SBHC settings. <h3>Support for Schools & SBHCs</h3> The Naloxone Distribution Project (NDP) was created by the California Department of Health Care Services and provides free naloxone to registered entities including schools, universities,",
          "Department of Health Care Services and provides free naloxone to registered entities including schools, universities, and community organizations. Some steps to take include: <h3>Using Naloxone</h3> Telltale signs of an opioid overdose include: When in doubt, it is usually best to administer Naloxone as this medication has no effects on a person not in overdose. In a person undergoing an opioid overdose, naloxone administration temporarily blocks opioid receptors and causes immediate relief. Side effects such as body aches, increased blood pressure, fever, etc., and professional medical help should be sought. Rescue breathing may be performed if possible. The person should also be watched until professional medical help is available. Sai Tulugu is a member of the California School-Based Health Alliance Youth Board ."
        ]
      },
      "modified": "2025-10-21T00:01:42",
      "slug": "naloxone-in-sbhcs",
      "status": "publish",
      "excerpt": "<p>By Sai Tulugu La Clínica is a federally qualified health center (FQHC) that operates several school-based health centers (SBHCs) in partnership with the Oakland Unified School District. The health center was founded in 1971 by a group of students at the University of California, Berkeley, as a community-based clinic to address the lack of high-quality [&hellip;]</p>\n",
      "children": [],
      "document_uuid": "1041276d-5c0a-54a4-beb3-5de9c883674c"
    },
    {
      "page_id": 2916,
      "title": "Engaging Youth in Tobacco Prevention",
      "link": "https://www.schoolhealthcenters.org/engaging-youth-in-tobacco-prevention/",
      "content": {
        "full_text": "The most effective way to reach young people with prevention education is through their peers. School-based health centers excel at engaging youth in peer-to-peer education campaigns to improve population health. The California School-Based Health Alliance and The Los Angeles Trust for Children’s Health – which serves as the Los Angeles Unified School District’s backbone health entity – partnered to educate high school students on tobacco and vaping prevention. Youth learned about nicotine addiction, e-cigarette ingredients, and the harmful health effects of smoking and vaping from the Stanford University Tobacco Prevention Toolkit and then created projects to share their knowledge schoolwide. Student Advisory Boards (SAB) at eight LAUSD high schools conducted a joint in-person and social media campaign to mark World No Tobacco Day to educate students on: Youth leaders reached additional youth through interactive social media polls that educated them on the concept of addiction and the chemicals inside JUUL pods. In-person events held at schools urged students to commit to stop smoking and vaping or to pledge to never start. One SAB participant participated in a press conference to spotlight how tobacco companies target young people and the African-American community specifically with menthol cigarettes. Youth engagement teaches students valuable leadership skills while also empowering all students how to turn knowledge about a health challenge into advocacy and preventive action. I learned that [big tobacco] spends $1 million a minute on advertising.” “What shocked me was … that cigarettes are responsible for the death of a lot of people but [tobacco companies] don’t get criminally charged” “I was surprised how much I ended up learning from other students when I shared the information I got during trainings with them.” These projects are supported with grants from the California Department of Education Tobacco-Use Prevention Education Program .",
        "chunks": [
          "The most effective way to reach young people with prevention education is through their peers. School-based health centers excel at engaging youth in peer-to-peer education campaigns to improve population health. The California School-Based Health Alliance and The Los Angeles Trust for Children’s Health – which serves as the Los Angeles Unified School District’s backbone health entity – partnered to educate high school students on tobacco and vaping prevention. Youth learned about nicotine addiction, e-cigarette ingredients, and the harmful health effects of smoking and vaping from the Stanford University Tobacco Prevention Toolkit and then created projects to share their knowledge schoolwide. Student Advisory Boards (SAB) at eight LAUSD high schools conducted a joint in-person and social media campaign to mark World No Tobacco Day to educate students on: Youth leaders reached additional youth through interactive social media polls that educated them on the concept of addiction and the chemicals inside JUUL pods. In-person events held at schools urged students to commit to stop smoking and vaping or to pledge to never start. One SAB participant participated in a press conference to spotlight how tobacco companies target young people and the African-American community specifically with menthol cigarettes. Youth engagement teaches students valuable leadership skills while also empowering all students how to turn knowledge about a health challenge into advocacy and preventive action. I learned that [big tobacco] spends $1 million a minute on advertising.” “What shocked me was … that cigarettes are responsible for the death of a lot of people but [tobacco companies] don’t get criminally charged” “I was surprised how much I ended up learning from other students when I shared the information I got during trainings with them.” These projects are supported with grants from the California Department of Education Tobacco-Use Prevention Education Program ."
        ]
      },
      "modified": "2025-10-17T15:40:19",
      "slug": "engaging-youth-in-tobacco-prevention",
      "status": "publish",
      "excerpt": "<p>The most effective way to reach young people with prevention education is through their peers. School-based health centers excel at engaging youth in peer-to-peer education campaigns to improve population health. The California School-Based Health Alliance and&nbsp;The Los Angeles Trust for Children’s Health&nbsp;– which serves as the Los Angeles Unified School District’s backbone health entity – [&hellip;]</p>\n",
      "children": [],
      "document_uuid": "f3d6c998-1dac-568d-9965-0b4fd0d57c96"
    },
    {
      "page_id": 2852,
      "title": "From the Garden to the Kitchen: West Oakland Middle School (WOMS)",
      "link": "https://www.schoolhealthcenters.org/from-the-garden-to-the-kitchen-west-oakland-middle-school-woms/",
      "content": {
        "full_text": "WOMS is deeply engaged in making the campus and community healthier places for students to live, work, and play. The school-based health center’s (SBHC) leaders are focusing on primary prevention to complement the much-needed medical care. New efforts to promote healthy eating are bringing many stakeholders – including students, parents, community members, and others – together. The school garden has been a huge success, providing students with experiential environmental and nutrition education. Groups of students, including the boys’ basket- ball team, tend the garden from planting to harvesting – and then eat their results. For many, the garden provides an opportunity for a new, deeply engaging and rewarding school experience. This experience has also influence families’ food choices and habits, with students prompting new meal and snack ideas. Recently, OBUGS, which coordinates the garden program, merged with LifeLong Medical Care (the SBHC’s lead agency) creating an even stronger partnership for health and facilitating better integration between clinical and non-clinical care, between prevention and treatment. In addition, WOMS families are engaging in a community-based, community-driven series of cooking classes. Organized jointly by SBHC leaders and other neighborhood groups, the classes include an introductory eight-week series as well as specific classes focused on particular health issues. Every session, attendance grows. Finally, the SBHC facilitates a weekly back pack food program in collaboration with Alameda County that serves 50 WOMS families to help improve their healthy eating habits.",
        "chunks": [
          "WOMS is deeply engaged in making the campus and community healthier places for students to live, work, and play. The school-based health center’s (SBHC) leaders are focusing on primary prevention to complement the much-needed medical care. New efforts to promote healthy eating are bringing many stakeholders – including students, parents, community members, and others – together. The school garden has been a huge success, providing students with experiential environmental and nutrition education. Groups of students, including the boys’ basket- ball team, tend the garden from planting to harvesting – and then eat their results. For many, the garden provides an opportunity for a new, deeply engaging and rewarding school experience. This experience has also influence families’ food choices and habits, with students prompting new meal and snack ideas. Recently, OBUGS, which coordinates the garden program, merged with LifeLong Medical Care (the SBHC’s lead agency) creating an even stronger partnership for health and facilitating better integration between clinical and non-clinical care, between prevention and treatment. In addition, WOMS families are engaging in a community-based, community-driven series of cooking classes. Organized jointly by SBHC leaders and other neighborhood groups, the classes include an introductory eight-week series as well as specific classes focused on particular health issues. Every session, attendance grows. Finally, the SBHC facilitates a weekly back pack food program in collaboration with Alameda County that serves 50 WOMS families to help improve their healthy eating habits."
        ]
      },
      "modified": "2025-07-02T21:57:54",
      "slug": "from-the-garden-to-the-kitchen-west-oakland-middle-school-woms",
      "status": "publish",
      "excerpt": "<p>WOMS is deeply engaged in making the campus and community healthier places for students to live, work, and play. The school-based health center&#8217;s (SBHC) leaders are focusing on primary prevention to complement the much-needed medical care. New efforts to promote healthy eating are bringing many stakeholders – including students, parents, community members, and others – [&hellip;]</p>\n",
      "children": [],
      "document_uuid": "72b62ef3-8636-5905-bb7c-5d62799a767f"
    },
    {
      "page_id": 2850,
      "title": "Healthier Foods at School and at Home: Urban Promise Academy (UPA)",
      "link": "https://www.schoolhealthcenters.org/healthier-foods-at-school-and-at-home-urban-promise-academy-upa/",
      "content": {
        "full_text": "Over the past few years, UPA – led by Wellness Champions from both the Hawthorne Clinic school-based health center (SBHC) and its Family Resource Center – have made great strides in improving the school’s food offerings and overall school food environment. At UPA, every student participates in a morning “crew,” an enhanced homeroom experience that includes time for students to eat a relaxed breakfast. The health educator from the Hawthorne Clinic and the school nurse co-lead a “crew,” giving them the opportunity to engage directly with a small group of students. The breakfasts themselves have evolved to include more fruit and whole grains. And, working closely with the cafeteria manager, who is a strong advocate for children’s nutrition, parents have the opportunity to give input into the breakfast menus, improving appeal and quality. Lunch choices have also gotten tastier. Students advocated for improvements to the school’s salad bar, which resulted in parent volunteers from the Family Resource Center preparing the salad bar each morning to make sure students get what they want. And, at honor roll celebrations, students enjoy healthy smoothies rather than ice cream sundaes. With leadership from the Wellness Champions and Physical Education teacher, UPA started growing its own food on campus. The Family Resource Center engages students and families in regular gardening programs and in deciding what to grow. Volunteers range from early morning helpers who plant, weed, water, and harvest, as well a more intensive gardening during the summer. The space draws in the entire UPA community. Finally, UPA is working to improve food choices not just on campus but also in homes. The school collaborates with the Alameda County Food Bank to deliver food to families and the Family Resource Center has convinced local fruit stands to donate to UPA.",
        "chunks": [
          "Over the past few years, UPA – led by Wellness Champions from both the Hawthorne Clinic school-based health center (SBHC) and its Family Resource Center – have made great strides in improving the school’s food offerings and overall school food environment. At UPA, every student participates in a morning “crew,” an enhanced homeroom experience that includes time for students to eat a relaxed breakfast. The health educator from the Hawthorne Clinic and the school nurse co-lead a “crew,” giving them the opportunity to engage directly with a small group of students. The breakfasts themselves have evolved to include more fruit and whole grains. And, working closely with the cafeteria manager, who is a strong advocate for children’s nutrition, parents have the opportunity to give input into the breakfast menus, improving appeal and quality. Lunch choices have also gotten tastier. Students advocated for improvements to the school’s salad bar, which resulted in parent volunteers from the Family Resource Center preparing the salad bar each morning to make sure students get what they want. And, at honor roll celebrations, students enjoy healthy smoothies rather than ice cream sundaes. With leadership from the Wellness Champions and Physical Education teacher, UPA started growing its own food on campus. The Family Resource Center engages students and families in regular gardening programs and in deciding what to grow. Volunteers range from early morning helpers who plant, weed, water, and harvest, as well a more intensive gardening during the summer. The space draws in the entire UPA community. Finally, UPA is working to improve food choices not just on campus but also in homes. The school collaborates with the Alameda County Food Bank to deliver food to families and the Family Resource Center has convinced local fruit stands to donate to UPA."
        ]
      },
      "modified": "2025-07-02T21:53:46",
      "slug": "healthier-foods-at-school-and-at-home-urban-promise-academy-upa",
      "status": "publish",
      "excerpt": "<p>Over the past few years, UPA – led by Wellness Champions from both the Hawthorne Clinic school-based health center (SBHC) and its Family Resource Center – have made great strides in improving the school’s food offerings and overall school food environment. At UPA, every student participates in a morning “crew,” an enhanced homeroom experience that [&hellip;]</p>\n",
      "children": [],
      "document_uuid": "b9a35e39-56a2-5074-a1ff-58172fc6f1db"
    },
    {
      "page_id": 2838,
      "title": "Innovative Eating With Grab-N-Go Breakfasts: Fremont High School",
      "link": "https://www.schoolhealthcenters.org/innovative-eating-with-grab-n-go-breakfasts-fremont-high-school/",
      "content": {
        "full_text": "Fremont High School began offering a free, hot breakfast to any student who showed up to the cafeteria between 7:45 a.m. and 8:10 a.m. Unfortunately, few students arrived at school early enough to eat. Fremont’s Youth Wellness Advisory Board is a diverse group of students with a shared commitment to advocating for positive policy change and advancing school wellness. With encouragement from the health educator from the Tiger Clinic School-Based Health Center (SBHC), the Advisory Board was eager to improve students’ eating habits. They invited the Director of Nutrition Services for Oakland Unified School District to talk with them about possible changes to Fremont’s meal program. The Director was impressed by the Advisory Board’s enthusiasm and organization and proposed piloting a new way of serving breakfast: the Grab-N-Go Breakfast. With the Grab-N-Go Break- fast, students could pick up a bagged meal at the school gate and bring it to class, increasing participation in the program, bringing in more federal funding, and ultimately improving food quality. Over several months, the Advisory Board, with the support of the SBHC, the School Wellness Committee, and the school’s cafeteria staff, advocated for Grab-N-Go with administrators and teachers. They had one-on-one conversations. They created presentations, using data from the statewide Breakfast First coalition. They attended staff meetings to make their case. Some adults were immediately receptive, while others needed convincing. Ultimately, though, everyone agreed to a trial run. Today, Grab-N-Go Breakfast is well-established and increasingly well-used. Many more Fremont students are eating breakfast – sometimes it’s a bagel, sometimes granola, sometimes another entrée, as well as juice and, if they want it, milk. (The Advisory Board gave feedback on the menu, even taste-testing the meals.) The system is efficient and simple: as students walk onto campus, they pick up a meal and bring it to class. Meanwhile, a cafeteria worker makes a tally mark for another well-fed student!",
        "chunks": [
          "Fremont High School began offering a free, hot breakfast to any student who showed up to the cafeteria between 7:45 a.m. and 8:10 a.m. Unfortunately, few students arrived at school early enough to eat. Fremont’s Youth Wellness Advisory Board is a diverse group of students with a shared commitment to advocating for positive policy change and advancing school wellness. With encouragement from the health educator from the Tiger Clinic School-Based Health Center (SBHC), the Advisory Board was eager to improve students’ eating habits. They invited the Director of Nutrition Services for Oakland Unified School District to talk with them about possible changes to Fremont’s meal program. The Director was impressed by the Advisory Board’s enthusiasm and organization and proposed piloting a new way of serving breakfast: the Grab-N-Go Breakfast. With the Grab-N-Go Break- fast, students could pick up a bagged meal at the school gate and bring it to class, increasing participation in the program, bringing in more federal funding, and ultimately improving food quality. Over several months, the Advisory Board, with the support of the SBHC, the School Wellness Committee, and the school’s cafeteria staff, advocated for Grab-N-Go with administrators and teachers. They had one-on-one conversations. They created presentations, using data from the statewide Breakfast First coalition. They attended staff meetings to make their case. Some adults were immediately receptive, while others needed convincing. Ultimately, though, everyone agreed to a trial run. Today, Grab-N-Go Breakfast is well-established and increasingly well-used. Many more Fremont students are eating breakfast – sometimes it’s a bagel, sometimes granola, sometimes another entrée, as well as juice and, if they want it, milk. (The Advisory Board gave feedback on the menu, even taste-testing the meals.) The system is efficient and simple: as students walk onto campus, they pick up a meal and bring it to class. Meanwhile, a cafeteria worker makes a tally mark for another well-fed student!"
        ]
      },
      "modified": "2025-08-07T17:13:03",
      "slug": "innovative-eating-with-grab-n-go-breakfasts-fremont-high-school",
      "status": "publish",
      "excerpt": "<p>Fremont High School began offering a free, hot breakfast to any student who showed up to the cafeteria between 7:45 a.m. and 8:10 a.m. Unfortunately, few students arrived at school early enough to eat. Fremont’s Youth Wellness Advisory Board is a diverse group of students with a shared commitment to advocating for positive policy change [&hellip;]</p>\n",
      "children": [],
      "document_uuid": "5192c256-fc70-5ed8-853a-2ad7c47e26da"
    },
    {
      "page_id": 2801,
      "title": "SBHC Boosts Health &amp; Attendance in a Rural Community",
      "link": "https://www.schoolhealthcenters.org/sbhc-boosts-health-attendance-in-a-rural-community/",
      "content": {
        "full_text": "Kerman is a city located 15 miles outside of Fresno in California’s rural San Joaquin Valley, which is a major agricultural area. Kerman Unified opened a school-based health center (SBHC) in 2013 to serve all students at the eight schools in the district. It is operated by Valley Health Team, a local Federally Qualified Health Center (FQHC). Robert Frausto, the Superintendent of Kerman Unified, said he chose the site for the SBHC strategically because the school campus is located within walking distance for all students in the district. The SBHC is staffed by a full-time physician, behavioral health clinicians, and two medical assistants. It has three exam rooms for primary care services. Providers see students and community members for well-child visits, sports physicals, hearing and vision screenings, sick visits, and behavioral health, among many other services. Students have a separate entrance to the clinic and the SBHC partners with the school nurse to care for students injured while at school. Watch a video tour of the SBHC. The behavioral health clinic provides mental health care for students – ranging from serious concerns about trauma to just needing someone to talk to. Primary care and behavioral health are integrated and the team collaborates daily to provide optimal care to patients. In 2020, the clinic began offering drive-through COVID testing to members of the community. COVID vaccinations are also being offered at the site. “A few weeks back my daughter who attends Kerman Middle had a rapid heart rate. I brought her to a Valley Health Team clinic. The school site now has all the information so if anything should arise in the future, she can get care right away.” – parent of a Kerman Unified student Superintendent Frausto credits the SBHC with Kerman Unified’s award-winning attendance record because it cuts down on absences that many times are caused by students missing a full day of school because of a doctor’s appointment. Those visits are now much more efficient because students do not have to leave campus. Superintendent Frausto says his district’s solid partnership with Valley Health Team is key to the success of the SBHC in meeting the needs of the students and the community. He recalls one year when 30 kindergarten students all needed vaccinations or they would not be able to start school. He called up Valley Health Team and the immunizations were handled at the SBHC in short order. Valley Health Team CEO Soyla Griffin says her FQHC’s mission is to do whatever it takes to keep children in the community healthy, and the SBHC is a great way to achieve that goal. Parents also credit the SBHC with providing them with a sense of security. “A few weeks back my daughter who attends Kerman Middle had a rapid heart rate. I brought her to a Valley Health Team clinic. The school site now has all the information so if anything should arise in the future, she can get care right away,” said a parent of a Kerman Unified student. <h2>Stay Up-to-Date on School-Based Health</h2> Sign up to receive our free newsletter and advocate for kids’ health. Organizations that want to receive technical assistance, discounted conference registration, and access to regular member calls can become a member.",
        "chunks": [
          "Kerman is a city located 15 miles outside of Fresno in California’s rural San Joaquin Valley, which is a major agricultural area. Kerman Unified opened a school-based health center (SBHC) in 2013 to serve all students at the eight schools in the district. It is operated by Valley Health Team, a local Federally Qualified Health Center (FQHC). Robert Frausto, the Superintendent of Kerman Unified, said he chose the site for the SBHC strategically because the school campus is located within walking distance for all students in the district. The SBHC is staffed by a full-time physician, behavioral health clinicians, and two medical assistants. It has three exam rooms for primary care services. Providers see students and community members for well-child visits, sports physicals, hearing and vision screenings, sick visits, and behavioral health, among many other services. Students have a separate entrance to the clinic and the SBHC partners with the school nurse to care for students injured while at school. Watch a video tour of the SBHC. The behavioral health clinic provides mental health care for students – ranging from serious concerns about trauma to just needing someone to talk to. Primary care and behavioral health are integrated and the team collaborates daily to provide optimal care to patients. In 2020, the clinic began offering drive-through COVID testing to members of the community. COVID vaccinations are also being offered at the site. “A few weeks back my daughter who attends Kerman Middle had a rapid heart rate. I brought her to a Valley Health Team clinic. The school site now has all the information so if anything should arise in the future, she can get care right away.” – parent of a Kerman Unified student Superintendent Frausto credits the SBHC with Kerman Unified’s award-winning attendance record because it cuts down on absences that many times are caused by students missing a full day of school because of a doctor’s appointment. Those visits are now much more efficient because students do not have to leave campus. Superintendent Frausto says his district’s solid partnership with Valley Health Team is key to the success of the SBHC in meeting the needs of the students and the community. He recalls one year when 30 kindergarten students all needed vaccinations or they would not be able to start school. He called up Valley Health Team and the immunizations were handled at the SBHC in short",
          "called up Valley Health Team and the immunizations were handled at the SBHC in short order. Valley Health Team CEO Soyla Griffin says her FQHC’s mission is to do whatever it takes to keep children in the community healthy, and the SBHC is a great way to achieve that goal. Parents also credit the SBHC with providing them with a sense of security. “A few weeks back my daughter who attends Kerman Middle had a rapid heart rate. I brought her to a Valley Health Team clinic. The school site now has all the information so if anything should arise in the future, she can get care right away,” said a parent of a Kerman Unified student. <h2>Stay Up-to-Date on School-Based Health</h2> Sign up to receive our free newsletter and advocate for kids’ health. Organizations that want to receive technical assistance, discounted conference registration, and access to regular member calls can become a member."
        ]
      },
      "modified": "2025-08-01T21:43:07",
      "slug": "sbhc-boosts-health-attendance-in-a-rural-community",
      "status": "publish",
      "excerpt": "<p>Kerman is a city located 15 miles outside of Fresno in California’s rural San Joaquin Valley, which is a major agricultural area. Kerman Unified opened a school-based health center (SBHC) in 2013 to serve all students at the eight schools in the district. It is operated by Valley Health Team, a local Federally Qualified Health [&hellip;]</p>\n",
      "children": [],
      "document_uuid": "d883c49b-2862-5709-9171-4ebb51b6a72c"
    }
  ]
}