{
  "empty_pages_count": 0,
  "empty_pages": {},
  "special_pages_count": 0,
  "special_pages": {},
  "webpage_tree": [
    {
      "page_id": 4377,
      "title": "Camara Christian",
      "link": "https://www.schoolhealthcenters.org/people/camara-christian/",
      "content": {
        "full_text": "Camara Christian is in her first year as a Youth Board member for the California School-Based Health Alliance. She is a freshman at California State University, Fullerton, where she is pursuing a major in Communications with a focus in Journalism on the Pre-Law track.  Her professional experience includes serving as a Youth Mental Health Intern, becoming part of the first cohort of Peer Mental Health Specialists at Nuview Bridge Early College High School, and interning with The Happier Life Project to support youth and adults from diverse backgrounds. Camara has held leadership roles including Vice President of Associated Student Body, California Scholarship Federation President, and co-founder of her school’s Black Student Union. She has also been a Student Ambassador for Exceleration Elite and a member of the International Thespian Society. She is passionate about advancing youth voice, promoting mental health awareness, and creating equitable opportunities for young people to thrive.",
        "chunks": [
          "Camara Christian is in her first year as a Youth Board member for the California School-Based Health Alliance. She is a freshman at California State University, Fullerton, where she is pursuing a major in Communications with a focus in Journalism on the Pre-Law track. Her professional experience includes serving as a Youth Mental Health Intern, becoming part of the first cohort of Peer Mental Health Specialists at Nuview Bridge Early College High School, and interning with The Happier Life Project to support youth and adults from diverse backgrounds. Camara has held leadership roles including Vice President of Associated Student Body, California Scholarship Federation President, and co-founder of her school’s Black Student Union. She has also been a Student Ambassador for Exceleration Elite and a member of the International Thespian Society. She is passionate about advancing youth voice, promoting mental health awareness, and creating equitable opportunities for young people to thrive."
        ]
      },
      "modified": "2025-09-04T18:16:35",
      "slug": "camara-christian",
      "status": "publish",
      "excerpt": "<p>Camara Christian is in her first year as a Youth Board member for the California School-Based Health Alliance. She is a freshman at California State University, Fullerton, where she is pursuing a major in Communications with a focus in Journalism on the Pre-Law track.  Her professional experience includes serving as a Youth Mental Health Intern, becoming [&hellip;]</p>\n",
      "children": [],
      "document_uuid": "52636133-76fb-55cc-a7b0-29d7983d64ee"
    },
    {
      "page_id": 2383,
      "title": "Taaliyah Tucker",
      "link": "https://www.schoolhealthcenters.org/people/taaliyah-tucker/",
      "content": {
        "full_text": "Taaliyah is a dedicated advocate for mental and social health justice, currently serving in her third year as a Youth Board member. She is also a fourth-year student at Los Angeles Technical Trade College (LATTC), majoring in Health & Related Sciences, and she is proud of how far she has come in her journey. Her passion for advocacy was ignited in high school, where she transitioned from a focus on Culinary Arts to championing social justice and mental health issues. Taaliyah’s leadership skills were further developed through her involvement with the Los Angeles Trust for Children’s Health – Student Advisory Board, where she played a key role in initiatives aimed at improving Los Angeles Unified School District (LAUSD) schools and communities. In her current capacity, Taaliyah has been deeply involved in significant legislative efforts, including her work on the SB-954 Youth Health and Safety Act and conducting an interview with Senator Menjivar. She is also a committed supporter of the School-Based Health and Education Partnership Program, passionately advocating for health engagement among teens and young adults. As she continues her advocacy work, Taaliyah is focused on expanding her impact at the state level, ensuring that her voice and the voices of others are heard by a broader range of lawmakers. Her unwavering commitment to advancing social and mental health justice underscores her role as a powerful advocate for those who cannot speak for themselves.",
        "chunks": [
          "Taaliyah is a dedicated advocate for mental and social health justice, currently serving in her third year as a Youth Board member. She is also a fourth-year student at Los Angeles Technical Trade College (LATTC), majoring in Health & Related Sciences, and she is proud of how far she has come in her journey. Her passion for advocacy was ignited in high school, where she transitioned from a focus on Culinary Arts to championing social justice and mental health issues. Taaliyah’s leadership skills were further developed through her involvement with the Los Angeles Trust for Children’s Health – Student Advisory Board, where she played a key role in initiatives aimed at improving Los Angeles Unified School District (LAUSD) schools and communities. In her current capacity, Taaliyah has been deeply involved in significant legislative efforts, including her work on the SB-954 Youth Health and Safety Act and conducting an interview with Senator Menjivar. She is also a committed supporter of the School-Based Health and Education Partnership Program, passionately advocating for health engagement among teens and young adults. As she continues her advocacy work, Taaliyah is focused on expanding her impact at the state level, ensuring that her voice and the voices of others are heard by a broader range of lawmakers. Her unwavering commitment to advancing social and mental health justice underscores her role as a powerful advocate for those who cannot speak for themselves."
        ]
      },
      "modified": "2025-09-04T18:07:34",
      "slug": "taaliyah-tucker",
      "status": "publish",
      "excerpt": "<p>Taaliyah is a dedicated advocate for mental and social health justice, currently serving in her third year as a Youth Board member. She is also a fourth-year student at Los Angeles Technical Trade College (LATTC), majoring in Health &amp; Related Sciences, and she is proud of how far she has come in her journey. Her passion [&hellip;]</p>\n",
      "children": [],
      "document_uuid": "f067b9a6-e442-5f3e-9884-58572e718b3c"
    },
    {
      "page_id": 2379,
      "title": "Saivishnu Tulugu",
      "link": "https://www.schoolhealthcenters.org/people/saivishnu-tulugu/",
      "content": {
        "full_text": "Saivishnu is a fourth-year member of the Youth Board. He is in his fourth year at the University of California, Irvine, intending to major in Public Health and minor in Chicano/Latino studies. He is passionate about health and social justice and the importance of addressing structural barriers to health in underserved communities. In high school, he co-founded Break the Outbreak Inc to address the PPE shortage in his community and provide essential protection equipment to small businesses and vulnerable individuals. At UC Irvine, Saivishnu is involved with organizations such as The Free Clinic Project and Fresh Basic Needs Hub, to put his passion for community service and health justice into tangible change within his community. He is also involved with clinical research at the Akbari Lab studying neurological recovery in post-cardiac arrest rat models to better understand the implications of global ischemia. After graduating, Saivishnu hopes to attend medical school and pursue a career in interventional cardiology, to bridge his interests in patient care, public health, and research.",
        "chunks": [
          "Saivishnu is a fourth-year member of the Youth Board. He is in his fourth year at the University of California, Irvine, intending to major in Public Health and minor in Chicano/Latino studies. He is passionate about health and social justice and the importance of addressing structural barriers to health in underserved communities. In high school, he co-founded Break the Outbreak Inc to address the PPE shortage in his community and provide essential protection equipment to small businesses and vulnerable individuals. At UC Irvine, Saivishnu is involved with organizations such as The Free Clinic Project and Fresh Basic Needs Hub, to put his passion for community service and health justice into tangible change within his community. He is also involved with clinical research at the Akbari Lab studying neurological recovery in post-cardiac arrest rat models to better understand the implications of global ischemia. After graduating, Saivishnu hopes to attend medical school and pursue a career in interventional cardiology, to bridge his interests in patient care, public health, and research."
        ]
      },
      "modified": "2025-05-27T22:49:18",
      "slug": "saivishnu-tulugu",
      "status": "publish",
      "excerpt": "<p>Saivishnu is a fourth-year member of the Youth Board. He is in his fourth year at the University of California, Irvine, intending to major in Public Health and minor in Chicano/Latino studies. He is passionate about health and social justice and the importance of addressing structural barriers to health in underserved communities. In high school, [&hellip;]</p>\n",
      "children": [],
      "document_uuid": "b289bcdf-5bf5-59d1-8b3b-7e73ee7159b7"
    },
    {
      "page_id": 2375,
      "title": "Rehma Shahid",
      "link": "https://www.schoolhealthcenters.org/people/rehma-shahid/",
      "content": {
        "full_text": "Rehma is in her second year as a Youth Board member for the California School-Based Health Alliance. She is in her second year at Diablo Valley College as a biology major with the intention to transfer. After obtaining her associate degree, she plans to transfer to UC for further education and pursue a career in medicine. Rehma, as a Youth Board member, aims to utilize her leadership skills to advocate as a youth leader in her community and work towards creating a safe and welcoming environment where teens can share their experiences. Over the years, Rehma discovered her passion for public health through her work and internships with various organizations. At school, she worked with Discovering the Realities of Our Community, an organization focused on transforming the community and promoting environmental prevention of alcohol and drug abuse. Rehma engaged with her state representatives on these matters, managed inventories, implemented improvement strategies, facilitated meetings, learned about local policies, generated monthly reports, and built meaningful relationships. She was involved with the CourAGE (Advocacy Generation Education) program for four years, where she educated the public about the harmful effects of alcohol, tobacco, and other substances by organizing workshops and participating in a countywide conference with youth-led workshops on substance misuse. She also developed advocacy projects and implemented improvement plans while building relationships to motivate others to make healthier choices. Rehma felt empowered to hear youth voices and found it meaningful to hear younger youths wanting to amplify their voice and be a positive influence on their peers.",
        "chunks": [
          "Rehma is in her second year as a Youth Board member for the California School-Based Health Alliance. She is in her second year at Diablo Valley College as a biology major with the intention to transfer. After obtaining her associate degree, she plans to transfer to UC for further education and pursue a career in medicine. Rehma, as a Youth Board member, aims to utilize her leadership skills to advocate as a youth leader in her community and work towards creating a safe and welcoming environment where teens can share their experiences. Over the years, Rehma discovered her passion for public health through her work and internships with various organizations. At school, she worked with Discovering the Realities of Our Community, an organization focused on transforming the community and promoting environmental prevention of alcohol and drug abuse. Rehma engaged with her state representatives on these matters, managed inventories, implemented improvement strategies, facilitated meetings, learned about local policies, generated monthly reports, and built meaningful relationships. She was involved with the CourAGE (Advocacy Generation Education) program for four years, where she educated the public about the harmful effects of alcohol, tobacco, and other substances by organizing workshops and participating in a countywide conference with youth-led workshops on substance misuse. She also developed advocacy projects and implemented improvement plans while building relationships to motivate others to make healthier choices. Rehma felt empowered to hear youth voices and found it meaningful to hear younger youths wanting to amplify their voice and be a positive influence on their peers."
        ]
      },
      "modified": "2025-09-04T18:07:01",
      "slug": "rehma-shahid",
      "status": "publish",
      "excerpt": "<p>Rehma is in her second year as a Youth Board member for the California School-Based Health Alliance. She is in her second year at Diablo Valley College as a biology major with the intention to transfer. After obtaining her associate degree, she plans to transfer to UC for further education and pursue a career in [&hellip;]</p>\n",
      "children": [],
      "document_uuid": "2c822942-1823-557a-9910-643c91aae819"
    },
    {
      "page_id": 2371,
      "title": "Nancy Aguilar",
      "link": "https://www.schoolhealthcenters.org/people/nancy-aguilar/",
      "content": {
        "full_text": "Nancy Aguilar is a writer, artist, advocate, and a third-year Youth Board member from Fresno, CA, with over five years of youth advocacy work experience. She is also a youth member for the Youth Leadership Institute (YLI), where she is a part of many Fresno-based and statewide programs. Nancy has worked on multiple public service announcements and campaigns that highlight prevention efforts for underage drinking, smoking, substance use, and gambling. Being a part of the HOPE youth coalition, a statewide YLI program, she participated in advocacy efforts to address the harmful presence of alcohol and substance advertisements on social media. Her art can be seen published in multiple zine and publication art covers for YLI. Nancy also had the opportunity to participate at the Mental Health Matters Day press conference at the California State Capital, where she presented the impacts of social media on youth’s mental health and provided recommendations to address these issues alongside State Assembly member Buffy Wicks, and California’s First Lady Jennifer Siebel Newsome. Nancy hopes to continue pursuing her passion for both art and advocating for youth’s mental health.",
        "chunks": [
          "Nancy Aguilar is a writer, artist, advocate, and a third-year Youth Board member from Fresno, CA, with over five years of youth advocacy work experience. She is also a youth member for the Youth Leadership Institute (YLI), where she is a part of many Fresno-based and statewide programs. Nancy has worked on multiple public service announcements and campaigns that highlight prevention efforts for underage drinking, smoking, substance use, and gambling. Being a part of the HOPE youth coalition, a statewide YLI program, she participated in advocacy efforts to address the harmful presence of alcohol and substance advertisements on social media. Her art can be seen published in multiple zine and publication art covers for YLI. Nancy also had the opportunity to participate at the Mental Health Matters Day press conference at the California State Capital, where she presented the impacts of social media on youth’s mental health and provided recommendations to address these issues alongside State Assembly member Buffy Wicks, and California’s First Lady Jennifer Siebel Newsome. Nancy hopes to continue pursuing her passion for both art and advocating for youth’s mental health."
        ]
      },
      "modified": "2025-09-05T17:42:34",
      "slug": "nancy-aguilar",
      "status": "publish",
      "excerpt": "<p>Nancy Aguilar is a writer, artist, advocate, and a third-year Youth Board member from Fresno, CA, with over five years of youth advocacy work experience. She is also a youth member for the Youth Leadership Institute (YLI), where she is a part of many Fresno-based and statewide programs. Nancy has worked on multiple public service [&hellip;]</p>\n",
      "children": [],
      "document_uuid": "4de22285-bf19-5ffb-87a6-f26e229e12ea"
    },
    {
      "page_id": 2366,
      "title": "Jubilee Adams",
      "link": "https://www.schoolhealthcenters.org/people/jubilee-adams/",
      "content": {
        "full_text": "Jubilee Adams is a second-year Youth Board member and a third-year student at the University of California, Santa Cruz. Jubilee is on an accelerated pathway to graduation, where she is projected to graduate in three years with a Bachelor of Science in Global and Community Health. Jubilee volunteers her time with Planned Parenthood Mar Monte as a patient escort and volunteer ambassador, and also works for UC Santa Cruz as a part of the Student Health Outreach and Promotion team. Jubilee is also currently in progress to become EMT-B certified. Her passion for youth engagement, specifically concerning health, stems from her personal experiences with school-based health centers as a young person. Jubilee is incredibly passionate about eliminating systemic barriers to good health and hopes to incorporate her knowledge of public health into her career as a healthcare provider. After graduation this spring, Jubilee hopes to work as an EMT and eventually attend Physician Assistant (PA) school as she continues her education beyond her undergraduate studies. In her free time, Jubilee enjoys running and training for races, hiking, biking, camping, spending time outside, and cooking.",
        "chunks": [
          "Jubilee Adams is a second-year Youth Board member and a third-year student at the University of California, Santa Cruz. Jubilee is on an accelerated pathway to graduation, where she is projected to graduate in three years with a Bachelor of Science in Global and Community Health. Jubilee volunteers her time with Planned Parenthood Mar Monte as a patient escort and volunteer ambassador, and also works for UC Santa Cruz as a part of the Student Health Outreach and Promotion team. Jubilee is also currently in progress to become EMT-B certified. Her passion for youth engagement, specifically concerning health, stems from her personal experiences with school-based health centers as a young person. Jubilee is incredibly passionate about eliminating systemic barriers to good health and hopes to incorporate her knowledge of public health into her career as a healthcare provider. After graduation this spring, Jubilee hopes to work as an EMT and eventually attend Physician Assistant (PA) school as she continues her education beyond her undergraduate studies. In her free time, Jubilee enjoys running and training for races, hiking, biking, camping, spending time outside, and cooking."
        ]
      },
      "modified": "2025-09-06T19:04:51",
      "slug": "jubilee-adams",
      "status": "publish",
      "excerpt": "<p>Jubilee Adams is a second-year Youth Board member and a third-year student at the University of California, Santa Cruz. Jubilee is on an accelerated pathway to graduation, where she is projected to graduate in three years with a Bachelor of Science in Global and Community Health. Jubilee volunteers her time with Planned Parenthood Mar Monte [&hellip;]</p>\n",
      "children": [],
      "document_uuid": "4059cb44-7302-56f4-9ec8-338917f17d51"
    },
    {
      "page_id": 2362,
      "title": "Carmen Vega",
      "link": "https://www.schoolhealthcenters.org/people/carmen-vega/",
      "content": {
        "full_text": "MSLM, CHW Director of Community Supports, Inland Empire Health Plan",
        "chunks": [
          "MSLM, CHW Director of Community Supports, Inland Empire Health Plan"
        ]
      },
      "modified": "2025-09-04T19:45:17",
      "slug": "carmen-vega",
      "status": "publish",
      "excerpt": "<p>MSLM, CHW Director of Community Supports, Inland Empire Health Plan</p>\n",
      "children": [],
      "document_uuid": "b2ae0fed-ed9b-5288-b932-fc2c0313dcc2"
    },
    {
      "page_id": 2358,
      "title": "Sharla E. Smith",
      "link": "https://www.schoolhealthcenters.org/people/sharla-e-smith/",
      "content": {
        "full_text": "MPH Comprehensive Sexual Education Consultant, California Department of Education",
        "chunks": [
          "MPH Comprehensive Sexual Education Consultant, California Department of Education"
        ]
      },
      "modified": "2025-09-04T19:45:00",
      "slug": "sharla-e-smith",
      "status": "publish",
      "excerpt": "<p>MPH Comprehensive Sexual Education Consultant, California Department of Education</p>\n",
      "children": [],
      "document_uuid": "900af95a-e85d-5811-b6bd-b373ab24b4e4"
    },
    {
      "page_id": 2354,
      "title": "Maryjane Puffer",
      "link": "https://www.schoolhealthcenters.org/people/maryjane-puffer/",
      "content": {
        "full_text": "BSN, MPA Executive Director, The Los Angeles Trust for Children’s Health (The L.A. Trust)",
        "chunks": [
          "BSN, MPA Executive Director, The Los Angeles Trust for Children’s Health (The L.A. Trust)"
        ]
      },
      "modified": "2025-09-04T19:44:40",
      "slug": "maryjane-puffer",
      "status": "publish",
      "excerpt": "<p>BSN, MPA Executive Director, The Los Angeles Trust for Children’s Health (The L.A. Trust)</p>\n",
      "children": [],
      "document_uuid": "aaa7b506-a1c0-5507-8839-6a19ffcc7b45"
    },
    {
      "page_id": 2350,
      "title": "Stephanie Ocampo",
      "link": "https://www.schoolhealthcenters.org/people/stephanie-ocampo/",
      "content": {
        "full_text": "Content Creator Producer, California State Assembly Democratic Caucus",
        "chunks": [
          "Content Creator Producer, California State Assembly Democratic Caucus"
        ]
      },
      "modified": "2025-09-04T19:44:16",
      "slug": "stephanie-ocampo",
      "status": "publish",
      "excerpt": "<p>Content Creator Producer, California State Assembly Democratic Caucus</p>\n",
      "children": [],
      "document_uuid": "ff866182-ef2f-50cb-9baa-3e3f043ad4d0"
    },
    {
      "page_id": 2346,
      "title": "Felipe Mercado",
      "link": "https://www.schoolhealthcenters.org/people/felipe-mercado/",
      "content": {
        "full_text": "EdD, MSW, PPSC Assistant Professor of Social Work, California State University, Fresno",
        "chunks": [
          "EdD, MSW, PPSC Assistant Professor of Social Work, California State University, Fresno"
        ]
      },
      "modified": "2025-09-04T19:42:51",
      "slug": "felipe-mercado",
      "status": "publish",
      "excerpt": "<p>EdD, MSW, PPSC Assistant Professor of Social Work, California State University, Fresno</p>\n",
      "children": [],
      "document_uuid": "3f83a7b8-6802-516a-bbb4-8ba5705b7ab6"
    },
    {
      "page_id": 2336,
      "title": "Michael Lombardo",
      "link": "https://www.schoolhealthcenters.org/people/michael-lombardo/",
      "content": {
        "full_text": "MA Human Services and Education Advisor",
        "chunks": [
          "MA Human Services and Education Advisor"
        ]
      },
      "modified": "2025-09-04T19:43:04",
      "slug": "michael-lombardo",
      "status": "publish",
      "excerpt": "<p>MA Human Services and Education Advisor</p>\n",
      "children": [],
      "document_uuid": "4be00e7b-c2e0-5e26-9c19-bbb8f6b4228c"
    },
    {
      "page_id": 2333,
      "title": "Jazzmin Hicks-Bonam",
      "link": "https://www.schoolhealthcenters.org/people/jazzmin-hicks-bonam/",
      "content": {
        "full_text": "Psy.D, MA, NCRP CEO & Licensed Clinical Forensic Director, B.E.T.T.E.R. Psych Services",
        "chunks": [
          "Psy.D, MA, NCRP CEO & Licensed Clinical Forensic Director, B.E.T.T.E.R. Psych Services"
        ]
      },
      "modified": "2025-09-04T19:43:20",
      "slug": "jazzmin-hicks-bonam",
      "status": "publish",
      "excerpt": "<p>Psy.D, MA, NCRP CEO &amp; Licensed Clinical Forensic Director, B.E.T.T.E.R. Psych Services</p>\n",
      "children": [],
      "document_uuid": "0e1837e5-bcb3-5e07-a3d7-b8bdbd15816e"
    },
    {
      "page_id": 2329,
      "title": "Deanna Niebuhr",
      "link": "https://www.schoolhealthcenters.org/people/deanna-niebuhr/",
      "content": {
        "full_text": "MPP Community Schools Learning Exchange (CSLX)",
        "chunks": [
          "MPP Community Schools Learning Exchange (CSLX)"
        ]
      },
      "modified": "2025-09-04T19:42:09",
      "slug": "deanna-niebuhr",
      "status": "publish",
      "excerpt": "<p>MPP Community Schools Learning Exchange (CSLX)</p>\n",
      "children": [],
      "document_uuid": "17bde19b-7046-55a0-baf8-612aa7691a2f"
    },
    {
      "page_id": 2324,
      "title": "Dareen Khatib",
      "link": "https://www.schoolhealthcenters.org/people/dareen-khatib/",
      "content": {
        "full_text": "MPH, RDN, MCHES Administrator of Health and Wellness, Orange County Department of Education",
        "chunks": [
          "MPH, RDN, MCHES Administrator of Health and Wellness, Orange County Department of Education"
        ]
      },
      "modified": "2025-09-04T19:41:59",
      "slug": "dareen-khatib",
      "status": "publish",
      "excerpt": "<p>MPH, RDN, MCHES Administrator of Health and Wellness, Orange County Department of Education</p>\n",
      "children": [],
      "document_uuid": "21318085-452a-5645-b592-e18d29db194e"
    },
    {
      "page_id": 631,
      "title": "Dina Mirmotalebisohi",
      "link": "https://www.schoolhealthcenters.org/people/dina-mirmotalebisohi/",
      "content": {
        "full_text": "Dina is a fourth-year member of the Youth Board, and is a student at the University of California, Riverside, majoring in Biology and intending to minor in Public Policy. After receiving her Bachelor’s degree, she plans to continue pursuing an education and career in medicine. Dina stumbled upon her passion for public health throughout the years as a result of working with and interning for groups such as the Los Angeles Trust for Children’s Health as a Policy Intern. She has also worked with other groups such as Diversify Our Narrative and the Miles Hall Foundation, which aim to create an inclusive, intersectional, and equitable environment within K-12 schools. She is also a dedicated member of her university’s Associated Students Program Board, University Blood Initiative, and the Iranian Student Association. In her free time, she volunteers at a free clinic or in the cardiovascular unit at Riverside Community Hospital. It is within these groups that she is reminded of the drive that pushes her to continue studying medicine. Dina’s advocacy efforts are driven by her own Treacher Collins Syndrome and unyielding belief that adequate health care is a human right and must be accessible for all.",
        "chunks": [
          "Dina is a fourth-year member of the Youth Board, and is a student at the University of California, Riverside, majoring in Biology and intending to minor in Public Policy. After receiving her Bachelor’s degree, she plans to continue pursuing an education and career in medicine. Dina stumbled upon her passion for public health throughout the years as a result of working with and interning for groups such as the Los Angeles Trust for Children’s Health as a Policy Intern. She has also worked with other groups such as Diversify Our Narrative and the Miles Hall Foundation, which aim to create an inclusive, intersectional, and equitable environment within K-12 schools. She is also a dedicated member of her university’s Associated Students Program Board, University Blood Initiative, and the Iranian Student Association. In her free time, she volunteers at a free clinic or in the cardiovascular unit at Riverside Community Hospital. It is within these groups that she is reminded of the drive that pushes her to continue studying medicine. Dina’s advocacy efforts are driven by her own Treacher Collins Syndrome and unyielding belief that adequate health care is a human right and must be accessible for all."
        ]
      },
      "modified": "2025-05-20T23:22:20",
      "slug": "dina-mirmotalebisohi",
      "status": "publish",
      "excerpt": "<p>Dina is a fourth-year member of the Youth Board, and is a student at the University of California, Riverside, majoring in Biology and intending to minor in Public Policy. After receiving her Bachelor’s degree, she plans to continue pursuing an education and career in medicine. Dina stumbled upon her passion for public health throughout the [&hellip;]</p>\n",
      "children": [],
      "document_uuid": "e60c781b-2a32-5fa6-b7f3-6edf05f6ed91"
    },
    {
      "page_id": 628,
      "title": "Christian Lizaso",
      "link": "https://www.schoolhealthcenters.org/people/christian-lizaso/",
      "content": {
        "full_text": "Christian Lizaso is in his fourth year as a Youth Board member. He is an undergraduate student at the University of California, Berkeley, where he is majoring in Public Health with a focus on adolescent and community health. Christian is a CDC John R. Lewis Undergraduate Public Health Scholar, Advanced Maternal, Child, Adolescent Health (MCAH) Leadership, Education, and Advancement in Undergraduate Pathways (LEAP) Scholar, and Youth Equity Discovery Initiative (YEDI) Scholar. In addition to his work with CSHA, Christian is an undergraduate researcher on youth participatory action research and is pursuing a certificate in Asian American community health. Christian is passionate about youth engagement and youth programming, and hopes to empower young people and improve access to health resources within his community.",
        "chunks": [
          "Christian Lizaso is in his fourth year as a Youth Board member. He is an undergraduate student at the University of California, Berkeley, where he is majoring in Public Health with a focus on adolescent and community health. Christian is a CDC John R. Lewis Undergraduate Public Health Scholar, Advanced Maternal, Child, Adolescent Health (MCAH) Leadership, Education, and Advancement in Undergraduate Pathways (LEAP) Scholar, and Youth Equity Discovery Initiative (YEDI) Scholar. In addition to his work with CSHA, Christian is an undergraduate researcher on youth participatory action research and is pursuing a certificate in Asian American community health. Christian is passionate about youth engagement and youth programming, and hopes to empower young people and improve access to health resources within his community."
        ]
      },
      "modified": "2025-05-27T22:53:46",
      "slug": "christian-lizaso",
      "status": "publish",
      "excerpt": "<p>Christian Lizaso is in his fourth year as a Youth Board member. He is an undergraduate student at the University of California, Berkeley, where he is majoring in Public Health with a focus on adolescent and community health. Christian is a CDC John R. Lewis Undergraduate Public Health Scholar, Advanced Maternal, Child, Adolescent Health (MCAH) [&hellip;]</p>\n",
      "children": [],
      "document_uuid": "3f817388-30d8-57f2-8c39-8df80e6126c8"
    },
    {
      "page_id": 624,
      "title": "Mario Alfaro",
      "link": "https://www.schoolhealthcenters.org/people/mario-alfaro/",
      "content": {
        "full_text": "Director of Partnerships, Planned Parenthood Mar Monte",
        "chunks": [
          "Director of Partnerships, Planned Parenthood Mar Monte"
        ]
      },
      "modified": "2025-09-04T19:43:36",
      "slug": "mario-alfaro",
      "status": "publish",
      "excerpt": "<p>Director of Partnerships, Planned Parenthood Mar Monte</p>\n",
      "children": [],
      "document_uuid": "7ef347df-8cc3-5c2f-a6a4-28326c0737e7"
    },
    {
      "page_id": 621,
      "title": "Jessica Saint-Paul",
      "link": "https://www.schoolhealthcenters.org/people/jessica-saint-paul/",
      "content": {
        "full_text": "DMSc, PA, MPH, MCHES K-12 Faculty and CTE Employer Liaison Health and Related Sciences, Los Angeles Community College District",
        "chunks": [
          "DMSc, PA, MPH, MCHES K-12 Faculty and CTE Employer Liaison Health and Related Sciences, Los Angeles Community College District"
        ]
      },
      "modified": "2025-05-27T22:04:43",
      "slug": "jessica-saint-paul",
      "status": "publish",
      "excerpt": "<p>DMSc, PA, MPH, MCHES K-12 Faculty and CTE Employer Liaison Health and Related Sciences, Los Angeles Community College District</p>\n",
      "children": [],
      "document_uuid": "859df5c6-4191-585e-b31e-f71070dd2140"
    },
    {
      "page_id": 594,
      "title": "Ally Wick",
      "link": "https://www.schoolhealthcenters.org/people/ally-wick/",
      "content": {
        "full_text": "Ally Wick, MPH, plays an active role in programmatic support through in-person convenings, online webinars, and state-wide conferences. Prior to CSHA, Ally advocated for youth engagement opportunities through strategic planning projects and community-based research. Her passion for the intersections between education and community health was strengthened through serving as a SBHC Coordinator for NeighborCare Health. Ally graduated from the University of Washington with a Bachelor’s in Public Health and Education minor. She also earned a Master of Public Health from the University of California, Berkeley.",
        "chunks": [
          "Ally Wick, MPH, plays an active role in programmatic support through in-person convenings, online webinars, and state-wide conferences. Prior to CSHA, Ally advocated for youth engagement opportunities through strategic planning projects and community-based research. Her passion for the intersections between education and community health was strengthened through serving as a SBHC Coordinator for NeighborCare Health. Ally graduated from the University of Washington with a Bachelor’s in Public Health and Education minor. She also earned a Master of Public Health from the University of California, Berkeley."
        ]
      },
      "modified": "2025-08-07T17:54:56",
      "slug": "ally-wick",
      "status": "publish",
      "excerpt": "<p>Ally Wick, MPH, plays an active role in programmatic support through in-person convenings, online webinars, and state-wide conferences. Prior to CSHA, Ally advocated for youth engagement opportunities through strategic planning projects and community-based research. Her passion for the intersections between education and community health was strengthened through serving as a SBHC Coordinator for NeighborCare Health. [&hellip;]</p>\n",
      "children": [],
      "document_uuid": "2db123f0-ee75-59e5-ada0-29afde93d71d"
    },
    {
      "page_id": 592,
      "title": "Judy Singharath",
      "link": "https://www.schoolhealthcenters.org/people/judy-singharath/",
      "content": {
        "full_text": "Judy Singharath supports the executive team to ensure the smooth functioning of CSHA. She has spent the majority of her career in the construction and insurance industries, helping small, local, minority, and diverse contractor businesses secure opportunities to bid on major city and county projects. She is passionate about supporting underrepresented communities. Judy holds a Bachelor of Science degree in International Business from San Francisco State University.",
        "chunks": [
          "Judy Singharath supports the executive team to ensure the smooth functioning of CSHA. She has spent the majority of her career in the construction and insurance industries, helping small, local, minority, and diverse contractor businesses secure opportunities to bid on major city and county projects. She is passionate about supporting underrepresented communities. Judy holds a Bachelor of Science degree in International Business from San Francisco State University."
        ]
      },
      "modified": "2025-05-20T23:23:46",
      "slug": "judy-singharath",
      "status": "publish",
      "excerpt": "<p>Judy Singharath supports the executive team to ensure the smooth functioning of CSHA. She has spent the majority of her career in the construction and insurance industries, helping small, local, minority, and diverse contractor businesses secure opportunities to bid on major city and county projects. She is passionate about supporting underrepresented communities. Judy holds a [&hellip;]</p>\n",
      "children": [],
      "document_uuid": "acbea074-c212-5502-9da5-c9779c07a4fe"
    },
    {
      "page_id": 590,
      "title": "Irma Rosa Viera",
      "link": "https://www.schoolhealthcenters.org/people/irma-rosa-viera/",
      "content": {
        "full_text": "Irma Rosa Viera plays an active part in planning CSHA’s annual conference, Youth2Youth conference, and regional trainings. She also serves as a youth engagement content expert, providing field training and technical assistance to support youth-focused initiatives. Prior to her role, she served four years as a Youth Board member for CSHA, where her passion for mental health, youth advocacy, and systemic change flourished. These values continue to guide her work as she leads CSHA’s current Youth Board members in their efforts as the leaders of today.",
        "chunks": [
          "Irma Rosa Viera plays an active part in planning CSHA’s annual conference, Youth2Youth conference, and regional trainings. She also serves as a youth engagement content expert, providing field training and technical assistance to support youth-focused initiatives. Prior to her role, she served four years as a Youth Board member for CSHA, where her passion for mental health, youth advocacy, and systemic change flourished. These values continue to guide her work as she leads CSHA’s current Youth Board members in their efforts as the leaders of today."
        ]
      },
      "modified": "2025-05-20T23:24:02",
      "slug": "irma-rosa-viera",
      "status": "publish",
      "excerpt": "<p>Irma Rosa Viera plays an active part in planning CSHA’s annual conference, Youth2Youth conference, and regional trainings. She also serves as a youth engagement content expert, providing field training and technical assistance to support youth-focused initiatives. Prior to her role, she served four years as a Youth Board member for CSHA, where her passion for [&hellip;]</p>\n",
      "children": [],
      "document_uuid": "1eb431b1-1235-5244-b014-c3218677e3ad"
    },
    {
      "page_id": 588,
      "title": "Marcel Reynolds",
      "link": "https://www.schoolhealthcenters.org/people/marcel-reynolds/",
      "content": {
        "full_text": "Marcel Reynolds helps build visibility and support for the growing movement of school-based health care in California. He manages a multi-channel media campaign to support CSHA’s mission. His past experience includes leading external stakeholder engagement for the California Department of Public Health’s Occupational Health Branch and directing communications for a global association of women’s foundations. Marcel holds a Master of Arts in International Affairs from The New School, and a Bachelor’s degree in Broadcast Journalism from the University of Maryland, College Park.",
        "chunks": [
          "Marcel Reynolds helps build visibility and support for the growing movement of school-based health care in California. He manages a multi-channel media campaign to support CSHA’s mission. His past experience includes leading external stakeholder engagement for the California Department of Public Health’s Occupational Health Branch and directing communications for a global association of women’s foundations. Marcel holds a Master of Arts in International Affairs from The New School, and a Bachelor’s degree in Broadcast Journalism from the University of Maryland, College Park."
        ]
      },
      "modified": "2025-05-20T23:24:21",
      "slug": "marcel-reynolds",
      "status": "publish",
      "excerpt": "<p>Marcel Reynolds helps build visibility and support for the growing movement of school-based health care in California. He manages a multi-channel media campaign to support CSHA’s mission. His past experience includes leading external stakeholder engagement for the California Department of Public Health’s Occupational Health Branch and directing communications for a global association of women’s foundations. [&hellip;]</p>\n",
      "children": [],
      "document_uuid": "c401ce37-0bce-5ecf-8584-5e8339d4eead"
    },
    {
      "page_id": 586,
      "title": "Amy Ranger",
      "link": "https://www.schoolhealthcenters.org/people/amy-ranger/",
      "content": {
        "full_text": "Amy Ranger, MPH, leads CSHA’s statewide efforts to expand school health services. She has worked in child and adolescent health for over 20 years, with a particular focus on school-based health centers (SBHCs). She started her career as a health educator at a SBHC in Union City; spent many years training adults on adolescent health topics; and ran child and adolescent health promotion programs for the City of Berkeley. At La Clinica de La Raza, an Oakland-based Federally Qualified Health Center, she managed a department of eight SBHCs.",
        "chunks": [
          "Amy Ranger, MPH, leads CSHA’s statewide efforts to expand school health services. She has worked in child and adolescent health for over 20 years, with a particular focus on school-based health centers (SBHCs). She started her career as a health educator at a SBHC in Union City; spent many years training adults on adolescent health topics; and ran child and adolescent health promotion programs for the City of Berkeley. At La Clinica de La Raza, an Oakland-based Federally Qualified Health Center, she managed a department of eight SBHCs."
        ]
      },
      "modified": "2025-06-18T19:10:53",
      "slug": "amy-ranger",
      "status": "publish",
      "excerpt": "<p>Amy Ranger, MPH, leads CSHA’s statewide efforts to expand school health services. She has worked in child and adolescent health for over 20 years, with a particular focus on school-based health centers (SBHCs). She started her career as a health educator at a SBHC in Union City; spent many years training adults on adolescent health [&hellip;]</p>\n",
      "children": [],
      "document_uuid": "95a772ab-a4cd-58db-b5e3-e3af42046b03"
    },
    {
      "page_id": 584,
      "title": "Marina Quintanilla",
      "link": "https://www.schoolhealthcenters.org/people/marina-quintanilla/",
      "content": {
        "full_text": "Marina Quintanilla, MPH, CHES, has over six years of expertise in adolescent health and youth development. She currently leads the implementation of initiatives within schools and school-based health/wellness centers, emphasizing youth advocacy, engagement, substance use prevention, and restorative alternatives to discipline. She supports CSHA’s local and state policy agenda by collaborating with school-based health and local partners to build grassroots advocacy skills and capacity building. She holds a Master’s degree in Public Health from UCLA, with a focus in community health.",
        "chunks": [
          "Marina Quintanilla, MPH, CHES, has over six years of expertise in adolescent health and youth development. She currently leads the implementation of initiatives within schools and school-based health/wellness centers, emphasizing youth advocacy, engagement, substance use prevention, and restorative alternatives to discipline. She supports CSHA’s local and state policy agenda by collaborating with school-based health and local partners to build grassroots advocacy skills and capacity building. She holds a Master’s degree in Public Health from UCLA, with a focus in community health."
        ]
      },
      "modified": "2025-05-20T23:24:46",
      "slug": "marina-quintanilla",
      "status": "publish",
      "excerpt": "<p>Marina Quintanilla, MPH, CHES, has over six years of expertise in adolescent health and youth development. She currently leads the implementation of initiatives within schools and school-based health/wellness centers, emphasizing youth advocacy, engagement, substance use prevention, and restorative alternatives to discipline. She supports CSHA’s local and state policy agenda by collaborating with school-based health and [&hellip;]</p>\n",
      "children": [],
      "document_uuid": "b3ab053e-deba-5283-b04e-c37f31d379b7"
    },
    {
      "page_id": 582,
      "title": "Tracy Nguyen",
      "link": "https://www.schoolhealthcenters.org/people/tracy-nguyen/",
      "content": {
        "full_text": "Tracy Nguyen collaborates with numerous subject matter experts and practitioners to host evidence-based trainings and share best practices for the school health field. She brings three years of experience leading the organization’s statewide Youth-to-Youth conferences, where young people share substance use prevention, youth advocacy, and youth engagement strategies and programming with their peers. Tracy holds a BA in Global Studies from San Jose State University where she is currently a Master of Public Health graduate student.",
        "chunks": [
          "Tracy Nguyen collaborates with numerous subject matter experts and practitioners to host evidence-based trainings and share best practices for the school health field. She brings three years of experience leading the organization’s statewide Youth-to-Youth conferences, where young people share substance use prevention, youth advocacy, and youth engagement strategies and programming with their peers. Tracy holds a BA in Global Studies from San Jose State University where she is currently a Master of Public Health graduate student."
        ]
      },
      "modified": "2025-05-20T23:24:55",
      "slug": "tracy-nguyen",
      "status": "publish",
      "excerpt": "<p>Tracy Nguyen collaborates with numerous subject matter experts and practitioners to host evidence-based trainings and share best practices for the school health field. She brings three years of experience leading the organization’s statewide Youth-to-Youth conferences, where young people share substance use prevention, youth advocacy, and youth engagement strategies and programming with their peers. Tracy holds [&hellip;]</p>\n",
      "children": [],
      "document_uuid": "4cec89bf-44ae-5386-b931-7e0fb54141e2"
    },
    {
      "page_id": 580,
      "title": "Sierra Lau",
      "link": "https://www.schoolhealthcenters.org/people/sierra-lau/",
      "content": {
        "full_text": "Sierra Lau, MPH, provides statewide technical assistance to school-based health centers and leads projects that increase quality and capacity.  She comes to the organization with years of experience in adolescent health, including school-based and sexual and reproductive health.  Prior to CSHA, she managed SBHCs in the Bay Area and led their transition in electronic health records, prepared them so they passed AAAHC accreditation for the first time, and partnered with the local food bank to provide fresh fruit on campus.",
        "chunks": [
          "Sierra Lau, MPH, provides statewide technical assistance to school-based health centers and leads projects that increase quality and capacity. She comes to the organization with years of experience in adolescent health, including school-based and sexual and reproductive health. Prior to CSHA, she managed SBHCs in the Bay Area and led their transition in electronic health records, prepared them so they passed AAAHC accreditation for the first time, and partnered with the local food bank to provide fresh fruit on campus."
        ]
      },
      "modified": "2025-05-20T23:25:06",
      "slug": "sierra-lau",
      "status": "publish",
      "excerpt": "<p>Sierra Lau, MPH, provides statewide technical assistance to school-based health centers and leads projects that increase quality and capacity.  She comes to the organization with years of experience in adolescent health, including school-based and sexual and reproductive health.  Prior to CSHA, she managed SBHCs in the Bay Area and led their transition in electronic health [&hellip;]</p>\n",
      "children": [],
      "document_uuid": "fae47f72-d913-5f87-81bb-eb287a4d0dea"
    },
    {
      "page_id": 478,
      "title": "Amy Blackshaw",
      "link": "https://www.schoolhealthcenters.org/people/amy-blackshaw/",
      "content": {
        "full_text": "Amy Blackshaw, MSW, is a seasoned social worker, program administrator, and advocate. She has spent the past decade dedicated to advancing adolescent health and wellness. Prior to joining CSHA, Amy led comprehensive school-based health centers in Alameda County, overseeing the delivery of primary care, behavioral health, sexual and reproductive health, and youth development. She is committed to ensuring all students have equitable access to high-quality care and is passionate about elevating the role of school-based health in creating healthier, thriving communities.",
        "chunks": [
          "Amy Blackshaw, MSW, is a seasoned social worker, program administrator, and advocate. She has spent the past decade dedicated to advancing adolescent health and wellness. Prior to joining CSHA, Amy led comprehensive school-based health centers in Alameda County, overseeing the delivery of primary care, behavioral health, sexual and reproductive health, and youth development. She is committed to ensuring all students have equitable access to high-quality care and is passionate about elevating the role of school-based health in creating healthier, thriving communities."
        ]
      },
      "modified": "2025-05-20T23:25:17",
      "slug": "amy-blackshaw",
      "status": "publish",
      "excerpt": "<p>Amy Blackshaw, MSW, is a seasoned social worker, program administrator, and advocate. She has spent the past decade dedicated to advancing adolescent health and wellness. Prior to joining CSHA, Amy led comprehensive school-based health centers in Alameda County, overseeing the delivery of primary care, behavioral health, sexual and reproductive health, and youth development. She is [&hellip;]</p>\n",
      "children": [],
      "document_uuid": "c097878b-365a-5ff0-a3cf-a24035621843"
    },
    {
      "page_id": 67,
      "title": "Sergio J. Morales",
      "link": "https://www.schoolhealthcenters.org/people/sergio-j-morales/",
      "content": {
        "full_text": "Sergio J. Morales, MPA, brings more than 25 years of experience working in community health, building innovative solutions through a lens of racial justice and health equity. He worked in federally qualified health centers for 10 years, seven of them in school-based health centers.  He brings expertise in sexual a reproductive health, adolescent programs, building school/community partnerships, and strategic planning. Sergio completed a Racial Healing Practitioners Fellowship with the National Compadres Network to support building the capacity of individuals and organizations on racial equity and racial healing.",
        "chunks": [
          "Sergio J. Morales, MPA, brings more than 25 years of experience working in community health, building innovative solutions through a lens of racial justice and health equity. He worked in federally qualified health centers for 10 years, seven of them in school-based health centers. He brings expertise in sexual a reproductive health, adolescent programs, building school/community partnerships, and strategic planning. Sergio completed a Racial Healing Practitioners Fellowship with the National Compadres Network to support building the capacity of individuals and organizations on racial equity and racial healing."
        ]
      },
      "modified": "2025-08-07T22:56:30",
      "slug": "sergio-j-morales",
      "status": "publish",
      "excerpt": "<p>Sergio J. Morales, MPA, brings more than 25 years of experience working in community health, building innovative solutions through a lens of racial justice and health equity. He worked in federally qualified health centers for 10 years, seven of them in school-based health centers.  He brings expertise in sexual a reproductive health, adolescent programs, building [&hellip;]</p>\n",
      "children": [],
      "document_uuid": "e7670780-f45e-5e12-95df-a2e991095528"
    },
    {
      "page_id": 63,
      "title": "Charlize Chloe Castillo",
      "link": "https://www.schoolhealthcenters.org/people/charlize-chloe-castillo/",
      "content": {
        "full_text": "Charlize is a second-year Youth Board member. She is also a community college student approaching her second year at Napa Valley College, majoring in Computer Engineering with the support of faculty in MESA STEM. After graduating she plans to pursue medical school afterwards to fulfill the childhood dream of becoming a Family Medicine Physician. Since joining local non-profit Club Stride Inc., Char has co-founded an activism internship called Action in Movement where the passion for community advocacy came to life by working firsthand with underserved middle school youth. She has explored several parts of social justice by taking part in Sustainable Solano’s Youth Leadership Council in support of environmental sustainability and taking up Content Creation internships focused mainly on well-being and self love at Club Stride Inc. She is an Ambassador for Touro University’s Healthcare Opportunities program and plays an active role in the Planning Committee for non-profit Children Now. Encouraged by the support of several community leaders, Char is determined to drive a positive social change in the world through healthcare and technology.",
        "chunks": [
          "Charlize is a second-year Youth Board member. She is also a community college student approaching her second year at Napa Valley College, majoring in Computer Engineering with the support of faculty in MESA STEM. After graduating she plans to pursue medical school afterwards to fulfill the childhood dream of becoming a Family Medicine Physician. Since joining local non-profit Club Stride Inc., Char has co-founded an activism internship called Action in Movement where the passion for community advocacy came to life by working firsthand with underserved middle school youth. She has explored several parts of social justice by taking part in Sustainable Solano’s Youth Leadership Council in support of environmental sustainability and taking up Content Creation internships focused mainly on well-being and self love at Club Stride Inc. She is an Ambassador for Touro University’s Healthcare Opportunities program and plays an active role in the Planning Committee for non-profit Children Now. Encouraged by the support of several community leaders, Char is determined to drive a positive social change in the world through healthcare and technology."
        ]
      },
      "modified": "2025-09-04T18:06:09",
      "slug": "charlize-chloe-castillo",
      "status": "publish",
      "excerpt": "<p>Charlize is a second-year Youth Board member. She is also a community college student approaching her second year at Napa Valley College, majoring in Computer Engineering with the support of faculty in MESA STEM. After graduating she plans to pursue medical school afterwards to fulfill the childhood dream of becoming a Family Medicine Physician. Since [&hellip;]</p>\n",
      "children": [],
      "document_uuid": "be22a182-1b54-5f02-812d-0e3c6f634732"
    }
  ]
}