{
  "empty_pages_count": 11,
  "empty_pages": {
    "828": "https://www.schoolhealthcenters.org/start-here/fqhc-staff-or-administrator/",
    "826": "https://www.schoolhealthcenters.org/start-here/behavioral-health-provider/",
    "834": "https://www.schoolhealthcenters.org/start-here/student/",
    "830": "https://www.schoolhealthcenters.org/start-here/school-nurse/",
    "832": "https://www.schoolhealthcenters.org/start-here/school-administrator/",
    "838": "https://www.schoolhealthcenters.org/start-here/advocate/",
    "836": "https://www.schoolhealthcenters.org/start-here/parent-guardian/",
    "824": "https://www.schoolhealthcenters.org/start-here/health-provider/",
    "820": "https://www.schoolhealthcenters.org/membership/become-a-member/",
    "818": "https://www.schoolhealthcenters.org/membership/member-resources/",
    "816": "https://www.schoolhealthcenters.org/membership/member-login/"
  },
  "special_pages_count": 0,
  "special_pages": {},
  "webpage_tree": [
    {
      "page_id": 4972,
      "title": "Free Care Rule",
      "link": "https://www.schoolhealthcenters.org/free-care-rule/",
      "content": {
        "full_text": "<h2>Federal Policy Change Provides New Opportunities for School Health Services</h2> In 2014, the federal government reversed a long standing policy that impeded the ability of school districts to get reimbursed for the school health services they provide to students (called the “Free Care Rule”). This reversal removes a major barrier for schools to obtain federal Medicaid funding for student health services and creates an opportunity for schools to expand the role they play in improving the health of low-income students. The change in federal policy could open the door for schools to reimagine their role in the health care delivery system and augment their efforts on behalf of children. <h3>CMS Approves California SPA 15-021</h3> In April 2020, the Centers for Medicare and Medicaid Services (CMS) approved California’s State Plan Amendment (SPA) 15-021. This brings to a close the state’s five-year process to expand coverage of health services to all Medicaid enrolled students, per the change to the “free care rule.” SPA 15-021 expands access to Federal Medicaid funds for LEAs, through the following three primary changes: (1) incorporating Random Moment Time Survey (RMTS) into the cost settlement process, (2) adding new service practitioners and new services covered under the LEA BOP, and (3) expanding the population covered under the LEA BOP to include Medicaid beneficiaries outside of special education to those covered by an Individualized Health and Support Plan (IHSP) also known as a “Care Plan”. <h4>Resources for Schools</h4>",
        "chunks": [
          "<h2>Federal Policy Change Provides New Opportunities for School Health Services</h2> In 2014, the federal government reversed a long standing policy that impeded the ability of school districts to get reimbursed for the school health services they provide to students (called the “Free Care Rule”). This reversal removes a major barrier for schools to obtain federal Medicaid funding for student health services and creates an opportunity for schools to expand the role they play in improving the health of low-income students. The change in federal policy could open the door for schools to reimagine their role in the health care delivery system and augment their efforts on behalf of children. <h3>CMS Approves California SPA 15-021</h3> In April 2020, the Centers for Medicare and Medicaid Services (CMS) approved California’s State Plan Amendment (SPA) 15-021. This brings to a close the state’s five-year process to expand coverage of health services to all Medicaid enrolled students, per the change to the “free care rule.” SPA 15-021 expands access to Federal Medicaid funds for LEAs, through the following three primary changes: (1) incorporating Random Moment Time Survey (RMTS) into the cost settlement process, (2) adding new service practitioners and new services covered under the LEA BOP, and (3) expanding the population covered under the LEA BOP to include Medicaid beneficiaries outside of special education to those covered by an Individualized Health and Support Plan (IHSP) also known as a “Care Plan”. <h4>Resources for Schools</h4>"
        ]
      },
      "modified": "2025-12-17T03:38:14",
      "slug": "free-care-rule",
      "status": "publish",
      "excerpt": "<p>Federal Policy Change Provides New Opportunities for School Health Services In 2014, the federal government reversed a long standing policy that impeded the ability of school districts to get reimbursed for the school health services they provide to students (called the “Free Care Rule”). This reversal removes a major barrier for schools to obtain federal [&hellip;]</p>\n",
      "children": [],
      "document_uuid": "b77666a5-fea5-5ae8-9c25-0bd2b674b64f"
    },
    {
      "page_id": 4652,
      "title": "Thank You for Your Donation",
      "link": "https://www.schoolhealthcenters.org/thank-you-for-your-donation/",
      "content": {
        "full_text": "Thank you for supporting the California School-Based Health Alliance! You will receive a separate email confirmation of your payment if you successfully paid online with a credit card. Thank you again for your contribution to support school-based health care in California! The California School-Based Health Alliance is a 501(c)(3) organization and all donations are tax-deductible to the full extent of the law. The California School-Based Health Alliance is a 501(c)(3) nonprofit organization. All donations are tax-deductible to the full extent of the law.",
        "chunks": [
          "Thank you for supporting the California School-Based Health Alliance! You will receive a separate email confirmation of your payment if you successfully paid online with a credit card. Thank you again for your contribution to support school-based health care in California! The California School-Based Health Alliance is a 501(c)(3) organization and all donations are tax-deductible to the full extent of the law. The California School-Based Health Alliance is a 501(c)(3) nonprofit organization. All donations are tax-deductible to the full extent of the law."
        ]
      },
      "modified": "2025-10-05T19:03:29",
      "slug": "thank-you-for-your-donation",
      "status": "publish",
      "excerpt": "<p>Thank you for supporting the&nbsp;California School-Based Health Alliance! You will receive a separate email confirmation of your payment if you successfully paid online with a credit card. Thank you again for your contribution to support school-based health care in California! The California School-Based Health Alliance is a 501(c)(3) organization and all donations are tax-deductible to [&hellip;]</p>\n",
      "children": [],
      "document_uuid": "88a66e16-6b93-5ffc-b906-257651d31ae7"
    },
    {
      "page_id": 2933,
      "title": "Case Studies",
      "link": "https://www.schoolhealthcenters.org/case-studies/",
      "content": {
        "full_text": "<h4>A Lifeline to Students During the Pandemic</h4> The impact of having a school-based health center (SBHC) that provides counseling services, health services, and a space for young folks to engage in wellness is one that I personally would have loved to experience as a young person. I have never been to a school that has developed such a culture of care, responsibility,… <h4>California Students Creatively Share Health Knowledge at Y2Y</h4> By Jubilee AdamsYouth Board Member In November 2024, the California School-Based Health Alliance (CSHA) brought together over 250 attendees – including 180 youth – from across the state of California to connect with one another at the annual Youth 2 Youth (Y2Y) conference. This year’s conference took place in Ontario at the Inland Empire Health… <h4>Distributing Naloxone in SBHCs: Addressing a Public Health Challenge</h4> By Sai Tulugu La Clínica is a federally qualified health center (FQHC) that operates several school-based health centers (SBHCs) in partnership with the Oakland Unified School District. The health center was founded in 1971 by a group of students at the University of California, Berkeley, as a community-based clinic to address the lack of high-quality… <h4>Engaging Youth in Tobacco Prevention</h4> The most effective way to reach young people with prevention education is through their peers. School-based health centers excel at engaging youth in peer-to-peer education campaigns to improve population health. The California School-Based Health Alliance and The Los Angeles Trust for Children’s Health – which serves as the Los Angeles Unified School District’s backbone health entity –… <h4>From the Garden to the Kitchen: West Oakland Middle School (WOMS)</h4> WOMS is deeply engaged in making the campus and community healthier places for students to live, work, and play. The school-based health center’s (SBHC) leaders are focusing on primary prevention to complement the much-needed medical care. New efforts to promote healthy eating are bringing many stakeholders – including students, parents, community members, and others –… <h4>Healthier Foods at School and at Home: Urban Promise Academy (UPA)</h4> Over the past few years, UPA – led by Wellness Champions from both the Hawthorne Clinic school-based health center (SBHC) and its Family Resource Center – have made great strides in improving the school’s food offerings and overall school food environment. At UPA, every student participates in a morning “crew,” an enhanced homeroom experience that… <h4>Innovative Eating With Grab-N-Go Breakfasts: Fremont High School</h4> Fremont High School began offering a free, hot breakfast to any student who showed up to the cafeteria between 7:45 a.m. and 8:10 a.m. Unfortunately, few students arrived at school early enough to eat. Fremont’s Youth Wellness Advisory Board is a diverse group of students with a shared commitment to advocating for positive policy change… <h4>SBHC Boosts Health & Attendance in a Rural Community</h4> Kerman is a city located 15 miles outside of Fresno in California’s rural San Joaquin Valley, which is a major agricultural area. Kerman Unified opened a school-based health center (SBHC) in 2013 to serve all students at the eight schools in the district. It is operated by Valley Health Team, a local Federally Qualified Health…",
        "chunks": [
          "<h4>A Lifeline to Students During the Pandemic</h4> The impact of having a school-based health center (SBHC) that provides counseling services, health services, and a space for young folks to engage in wellness is one that I personally would have loved to experience as a young person. I have never been to a school that has developed such a culture of care, responsibility,… <h4>California Students Creatively Share Health Knowledge at Y2Y</h4> By Jubilee AdamsYouth Board Member In November 2024, the California School-Based Health Alliance (CSHA) brought together over 250 attendees – including 180 youth – from across the state of California to connect with one another at the annual Youth 2 Youth (Y2Y) conference. This year’s conference took place in Ontario at the Inland Empire Health… <h4>Distributing Naloxone in SBHCs: Addressing a Public Health Challenge</h4> By Sai Tulugu La Clínica is a federally qualified health center (FQHC) that operates several school-based health centers (SBHCs) in partnership with the Oakland Unified School District. The health center was founded in 1971 by a group of students at the University of California, Berkeley, as a community-based clinic to address the lack of high-quality… <h4>Engaging Youth in Tobacco Prevention</h4> The most effective way to reach young people with prevention education is through their peers. School-based health centers excel at engaging youth in peer-to-peer education campaigns to improve population health. The California School-Based Health Alliance and The Los Angeles Trust for Children’s Health – which serves as the Los Angeles Unified School District’s backbone health entity –… <h4>From the Garden to the Kitchen: West Oakland Middle School (WOMS)</h4> WOMS is deeply engaged in making the campus and community healthier places for students to live, work, and play. The school-based health center’s (SBHC) leaders are focusing on primary prevention to complement the much-needed medical care. New efforts to promote healthy eating are bringing many stakeholders – including students, parents, community members, and others –… <h4>Healthier Foods at School and at Home: Urban Promise Academy (UPA)</h4> Over the past few years, UPA – led by Wellness Champions from both the Hawthorne Clinic school-based health center (SBHC) and its Family Resource Center – have made great strides in improving the school’s food offerings and overall school food environment. At UPA, every student participates in a morning “crew,” an enhanced homeroom experience that… <h4>Innovative Eating With Grab-N-Go Breakfasts: Fremont High School</h4> Fremont High School began offering a free, hot breakfast",
          "With Grab-N-Go Breakfasts: Fremont High School</h4> Fremont High School began offering a free, hot breakfast to any student who showed up to the cafeteria between 7:45 a.m. and 8:10 a.m. Unfortunately, few students arrived at school early enough to eat. Fremont’s Youth Wellness Advisory Board is a diverse group of students with a shared commitment to advocating for positive policy change… <h4>SBHC Boosts Health & Attendance in a Rural Community</h4> Kerman is a city located 15 miles outside of Fresno in California’s rural San Joaquin Valley, which is a major agricultural area. Kerman Unified opened a school-based health center (SBHC) in 2013 to serve all students at the eight schools in the district. It is operated by Valley Health Team, a local Federally Qualified Health…"
        ]
      },
      "modified": "2025-08-07T17:17:02",
      "slug": "case-studies",
      "status": "publish",
      "excerpt": "",
      "children": [],
      "document_uuid": "e29392dd-5490-59e8-8708-a61a1d5ab2fd"
    },
    {
      "page_id": 2451,
      "title": "Sign Up for e-News",
      "link": "https://www.schoolhealthcenters.org/sign-up-for-e-news/",
      "content": {
        "full_text": "<h2>Stay Connected</h2> Sign up to receive our eNews and other timely alerts in your inbox that will keep you up to date on school-based health care in California. You may unsubscribe at anytime. <h2>Subscribe to Our Mailing List</h2>",
        "chunks": [
          "<h2>Stay Connected</h2> Sign up to receive our eNews and other timely alerts in your inbox that will keep you up to date on school-based health care in California. You may unsubscribe at anytime. <h2>Subscribe to Our Mailing List</h2>"
        ]
      },
      "modified": "2025-10-17T21:04:17",
      "slug": "sign-up-for-e-news",
      "status": "publish",
      "excerpt": "<p>Stay Connected Sign up to receive our eNews and other timely alerts in your inbox that will keep you up to date on school-based health care in California. You may unsubscribe at anytime. Subscribe to Our Mailing List * indicates required Email Address * First Name * Last Name * Title Organization * Address Address [&hellip;]</p>\n",
      "children": [],
      "document_uuid": "a936e863-f2ce-5854-bb64-ae294c2ba514"
    },
    {
      "page_id": 914,
      "title": "Donate",
      "link": "https://www.schoolhealthcenters.org/donate/",
      "content": {
        "full_text": "Yes! I want to support the California School-Based Health Alliance’s goals of increasing access to health care in schools so students can succeed in school. Donations of any amount are welcome.  Donations at or above the cost of membership entitle you to member benefits. If you would prefer to mail a check with your donation, you do not need to complete this form. Please make your check out to California School-Based Health Alliance and mail it to: California School-Based Health Alliance 1203 Preservation Park Way, #302 Oakland, CA 94612 Please make sure your address is on your check so we can mail you a donation acknowledgment letter. <h2>Donate Now</h2> <h2>Donation Amount</h2> <h2>Recurring Donations</h2> <h2>Donation preferences (optional)</h2> <h2>Contact Information</h2> <h2>Payment Information</h2> The California School-Based Health Alliance is a 501(c)(3) nonprofit organization. All donations are tax-deductible to the full extent of the law. <h2>Who We Are</h2> The California School-Based Health Alliance (CSHA) is the statewide non-profit organization dedicated to improving the health & academic success of children & youth by advancing health services in schools.",
        "chunks": [
          "Yes! I want to support the California School-Based Health Alliance’s goals of increasing access to health care in schools so students can succeed in school. Donations of any amount are welcome. Donations at or above the cost of membership entitle you to member benefits. If you would prefer to mail a check with your donation, you do not need to complete this form. Please make your check out to California School-Based Health Alliance and mail it to: California School-Based Health Alliance 1203 Preservation Park Way, #302 Oakland, CA 94612 Please make sure your address is on your check so we can mail you a donation acknowledgment letter. <h2>Donate Now</h2> <h2>Donation Amount</h2> <h2>Recurring Donations</h2> <h2>Donation preferences (optional)</h2> <h2>Contact Information</h2> <h2>Payment Information</h2> The California School-Based Health Alliance is a 501(c)(3) nonprofit organization. All donations are tax-deductible to the full extent of the law. <h2>Who We Are</h2> The California School-Based Health Alliance (CSHA) is the statewide non-profit organization dedicated to improving the health & academic success of children & youth by advancing health services in schools."
        ]
      },
      "modified": "2025-10-02T18:05:54",
      "slug": "donate",
      "status": "publish",
      "excerpt": "<p>Yes! I want to support the California School-Based Health Alliance’s goals of increasing access to health care in schools so students can succeed in school. Donations of any amount are welcome.&nbsp; Donations at or above the cost of membership&nbsp;entitle you to member benefits. If you would prefer to mail a check with your donation, you [&hellip;]</p>\n",
      "children": [],
      "document_uuid": "6f5ef771-4f7a-5d98-b5ca-ea8597faa939"
    },
    {
      "page_id": 434,
      "title": "Our Work",
      "link": "https://www.schoolhealthcenters.org/our-work/",
      "content": {
        "full_text": "<h2>Who We Are</h2> The California School-Based Health Alliance (CSHA) is the statewide nonprofit organization helping to put more health services in schools. Healthier children are better able to attend and focus in class. CSHA supports local education agencies, health care partners, and community organizations in launching, enhancing, and sustaining school health services. We influence state laws and policies by advocating to improve access by making school-based health and wellness centers an integral part of the health care and education systems. <h3>SUPPORTING SBHCs</h3> <h3>TRAININGS & Tech. Assist.</h3> <h3>POLICY & ADVOCACY IN CA</h3> <h3>RESOURCES & GUIDANCE</h3> Our conference , webinars, resources , and technical assistance help school-based health centers and wellness centers (SBHCs) offer high quality, age-appropriate care to kids by putting health care where kids are—at school . Join one of our regional coalitions in the Central Valley , Northern California , and Inland Empire . Contact us if you are working in a school health program in California and want to be connected. <h2>Join the Movement</h2> We invite all organizations that support increased access to health care for kids at school to become an annual member of the California School-Based Health Alliance. <h2>School-Based Health & Wellness Centers In California</h2> School-based health and wellness centers are located in schools serving some of the state’s most vulnerable children. On campuses with SBHCs, about 70% of students receive free or reduced price meals. Students in communities that benefit from school-based health and wellness centers are less likely to have health insurance or access to health and mental health services that address these risk factors. Without access to high-quality health services, childhood risk factors are more likely to be translated into higher rates of diabetes, heart disease, cancer, and other chronic illnesses in adulthood as well as more struggles with academic success. Of California’s 400 school-based health and wellness centers: Most of California’s SBHCs are physically located right on campus within a main building or in a portable. In some areas, health services are provided by mobile medical or dental vans, and in other areas, “school-linked” health centers are off campus and have formal operating agreements with schools. School-based health centers and wellness centers (SBHCs/WCs) are spread from Del Norte to San Diego County with large concentrations in Los Angeles and the San Francisco Bay Area. When looking at our map , note: Would you like to be added? Complete our survey to help us have a more complete list of school-based health and wellness centers. <h2>Explore Our Resources</h2> A comprehensive resource for anyone seeking to start or expand health services at school. Identify areas where you can improve the quality and sustainability of services. See the high-level activities you can do now to start health services at school. Swipe to see more <h4>Creating Safer Spaces for LGBTQIA+ Youth – A Quick Guide</h4> The California School-Based Health Alliance (CSHA) believes that advancing health equity and justice for young people requires centering the voices, leadership, and assets of all youth. CSHA strongly recommends that all school-based health centers and wellness centers (SBHC/WCs) actively tailor their spaces and practices to affirm and empower LGBTQIA+ youth. SBHC/WCs must help dismantle the… <h4>The Power of Peers</h4> A Curriculum for Training Students to Provide Peer-to-Peer Support in Schools <h4>School Climate</h4> School-based health centers and wellness centers (SBHC/WC) and other school health professionals can play an important role in enhancing school climate, particularly in improving student behavior and rethinking disciplinary approaches. Many schools have begun to move away from zero-tolerance disciplinary policies and to acknowledge the social, emotional, and physical factors that shape student behavior. Positive… <h4>Trauma Screening</h4> Screening students for trauma is a process that needs to take careful consideration in order to be effective and supportive to both students and clinicians. There are many possible screeners available and every screener is a tool to be used in the context of a safe and trusted relationship with a provider. When screening for risk… <h4>Sample Materials</h4> Download sample forms, checklists, and other materials to facilitate your schoolwide screening program. We are grateful to La Clínica de La Raza and Native American Health Center for providing these samples. Recommendations Age-based guidance for what to screen Workplan Sample workplan for implementing schoolwide screenings Roles & Responsibilities List of staff roles and responsibilities Visit… <h2>Stay Up to Date on School-based Health Centers</h2> Sign up to receive our free newsletter and advocate for kids’ health. Organizations that want to receive technical assistance, discounted conference registration, and access to regular member calls can become a member.",
        "chunks": [
          "<h2>Who We Are</h2> The California School-Based Health Alliance (CSHA) is the statewide nonprofit organization helping to put more health services in schools. Healthier children are better able to attend and focus in class. CSHA supports local education agencies, health care partners, and community organizations in launching, enhancing, and sustaining school health services. We influence state laws and policies by advocating to improve access by making school-based health and wellness centers an integral part of the health care and education systems. <h3>SUPPORTING SBHCs</h3> <h3>TRAININGS & Tech. Assist.</h3> <h3>POLICY & ADVOCACY IN CA</h3> <h3>RESOURCES & GUIDANCE</h3> Our conference , webinars, resources , and technical assistance help school-based health centers and wellness centers (SBHCs) offer high quality, age-appropriate care to kids by putting health care where kids are—at school . Join one of our regional coalitions in the Central Valley , Northern California , and Inland Empire . Contact us if you are working in a school health program in California and want to be connected. <h2>Join the Movement</h2> We invite all organizations that support increased access to health care for kids at school to become an annual member of the California School-Based Health Alliance. <h2>School-Based Health & Wellness Centers In California</h2> School-based health and wellness centers are located in schools serving some of the state’s most vulnerable children. On campuses with SBHCs, about 70% of students receive free or reduced price meals. Students in communities that benefit from school-based health and wellness centers are less likely to have health insurance or access to health and mental health services that address these risk factors. Without access to high-quality health services, childhood risk factors are more likely to be translated into higher rates of diabetes, heart disease, cancer, and other chronic illnesses in adulthood as well as more struggles with academic success. Of California’s 400 school-based health and wellness centers: Most of California’s SBHCs are physically located right on campus within a main building or in a portable. In some areas, health services are provided by mobile medical or dental vans, and in other areas, “school-linked” health centers are off campus and have formal operating agreements with schools. School-based health centers and wellness centers (SBHCs/WCs) are spread from Del Norte to San Diego County with large concentrations in Los Angeles and the San Francisco Bay Area. When looking at our map , note: Would you like to be added? Complete our survey to help",
          "our map , note: Would you like to be added? Complete our survey to help us have a more complete list of school-based health and wellness centers. <h2>Explore Our Resources</h2> A comprehensive resource for anyone seeking to start or expand health services at school. Identify areas where you can improve the quality and sustainability of services. See the high-level activities you can do now to start health services at school. Swipe to see more <h4>Creating Safer Spaces for LGBTQIA+ Youth – A Quick Guide</h4> The California School-Based Health Alliance (CSHA) believes that advancing health equity and justice for young people requires centering the voices, leadership, and assets of all youth. CSHA strongly recommends that all school-based health centers and wellness centers (SBHC/WCs) actively tailor their spaces and practices to affirm and empower LGBTQIA+ youth. SBHC/WCs must help dismantle the… <h4>The Power of Peers</h4> A Curriculum for Training Students to Provide Peer-to-Peer Support in Schools <h4>School Climate</h4> School-based health centers and wellness centers (SBHC/WC) and other school health professionals can play an important role in enhancing school climate, particularly in improving student behavior and rethinking disciplinary approaches. Many schools have begun to move away from zero-tolerance disciplinary policies and to acknowledge the social, emotional, and physical factors that shape student behavior. Positive… <h4>Trauma Screening</h4> Screening students for trauma is a process that needs to take careful consideration in order to be effective and supportive to both students and clinicians. There are many possible screeners available and every screener is a tool to be used in the context of a safe and trusted relationship with a provider. When screening for risk… <h4>Sample Materials</h4> Download sample forms, checklists, and other materials to facilitate your schoolwide screening program. We are grateful to La Clínica de La Raza and Native American Health Center for providing these samples. Recommendations Age-based guidance for what to screen Workplan Sample workplan for implementing schoolwide screenings Roles & Responsibilities List of staff roles and responsibilities Visit… <h2>Stay Up to Date on School-based Health Centers</h2> Sign up to receive our free newsletter and advocate for kids’ health. Organizations that want to receive technical assistance, discounted conference registration, and access to regular member calls can become a member."
        ]
      },
      "modified": "2025-12-22T21:28:30",
      "slug": "our-work",
      "status": "publish",
      "excerpt": "<p>Who We Are The California School-Based Health Alliance (CSHA) is the statewide nonprofit organization helping to put more health services in schools. Healthier children are better able to attend and focus in class. CSHA supports local education agencies, health care partners, and community organizations in launching, enhancing, and sustaining school health services. We influence state [&hellip;]</p>\n",
      "children": [
        {
          "page_id": 924,
          "title": "2026 School Health Conference",
          "link": "https://www.schoolhealthcenters.org/our-work/conference/",
          "content": {
            "full_text": "<h2>The Power of Partnerships</h2> Early Bird registration is now open for our 2026 School Health & Behavioral Health Conference – which will be held April 27-28, 2026, at the Hilton Los Angeles/Universal City. Make sure to sign up for our newsletter for the latest details. Members of CSHA save $200 on registration! If your organization plans to send three or more people to the conference, the membership pays for itself. Learn about membership , including additional benefits. <h2>2026 Conference Rates</h2> <h2>Tentative Schedule</h2> This schedule is subject to change. There will be core conference continuing education (CE) hours available (total hours TBD). ver 120925 <h2>Sponsor & Exhibitor Information</h2> By partnering with us, sponsors have the unique opportunity to showcase their innovative products and services to a diverse audience of educators, healthcare professionals, and policymakers. We believe in building relationships that go beyond transactions, fostering a network of support and mutual growth. <h2>Hotel Information</h2> Our hotel will be held at the Hilton Los Angeles/Universal City, conveniently located within walking distance of Universal Studios and Universal CityWalk Hollywood. Use the link below to make your booking with our discounted room block rate. <h3>See Highlights of Our 2025 Conference</h3> Find more information about our 2025 event in Anaheim.",
            "chunks": [
              "<h2>The Power of Partnerships</h2> Early Bird registration is now open for our 2026 School Health & Behavioral Health Conference – which will be held April 27-28, 2026, at the Hilton Los Angeles/Universal City. Make sure to sign up for our newsletter for the latest details. Members of CSHA save $200 on registration! If your organization plans to send three or more people to the conference, the membership pays for itself. Learn about membership , including additional benefits. <h2>2026 Conference Rates</h2> <h2>Tentative Schedule</h2> This schedule is subject to change. There will be core conference continuing education (CE) hours available (total hours TBD). ver 120925 <h2>Sponsor & Exhibitor Information</h2> By partnering with us, sponsors have the unique opportunity to showcase their innovative products and services to a diverse audience of educators, healthcare professionals, and policymakers. We believe in building relationships that go beyond transactions, fostering a network of support and mutual growth. <h2>Hotel Information</h2> Our hotel will be held at the Hilton Los Angeles/Universal City, conveniently located within walking distance of Universal Studios and Universal CityWalk Hollywood. Use the link below to make your booking with our discounted room block rate. <h3>See Highlights of Our 2025 Conference</h3> Find more information about our 2025 event in Anaheim."
            ]
          },
          "modified": "2025-12-15T17:10:58",
          "slug": "conference",
          "status": "publish",
          "excerpt": "<p>The Power of Partnerships Early Bird registration is now open for our 2026 School Health &amp; Behavioral Health Conference &#8211; which will be held April 27-28, 2026, at the Hilton Los Angeles/Universal City.&nbsp;Make sure to sign up for our newsletter for the latest details. Members of CSHA save $200 on registration! If your organization plans [&hellip;]</p>\n",
          "children": [
            {
              "page_id": 3290,
              "title": "2024 Conference Program",
              "link": "https://www.schoolhealthcenters.org/our-work/conference/2024-program/",
              "content": {
                "full_text": "<h2>Building Transformational School Health for California’s Future</h2> Our 2024 School Health Conference was held April 29-30, 2024, in Santa Clara. <h3>Moments From Our 2024 Conference</h3> Photography by Layeelah <h1>2024 Keynote Speaker</h1> Tomás A. Magaña , MD, MA, FAAP is a physician, educator, and advocate dedicated to improving care and health outcomes for children. As Lead Physician in the Department of School-Based Health Centers at La Clínica de La Raza, Inc. , he serves the complex medical needs of diverse youth from Alameda County. As a Principal Investigator at the Public Health Institute, Dr. Magaña is Founding Director of FACES for the Future Coalition , which prepares youth for entry into careers in the health professions. Additionally, Dr. Magaña is Director of the UCSF Latinx Center of Excellence Aspiring Physicians Program at San Francisco State University. Loading… <h2>Thank You to Our 2024 Sponsors!</h2> The Santa Clara County Office of Education (SCCOE) is our 2024 Conference Presenting Education Partner. SCCOE  is committed to serving, inspiring, and promoting student and public school success. Kaiser Permanente is dedicated to helping meet the unique health needs of schools and communities. Anthem is dedicated to delivering better care to our members, providing greater value to our customers and helping improve the health of our communities. Blue Shield of California strives to create a healthcare system worthy of our family and friends that is sustainably affordable. Proposition 63, approved by California voters in 2004, created the Mental Health Services Oversight and Accountability Commission (MHSOAC) to drive transformational change across the state’s mental health system. Partnering with public and private mental health agencies at all levels, the Commission works to ensure that people get the care they need in a timely, comprehensive, effective, and culturally competent manner. In everything, it vigorously promotes community collaboration. A hallmark of the Mental Health Services Act (MHSA) is its directive that the Commission empower stakeholders and put them at the center of its decision-making process. Accordingly, the law reserves seats on the Commission for representatives of consumers and their families, service providers, law enforcement, educators, and employers, among others. The Commission also includes representatives of the Attorney General, the Superintendent of Public Instruction, the State Senate, and the State Assembly. ACEs Aware is a first-in-the nation effort to promote early detection and intervention to mitigate the health and societal impacts of Adverse Childhood Experiences (ACEs) and toxic stress. We offer free training, screening tools, clinical protocols, and payment for ACE screening. ACEs Aware strives to create a better world for our children, families, and communities by working together across sectors to prevent and address the impact of ACEs and toxic stress. With over 1.5 million members and over 8,000 providers, the Inland Empire Health Plan is the largest not-for-profit Medicare/Medicaid public health plan in the country.",
                "chunks": [
                  "<h2>Building Transformational School Health for California’s Future</h2> Our 2024 School Health Conference was held April 29-30, 2024, in Santa Clara. <h3>Moments From Our 2024 Conference</h3> Photography by Layeelah <h1>2024 Keynote Speaker</h1> Tomás A. Magaña , MD, MA, FAAP is a physician, educator, and advocate dedicated to improving care and health outcomes for children. As Lead Physician in the Department of School-Based Health Centers at La Clínica de La Raza, Inc. , he serves the complex medical needs of diverse youth from Alameda County. As a Principal Investigator at the Public Health Institute, Dr. Magaña is Founding Director of FACES for the Future Coalition , which prepares youth for entry into careers in the health professions. Additionally, Dr. Magaña is Director of the UCSF Latinx Center of Excellence Aspiring Physicians Program at San Francisco State University. Loading… <h2>Thank You to Our 2024 Sponsors!</h2> The Santa Clara County Office of Education (SCCOE) is our 2024 Conference Presenting Education Partner. SCCOE is committed to serving, inspiring, and promoting student and public school success. Kaiser Permanente is dedicated to helping meet the unique health needs of schools and communities. Anthem is dedicated to delivering better care to our members, providing greater value to our customers and helping improve the health of our communities. Blue Shield of California strives to create a healthcare system worthy of our family and friends that is sustainably affordable. Proposition 63, approved by California voters in 2004, created the Mental Health Services Oversight and Accountability Commission (MHSOAC) to drive transformational change across the state’s mental health system. Partnering with public and private mental health agencies at all levels, the Commission works to ensure that people get the care they need in a timely, comprehensive, effective, and culturally competent manner. In everything, it vigorously promotes community collaboration. A hallmark of the Mental Health Services Act (MHSA) is its directive that the Commission empower stakeholders and put them at the center of its decision-making process. Accordingly, the law reserves seats on the Commission for representatives of consumers and their families, service providers, law enforcement, educators, and employers, among others. The Commission also includes representatives of the Attorney General, the Superintendent of Public Instruction, the State Senate, and the State Assembly. ACEs Aware is a first-in-the nation effort to promote early detection and intervention to mitigate the health and societal impacts of Adverse Childhood Experiences (ACEs) and toxic stress. We offer free training,",
                  "and societal impacts of Adverse Childhood Experiences (ACEs) and toxic stress. We offer free training, screening tools, clinical protocols, and payment for ACE screening. ACEs Aware strives to create a better world for our children, families, and communities by working together across sectors to prevent and address the impact of ACEs and toxic stress. With over 1.5 million members and over 8,000 providers, the Inland Empire Health Plan is the largest not-for-profit Medicare/Medicaid public health plan in the country."
                ]
              },
              "modified": "2025-07-15T15:25:16",
              "slug": "2024-program",
              "status": "publish",
              "excerpt": "<p>Building Transformational School Health for California’s Future Our 2024 School Health Conference was held April 29-30, 2024, in Santa Clara.&nbsp; Moments From Our 2024 Conference Photography by&nbsp;Layeelah 2024 Keynote Speaker Tomás A. Magaña, MD, MA, FAAP is a physician, educator, and advocate dedicated to improving care and health outcomes for children. As Lead Physician in [&hellip;]</p>\n",
              "children": [],
              "document_uuid": "f7ac69c9-7741-5ca4-a987-130dbe1d26b6"
            }
          ],
          "document_uuid": "5340423b-afbd-5f38-9444-e880d3a48cd8"
        },
        {
          "page_id": 4450,
          "title": "2025 Y2Y Conference",
          "link": "https://www.schoolhealthcenters.org/our-work/2025-y2y-conference/",
          "content": {
            "full_text": "Thursday, November 13, 8:30 am-3:30 pm, in Oakland: Local Bay Area youth groups are invited to join our annual Youth-to-Youth (Y2Y) Conference – Youth Rooted in Hope, Rising in Strength – to learn, bond, network, and share information with one another. This is a no-cost event. Youth groups from other parts of California are welcome to join the event as long as space is available. However, we are unable to provide any travel reimbursements or transportation support. Adult allies must complete our interest form as soon as possible to be considered as space is limited. We are limiting each youth group to 10 high school students with a maximum of two adult allies. <h2>Indicate Interest</h2> Only one adult ally per youth group needs to submit the form below. <h2>Download a Flyer</h2> Let students know about the 2025 Y2Y conference! <h2>Learn About Y2Y</h2> <h3>California Students Creatively Share Health Knowledge at Y2Y</h3> In November 2024, CSHA brought together over 250 attendees – including 180 youth – from across California to connect with one another at the annual Y2Y conference.",
            "chunks": [
              "Thursday, November 13, 8:30 am-3:30 pm, in Oakland: Local Bay Area youth groups are invited to join our annual Youth-to-Youth (Y2Y) Conference – Youth Rooted in Hope, Rising in Strength – to learn, bond, network, and share information with one another. This is a no-cost event. Youth groups from other parts of California are welcome to join the event as long as space is available. However, we are unable to provide any travel reimbursements or transportation support. Adult allies must complete our interest form as soon as possible to be considered as space is limited. We are limiting each youth group to 10 high school students with a maximum of two adult allies. <h2>Indicate Interest</h2> Only one adult ally per youth group needs to submit the form below. <h2>Download a Flyer</h2> Let students know about the 2025 Y2Y conference! <h2>Learn About Y2Y</h2> <h3>California Students Creatively Share Health Knowledge at Y2Y</h3> In November 2024, CSHA brought together over 250 attendees – including 180 youth – from across California to connect with one another at the annual Y2Y conference."
            ]
          },
          "modified": "2025-09-11T00:10:58",
          "slug": "2025-y2y-conference",
          "status": "publish",
          "excerpt": "<p>Thursday, November 13, 8:30 am-3:30 pm, in Oakland: Local Bay Area youth groups are invited to join our annual Youth-to-Youth (Y2Y) Conference &#8211; Youth Rooted in Hope, Rising in Strength &#8211; to learn, bond, network, and share information with one another. This is a no-cost event. Youth groups from other parts of California are welcome [&hellip;]</p>\n",
          "children": [],
          "document_uuid": "126e0964-8ef2-56fe-ab26-d2b69f58ec94"
        },
        {
          "page_id": 4437,
          "title": "2025 School Health Conference",
          "link": "https://www.schoolhealthcenters.org/our-work/2025-conference-program/",
          "content": {
            "full_text": "<h2>The Power of Partnerships</h2> Our 2025 School Health Conference was held April 28-29, 2025, at the Hyatt Regency Orange County near Anaheim. <h3>Experience Our Conference</h3> <h3>Moments From Our 2025 Conference</h3> Photography by Vita Vivet Film Productions . <h4>2025 Keynote Speaker</h4> Saun-Toy Trotter , LMFT, is a healer and psychotherapist with over 20 years of experience providing trauma-informed and culturally responsive behavioral health care to adolescents and families. She has experience in school health centers, residential treatment facilities, in-patient, and psychiatric units, and her practice is rooted in youth development principles. At UCSF Benioff Children’s Hospital Oakland, she has expanded school-based services to include health education and youth advisory boards. Saun-Toy is a contributing author to School Social Work: Engaging Social Justice and Racial Equity from a Practitioners Perspective . She loves working in schools and is committed to evidence-based and culturally rooted practices that foster individual and collective health, wellbeing, and liberation. Loading… <h4>How to Find Session Materials</h4> Are you looking for workshop handouts and presentation slides? Log in to Whova where you can find presentation materials – if shared by the presenter – listed below the description for each session. <h4>Thank You to Our 2025 Sponsors!</h4> CalOptima Health is the single largest health insurer in Orange County administering Medi-Cal for nearly 1 million Orange County residents. Our mission is to serve member health with excellence and dignity, respecting the value and needs of each person. Blue Shield of California strives to create a healthcare system worthy of our family and friends that is sustainably affordable. Blue Shield of California is a tax paying, nonprofit, independent member of the Blue Cross Blue Shield Association with 8 million members, 7,200 employees and more than $24 billion in annual revenue. Founded in 1939 in San Francisco and now headquartered in Oakland, Blue Shield of California and its affiliates provide health, dental, vision, Medicaid and Medicare healthcare service plans in California. The company has contributed more than $643 million to Blue Shield of California Foundation since 2002 to have an impact on California communities. Anthem is dedicated to delivering better care to our members, providing greater value to our customers and helping improve the health of our communities. Schools are passionate about ensuring that all students succeed, but they can’t address the health of their employees and students alone. That’s why Kaiser Permanente created Thriving Schools . We’re committed to serving as a valuable partner in health to schools and districts across the country, helping to ensure that teachers, staff, and students have the support they need to thrive — in learning and in health. Eager minds, healthy bodies, and quality care: The Los Angeles Trust for Children’s Health is bringing health and education together to end healthcare inequities and achieve student wellness for all. ACEs Aware is a first-in-the nation effort to promote early detection and intervention to mitigate the health and societal impacts of Adverse Childhood Experiences (ACEs) and toxic stress. We offer free training, screening tools, clinical protocols, and payment for ACE screening. ACEs Aware strives to create a better world for our children, families, and communities by working together across sectors to prevent and address the impact of ACEs and toxic stress.",
            "chunks": [
              "<h2>The Power of Partnerships</h2> Our 2025 School Health Conference was held April 28-29, 2025, at the Hyatt Regency Orange County near Anaheim. <h3>Experience Our Conference</h3> <h3>Moments From Our 2025 Conference</h3> Photography by Vita Vivet Film Productions . <h4>2025 Keynote Speaker</h4> Saun-Toy Trotter , LMFT, is a healer and psychotherapist with over 20 years of experience providing trauma-informed and culturally responsive behavioral health care to adolescents and families. She has experience in school health centers, residential treatment facilities, in-patient, and psychiatric units, and her practice is rooted in youth development principles. At UCSF Benioff Children’s Hospital Oakland, she has expanded school-based services to include health education and youth advisory boards. Saun-Toy is a contributing author to School Social Work: Engaging Social Justice and Racial Equity from a Practitioners Perspective . She loves working in schools and is committed to evidence-based and culturally rooted practices that foster individual and collective health, wellbeing, and liberation. Loading… <h4>How to Find Session Materials</h4> Are you looking for workshop handouts and presentation slides? Log in to Whova where you can find presentation materials – if shared by the presenter – listed below the description for each session. <h4>Thank You to Our 2025 Sponsors!</h4> CalOptima Health is the single largest health insurer in Orange County administering Medi-Cal for nearly 1 million Orange County residents. Our mission is to serve member health with excellence and dignity, respecting the value and needs of each person. Blue Shield of California strives to create a healthcare system worthy of our family and friends that is sustainably affordable. Blue Shield of California is a tax paying, nonprofit, independent member of the Blue Cross Blue Shield Association with 8 million members, 7,200 employees and more than $24 billion in annual revenue. Founded in 1939 in San Francisco and now headquartered in Oakland, Blue Shield of California and its affiliates provide health, dental, vision, Medicaid and Medicare healthcare service plans in California. The company has contributed more than $643 million to Blue Shield of California Foundation since 2002 to have an impact on California communities. Anthem is dedicated to delivering better care to our members, providing greater value to our customers and helping improve the health of our communities. Schools are passionate about ensuring that all students succeed, but they can’t address the health of their employees and students alone. That’s why Kaiser Permanente created Thriving Schools . We’re committed to serving as a",
              "alone. That’s why Kaiser Permanente created Thriving Schools . We’re committed to serving as a valuable partner in health to schools and districts across the country, helping to ensure that teachers, staff, and students have the support they need to thrive — in learning and in health. Eager minds, healthy bodies, and quality care: The Los Angeles Trust for Children’s Health is bringing health and education together to end healthcare inequities and achieve student wellness for all. ACEs Aware is a first-in-the nation effort to promote early detection and intervention to mitigate the health and societal impacts of Adverse Childhood Experiences (ACEs) and toxic stress. We offer free training, screening tools, clinical protocols, and payment for ACE screening. ACEs Aware strives to create a better world for our children, families, and communities by working together across sectors to prevent and address the impact of ACEs and toxic stress."
            ]
          },
          "modified": "2025-09-09T20:56:46",
          "slug": "2025-conference-program",
          "status": "publish",
          "excerpt": "<p>The Power of Partnerships Our 2025 School Health Conference was held April 28-29, 2025, at the Hyatt Regency Orange County near Anaheim.&nbsp; Experience Our Conference Moments From Our 2025 Conference Photography by&nbsp;Vita Vivet Film Productions. 2025 Keynote Speaker Saun-Toy Trotter, LMFT,&nbsp;is a healer and psychotherapist with over 20 years of experience providing trauma-informed and culturally [&hellip;]</p>\n",
          "children": [],
          "document_uuid": "0c9595ad-fe86-539d-acf9-af064b2c38db"
        },
        {
          "page_id": 798,
          "title": "Regional Coalitions",
          "link": "https://www.schoolhealthcenters.org/our-work/regions/",
          "content": {
            "full_text": "The California School-Based Health Alliance brings together school health, education, and community stakeholders from regions of the state to network, share resources, and explore solutions to common challenges facing children and youth in their communities. <h3>Northern</h3> <h3>Central Valley</h3> <h3>Inland Empire</h3> Our regional focus areas are informed by the Student Health Index, which identifies the areas of the state where school-based health care would make the most positive impact for student well-being and achievement. <h2>Student Health Index</h2> See a school-level data on a variety of student health indicators.",
            "chunks": [
              "The California School-Based Health Alliance brings together school health, education, and community stakeholders from regions of the state to network, share resources, and explore solutions to common challenges facing children and youth in their communities. <h3>Northern</h3> <h3>Central Valley</h3> <h3>Inland Empire</h3> Our regional focus areas are informed by the Student Health Index, which identifies the areas of the state where school-based health care would make the most positive impact for student well-being and achievement. <h2>Student Health Index</h2> See a school-level data on a variety of student health indicators."
            ]
          },
          "modified": "2025-07-16T18:30:21",
          "slug": "regions",
          "status": "publish",
          "excerpt": "<p>The California School-Based Health Alliance brings together school health, education, and community stakeholders from regions of the state to network, share resources, and explore solutions to common challenges facing children and youth in their communities. Our regional focus areas are informed by the Student Health Index, which identifies the areas of the state where school-based [&hellip;]</p>\n",
          "children": [
            {
              "page_id": 907,
              "title": "Northern School Health Coalition",
              "link": "https://www.schoolhealthcenters.org/our-work/regions/far-north/",
              "content": {
                "full_text": "<h2>Next Meeting: Friday, January 16, 2026</h2> Join the California School-Based Health Alliance for our Northern School Health Coalition meeting that aims to bring together school-based health partners from across the region! This group is for Northern California educators and health, mental health, and other student support practitioners. Please reach out to Sierra Lau with any questions. Date & Time: Friday, January 16, 11:00 am-12:20 pm Pacific Location: Virtual This group is for educators and health, mental health, and other student support practitioners from counties in far northern California: <h2>Are you a member of the California School-Based Health Alliance?</h2> Organizations that join as members receive valuable benefits – including discounted registration to our California School Health Conference – and a limited number of complimentary hours of technical assistance. <h3>About the Northern School Health Coalition</h3> There is growing recognition in the role health and well-being plays in the success of students. School-based health centers (SBHCs), defined as health clinics located on or near school campuses where children and youth can get immediate help for acute and chronic conditions as well as preventative care, are positioned to help create more equitable access to care for youth. The California School-Based Health Alliance’s Student Health Index — designed to identify opportunities to expand health care in schools — revealed that Lake and Tehama Counties are among the top 10 counties with the highest ratio of high need schools to all schools. <h4>Purpose</h4> The purpose of the Northern School Health Coalition is to expand and support the SBHC movement, and to facilitate greater engagement, investment, and proliferation of school health services, all of which equate to greater access for youth. <h5>Resources from Past Meetings</h5> <h2>Who We Are</h2> The California School-Based Health Alliance (CSHA) is the statewide non-profit organization dedicated to improving the health & academic success of children & youth by advancing health services in schools.",
                "chunks": [
                  "<h2>Next Meeting: Friday, January 16, 2026</h2> Join the California School-Based Health Alliance for our Northern School Health Coalition meeting that aims to bring together school-based health partners from across the region! This group is for Northern California educators and health, mental health, and other student support practitioners. Please reach out to Sierra Lau with any questions. Date & Time: Friday, January 16, 11:00 am-12:20 pm Pacific Location: Virtual This group is for educators and health, mental health, and other student support practitioners from counties in far northern California: <h2>Are you a member of the California School-Based Health Alliance?</h2> Organizations that join as members receive valuable benefits – including discounted registration to our California School Health Conference – and a limited number of complimentary hours of technical assistance. <h3>About the Northern School Health Coalition</h3> There is growing recognition in the role health and well-being plays in the success of students. School-based health centers (SBHCs), defined as health clinics located on or near school campuses where children and youth can get immediate help for acute and chronic conditions as well as preventative care, are positioned to help create more equitable access to care for youth. The California School-Based Health Alliance’s Student Health Index — designed to identify opportunities to expand health care in schools — revealed that Lake and Tehama Counties are among the top 10 counties with the highest ratio of high need schools to all schools. <h4>Purpose</h4> The purpose of the Northern School Health Coalition is to expand and support the SBHC movement, and to facilitate greater engagement, investment, and proliferation of school health services, all of which equate to greater access for youth. <h5>Resources from Past Meetings</h5> <h2>Who We Are</h2> The California School-Based Health Alliance (CSHA) is the statewide non-profit organization dedicated to improving the health & academic success of children & youth by advancing health services in schools."
                ]
              },
              "modified": "2025-10-02T15:16:48",
              "slug": "far-north",
              "status": "publish",
              "excerpt": "<p>Next Meeting: Friday, January 16, 2026 Join the California School-Based Health Alliance for our Northern School Health Coalition meeting that aims to bring together school-based health partners from across the region! This group is for Northern California educators and health, mental health, and other student support practitioners. Please reach out to&nbsp;Sierra Lau&nbsp;with any questions. Date [&hellip;]</p>\n",
              "children": [],
              "document_uuid": "5bd095ed-1b3c-5186-bc85-6028b0c4fbd4"
            },
            {
              "page_id": 885,
              "title": "Inland Empire",
              "link": "https://www.schoolhealthcenters.org/our-work/regions/inland-empire/",
              "content": {
                "full_text": "<h2>Save the Date for Our February Meeting</h2> Join the California School-Based Health Alliance on Thursday, February 5, 2026, from 11:00 am-2:00 pm for our coalition meeting that brings together school-based health partners across Riverside and San Bernardino Counties! This event is for Inland Empire educators and health, mental health, and other student support practitioners. Registration will be posted in January 2026. <h2>Are you a member of the California School-Based Health Alliance?</h2> Organizations that join as members receive valuable benefits – including discounted registration to our California School Health Conference – and a limited number of complimentary hours of technical assistance. Monday, October 6, 2025 9:00 am – 3:00 pm San Bernardino County 11:00 am – 2:00 pm 11:00 am – 2:00 pm April 27-28, 2026 Los Angeles County 11:00 am – 2:00 pm San Bernardino, CA <h4>About the Inland Empire School Health Coalition</h4> There is growing recognition in the role health and well-being plays in the success of students. School-based health centers (SBHCs), defined as health clinics located on or near school campuses where children and youth can get immediate help for acute and chronic conditions as well as preventative care, are positioned to help create more equitable access to care for youth. Interest and momentum are building among local stakeholders in the Inland Empire region of California (Riverside and San Bernardino Counties) to develop new school-based health and wellness centers. The California School-Based Health Alliance’s Student Health Index — designed to identify opportunities to expand health care in schools — revealed that San Bernardino County has five of the top ten school districts with the highest ratio of high need schools to total schools. <h5>Purpose</h5> The purpose of the Inland Empire School-Based Health Centers Coalition (coalition) is to expand and support the SBHC movement, and to facilitate greater engagement, investment, and proliferation of school health services, all of which equate to greater access for youth. <h5>Goals</h5> <h3>Develop Partnerships</h3> <h3>Leverage Support</h3> <h3>Technical Assistance</h3> <h2>Steering Committee</h2> The development and maintenance of the coalition is supported by the California School-Based Health Alliance. We do this in partnership with representatives from partner health, education, and community based agencies from throughout the region. The steering committee provides leadership and guidance around the development and operations of the coalition, which includes planning convenings and serving as a channel of communication about school-based health care. <h3>School-Based Health Center Webinar Series</h3> The California School-Based Health Alliance has partnered with the San Bernardino County Superintendent of Schools to present a series of webinars on bringing school-based health and wellness centers to schools. <h2>Inland Empire School Health Podcasts</h2> <h3>The School Health Connection Podcast</h3> The School Health Connection Podcast is your go-to source for insights and inspiration in creating healthier school environments. Brought to you by the California School-Based Health Alliance, Inland Empire School Health Coalition, and in collaboration with the San Bernardino County Superintendent of Schools. <h3>The Shine Line Podcast</h3> Hear directly from students participating in Sierra High School’s The Sunshine Crew as they speak to adults in their community about ideas and practices that inspire! <h2>School-Based Health Symposiums</h2> Swipe to see more <h2>Resources from Past Meetings</h2> <h2>Who We Are</h2> The California School-Based Health Alliance (CSHA) is the statewide non-profit organization dedicated to improving the health & academic success of children & youth by advancing health services in schools.",
                "chunks": [
                  "<h2>Save the Date for Our February Meeting</h2> Join the California School-Based Health Alliance on Thursday, February 5, 2026, from 11:00 am-2:00 pm for our coalition meeting that brings together school-based health partners across Riverside and San Bernardino Counties! This event is for Inland Empire educators and health, mental health, and other student support practitioners. Registration will be posted in January 2026. <h2>Are you a member of the California School-Based Health Alliance?</h2> Organizations that join as members receive valuable benefits – including discounted registration to our California School Health Conference – and a limited number of complimentary hours of technical assistance. Monday, October 6, 2025 9:00 am – 3:00 pm San Bernardino County 11:00 am – 2:00 pm 11:00 am – 2:00 pm April 27-28, 2026 Los Angeles County 11:00 am – 2:00 pm San Bernardino, CA <h4>About the Inland Empire School Health Coalition</h4> There is growing recognition in the role health and well-being plays in the success of students. School-based health centers (SBHCs), defined as health clinics located on or near school campuses where children and youth can get immediate help for acute and chronic conditions as well as preventative care, are positioned to help create more equitable access to care for youth. Interest and momentum are building among local stakeholders in the Inland Empire region of California (Riverside and San Bernardino Counties) to develop new school-based health and wellness centers. The California School-Based Health Alliance’s Student Health Index — designed to identify opportunities to expand health care in schools — revealed that San Bernardino County has five of the top ten school districts with the highest ratio of high need schools to total schools. <h5>Purpose</h5> The purpose of the Inland Empire School-Based Health Centers Coalition (coalition) is to expand and support the SBHC movement, and to facilitate greater engagement, investment, and proliferation of school health services, all of which equate to greater access for youth. <h5>Goals</h5> <h3>Develop Partnerships</h3> <h3>Leverage Support</h3> <h3>Technical Assistance</h3> <h2>Steering Committee</h2> The development and maintenance of the coalition is supported by the California School-Based Health Alliance. We do this in partnership with representatives from partner health, education, and community based agencies from throughout the region. The steering committee provides leadership and guidance around the development and operations of the coalition, which includes planning convenings and serving as a channel of communication about school-based health care. <h3>School-Based Health Center Webinar Series</h3> The California School-Based Health Alliance has",
                  "about school-based health care. <h3>School-Based Health Center Webinar Series</h3> The California School-Based Health Alliance has partnered with the San Bernardino County Superintendent of Schools to present a series of webinars on bringing school-based health and wellness centers to schools. <h2>Inland Empire School Health Podcasts</h2> <h3>The School Health Connection Podcast</h3> The School Health Connection Podcast is your go-to source for insights and inspiration in creating healthier school environments. Brought to you by the California School-Based Health Alliance, Inland Empire School Health Coalition, and in collaboration with the San Bernardino County Superintendent of Schools. <h3>The Shine Line Podcast</h3> Hear directly from students participating in Sierra High School’s The Sunshine Crew as they speak to adults in their community about ideas and practices that inspire! <h2>School-Based Health Symposiums</h2> Swipe to see more <h2>Resources from Past Meetings</h2> <h2>Who We Are</h2> The California School-Based Health Alliance (CSHA) is the statewide non-profit organization dedicated to improving the health & academic success of children & youth by advancing health services in schools."
                ]
              },
              "modified": "2025-12-22T18:04:15",
              "slug": "inland-empire",
              "status": "publish",
              "excerpt": "<p>Save the Date for Our February Meeting Join the California School-Based Health Alliance on&nbsp;Thursday, February 5, 2026, from 11:00 am-2:00 pm&nbsp;for our coalition meeting that brings together school-based health partners across Riverside and San Bernardino Counties! This event is for Inland Empire educators and health, mental health, and other student support practitioners. Registration will be [&hellip;]</p>\n",
              "children": [],
              "document_uuid": "a3f93aa6-03f6-57f1-9f36-99f8bf07e218"
            },
            {
              "page_id": 761,
              "title": "Central Valley School Health Coalition",
              "link": "https://www.schoolhealthcenters.org/our-work/regions/central-valley/",
              "content": {
                "full_text": "<h2>Next Meeting: Friday, March 6, 2026</h2> Join the California School-Based Health Alliance for our Central Valley School Health Coalition meeting that aims to bring together school-based health partners from across the region. This meeting is for Central Valley educators and health, mental health, and other student support practitioners. There is no cost to attend. Time: Friday, March 6, 2026, 10:00 am-12:30 pm Location: Fresno Mission City Center, Fresno <h2>Are you a member of the California School-Based Health Alliance?</h2> Organizations that join as members receive valuable benefits – including discounted registration to our California School Health Conference – and a limited number of complimentary hours of technical assistance. <h3>About the Central Valley School Health Coalition</h3> There is growing recognition in the role health and well-being plays in the success of students. School-based health centers and wellness centers (SBHCs/WCs) are positioned to help create more equitable access to care for youth. The California School-Based Health Alliance’s Student Health Index — which identifies opportunities to expand health care in schools — reveals that Merced, Madera, Fresno, Tulare, and Kern Counties are among the top 10 counties with the highest ratio of high need schools to all schools. <h3>Purpose</h3> The purpose of the Central Valley School Health Coalition is to expand and support the school-based health center and wellness center movement, and to facilitate greater engagement, investment, and proliferation of school health services, all of which equate to greater access for youth. <h3>Resources from Past Meetings</h3> <h2>Who We Are</h2> The California School-Based Health Alliance (CSHA) is the statewide non-profit organization dedicated to improving the health & academic success of children & youth by advancing health services in schools.",
                "chunks": [
                  "<h2>Next Meeting: Friday, March 6, 2026</h2> Join the California School-Based Health Alliance for our Central Valley School Health Coalition meeting that aims to bring together school-based health partners from across the region. This meeting is for Central Valley educators and health, mental health, and other student support practitioners. There is no cost to attend. Time: Friday, March 6, 2026, 10:00 am-12:30 pm Location: Fresno Mission City Center, Fresno <h2>Are you a member of the California School-Based Health Alliance?</h2> Organizations that join as members receive valuable benefits – including discounted registration to our California School Health Conference – and a limited number of complimentary hours of technical assistance. <h3>About the Central Valley School Health Coalition</h3> There is growing recognition in the role health and well-being plays in the success of students. School-based health centers and wellness centers (SBHCs/WCs) are positioned to help create more equitable access to care for youth. The California School-Based Health Alliance’s Student Health Index — which identifies opportunities to expand health care in schools — reveals that Merced, Madera, Fresno, Tulare, and Kern Counties are among the top 10 counties with the highest ratio of high need schools to all schools. <h3>Purpose</h3> The purpose of the Central Valley School Health Coalition is to expand and support the school-based health center and wellness center movement, and to facilitate greater engagement, investment, and proliferation of school health services, all of which equate to greater access for youth. <h3>Resources from Past Meetings</h3> <h2>Who We Are</h2> The California School-Based Health Alliance (CSHA) is the statewide non-profit organization dedicated to improving the health & academic success of children & youth by advancing health services in schools."
                ]
              },
              "modified": "2025-12-09T00:12:51",
              "slug": "central-valley",
              "status": "publish",
              "excerpt": "<p>Next Meeting: Friday, March 6, 2026 Join the California School-Based Health Alliance for our Central Valley School Health Coalition meeting that aims to bring together school-based health partners from across the region. This meeting is for Central Valley educators and health, mental health, and other student support practitioners. There is no cost to attend. Time: [&hellip;]</p>\n",
              "children": [],
              "document_uuid": "644ef121-40dc-5729-908d-b169eef54bd0"
            }
          ],
          "document_uuid": "a957e5b5-75dc-532b-900d-f0ff65a76423"
        },
        {
          "page_id": 796,
          "title": "Policy",
          "link": "https://www.schoolhealthcenters.org/our-work/policy/",
          "content": {
            "full_text": "<h2>Momentum Is Building to Put Health Care Where Kids Are, in Schools!</h2> Communities across California are fired up about the school-based health center movement  — and the momentum is undeniable. From cities to rural towns, people are coming together to advocate for school-based health centers (SBHC) and wellness centers (WC) and actively pursuing local, state, federal, and philanthropic support to start, enhance, and sustain these vital health services. Progress is happening — but we’re just getting started. Thousands more children, youth, and families still need access to the life-changing care that SBHCs/WCs provide. The California School-Based Health Alliance (CSHA) is leading the charge and shaping the policy landscape to expand comprehensive school health services across the state. Every year, we zero in on bold policy priorities and take strong stands on key legislation — all with one mission in mind: to ensure every student has the support, care, and resources they need to be healthy, safe, ready to learn and thrive. <h2>Policy Priorities</h2> <h4>Goal 1</h4> Advocate for state funding to start, improve, and expand new school-based health centers and wellness centers (SBHCs/WCs). <h4>Goal 2</h4> Ensure students’ access to physical, mental, sexual + reproductive health by protecting access to medically accurate, confidential, culturally relevant, and age-appropriate health services in schools. <h4>Goal 3</h4> Champion school environments that support whole child well-being so students can thrive. <h2>Advocacy Platform</h2> As part of its advocacy mission, the California School-Based Health Alliance (CSHA) often takes public positions on bills, ballot initiatives, and public policy issues that other organizations are sponsoring. Recognizing that improving the health and academic success of children and youth is impacted by many factors, systems, and policies and to further the mission of advancing health services in schools, CSHA supports legislation and policies that: <h2>Stay Informed. Be Inspired. Join the Movement.</h2> Explore the latest updates on health and education policies that are transforming school health in California — and find out how you can help power the next wave of change.",
            "chunks": [
              "<h2>Momentum Is Building to Put Health Care Where Kids Are, in Schools!</h2> Communities across California are fired up about the school-based health center movement — and the momentum is undeniable. From cities to rural towns, people are coming together to advocate for school-based health centers (SBHC) and wellness centers (WC) and actively pursuing local, state, federal, and philanthropic support to start, enhance, and sustain these vital health services. Progress is happening — but we’re just getting started. Thousands more children, youth, and families still need access to the life-changing care that SBHCs/WCs provide. The California School-Based Health Alliance (CSHA) is leading the charge and shaping the policy landscape to expand comprehensive school health services across the state. Every year, we zero in on bold policy priorities and take strong stands on key legislation — all with one mission in mind: to ensure every student has the support, care, and resources they need to be healthy, safe, ready to learn and thrive. <h2>Policy Priorities</h2> <h4>Goal 1</h4> Advocate for state funding to start, improve, and expand new school-based health centers and wellness centers (SBHCs/WCs). <h4>Goal 2</h4> Ensure students’ access to physical, mental, sexual + reproductive health by protecting access to medically accurate, confidential, culturally relevant, and age-appropriate health services in schools. <h4>Goal 3</h4> Champion school environments that support whole child well-being so students can thrive. <h2>Advocacy Platform</h2> As part of its advocacy mission, the California School-Based Health Alliance (CSHA) often takes public positions on bills, ballot initiatives, and public policy issues that other organizations are sponsoring. Recognizing that improving the health and academic success of children and youth is impacted by many factors, systems, and policies and to further the mission of advancing health services in schools, CSHA supports legislation and policies that: <h2>Stay Informed. Be Inspired. Join the Movement.</h2> Explore the latest updates on health and education policies that are transforming school health in California — and find out how you can help power the next wave of change."
            ]
          },
          "modified": "2025-07-31T22:35:35",
          "slug": "policy",
          "status": "publish",
          "excerpt": "<p>Momentum Is Building to Put Health Care Where Kids Are, in Schools! Communities across California are fired up about the school-based health center movement&nbsp; — and the momentum is undeniable. From cities to rural towns, people are coming together to advocate for school-based health centers (SBHC) and wellness centers (WC) and actively pursuing local, state, [&hellip;]</p>\n",
          "children": [
            {
              "page_id": 2555,
              "title": "Existing Laws",
              "link": "https://www.schoolhealthcenters.org/our-work/policy/existing-federal-and-state-laws/",
              "content": {
                "full_text": "<h2>California Laws Related to School-Based Health Centers</h2> <h3>AJR 10 (Brownley): School-Based Health Centers (2011)</h3> Resolution Chapter 68, Statutes of 2011; sponsored by the California School-Based Health Alliance This resolution was passed by the California Legislature in 2011. AJR 10 affirms the Legislature’s support for the federal school-based health center program authorized by Congress in 2010 and calls for an appropriation by Congress for that program. It also affirms the Legislature’s support for state and federal policies that include school-based health centers as partners for creating medical homes for all children, and for the inclusion of school-based health centers in the reauthorized Elementary and Secondary Education Act as an important strategy for ensuring that students are physically and mentally healthy and therefore ready to learn. Read the full text of AJR 10 (PDF). <h3>SB 564 (Ridley-Thomas): The School Health Centers Expansion Act (2008)</h3> Chapter 381, Statutes of 2008; sponsored by the California School-Based Health Alliance Signed by Gov. Schwarzenegger in September 2008, SB 564 builds upon an earlier Ridley-Thomas bill, AB 2560, which established a Public School Health Center Support Program. SB 564 created a grant program for school health centers administered by the Public School Health Center Support Program. To date, the grant program has not been funded. Read the full text of SB 564 (PDF). <h3>AB 2560 (Ridley-Thomas): The School Health Centers Act (2006)</h3> Chapter 334, Statutes of 2006; sponsored by the California School-Based Health Alliance Signed by Gov. Schwarzenegger on Sept. 19, 2006, this law created a Public School Health Center Program jointly administered by the Department of Health Services and the Department of Education. The program was designed to collect school health center data, facilitate the development of comprehensive health centers in partnership with California public schools, and address the programmatic, clinical, finance, and policy needs of California’s school health centers. To date, the program has not been implemented because neither state funding nor staff was made available for the program. Read the full text of AB 2560 (PDF). <h3>SB 620 (Presley): Healthy Start Support Services for Children Act (1991)</h3> Chapter 759, Statutes of 1991 This bill established Healthy Start, which provides planning and implementation grants for school-based student support services and their coordination. Healthy Start programs offer: academic and educational support; youth development and employment services; family support services; and medical and mental health care. Many of California’s SBHCs started as Healthy Start programs. Healthy Start funding peaked at $39 million in the 1990s. In 2007, the program was funded at $10 million. Since 2007, no new Healthy Start grants have been awarded. <h2>Federal Laws Regarding School-Based Health Centers</h2> <h3>Patient Protection and Affordable Care Act (aka Health Care Reform) (2010)</h3> Public Law 111-148, Title IV, Subtitle B, Sec 4101 This piece of legislation defines school-based health centers as providing comprehensive primary care services, including both physical and mental health services, at or near a school, in a clinic operated by a qualified sponsoring agency. It establishes and appropriates funds for a one-time grant program for school-based health center facilities, equipment, and related expenditures. It authorizes but does not appropriate funds for a school-based health center grant program for equipment, training, management and operations, and personnel. Read the full text of the section of the legislation defining SBHCs. Read the portion of the Patient Protection and Affordable Care Act focused on SBHCs . <h3>Children’s Health Insurance Program Reauthorization Act/Social Security Act (2009)</h3> Public Law 74-271, Sec 2110(c)(9) This piece of legislation defines school-based health centers as providing comprehensive primary care services at or near a school, in a clinic operated by a sponsoring agency. It defines sponsoring agency as a hospital, public health department, community health center, nonprofit health care agency, local educational agency, or a program administered by the Indian Health Service, Bureau of Indian Affairs, or an Indian tribe or organization. Read the full text of the section of the legislation defining SBHCs .",
                "chunks": [
                  "<h2>California Laws Related to School-Based Health Centers</h2> <h3>AJR 10 (Brownley): School-Based Health Centers (2011)</h3> Resolution Chapter 68, Statutes of 2011; sponsored by the California School-Based Health Alliance This resolution was passed by the California Legislature in 2011. AJR 10 affirms the Legislature’s support for the federal school-based health center program authorized by Congress in 2010 and calls for an appropriation by Congress for that program. It also affirms the Legislature’s support for state and federal policies that include school-based health centers as partners for creating medical homes for all children, and for the inclusion of school-based health centers in the reauthorized Elementary and Secondary Education Act as an important strategy for ensuring that students are physically and mentally healthy and therefore ready to learn. Read the full text of AJR 10 (PDF). <h3>SB 564 (Ridley-Thomas): The School Health Centers Expansion Act (2008)</h3> Chapter 381, Statutes of 2008; sponsored by the California School-Based Health Alliance Signed by Gov. Schwarzenegger in September 2008, SB 564 builds upon an earlier Ridley-Thomas bill, AB 2560, which established a Public School Health Center Support Program. SB 564 created a grant program for school health centers administered by the Public School Health Center Support Program. To date, the grant program has not been funded. Read the full text of SB 564 (PDF). <h3>AB 2560 (Ridley-Thomas): The School Health Centers Act (2006)</h3> Chapter 334, Statutes of 2006; sponsored by the California School-Based Health Alliance Signed by Gov. Schwarzenegger on Sept. 19, 2006, this law created a Public School Health Center Program jointly administered by the Department of Health Services and the Department of Education. The program was designed to collect school health center data, facilitate the development of comprehensive health centers in partnership with California public schools, and address the programmatic, clinical, finance, and policy needs of California’s school health centers. To date, the program has not been implemented because neither state funding nor staff was made available for the program. Read the full text of AB 2560 (PDF). <h3>SB 620 (Presley): Healthy Start Support Services for Children Act (1991)</h3> Chapter 759, Statutes of 1991 This bill established Healthy Start, which provides planning and implementation grants for school-based student support services and their coordination. Healthy Start programs offer: academic and educational support; youth development and employment services; family support services; and medical and mental health care. Many of California’s SBHCs started as Healthy Start programs. Healthy Start",
                  "and mental health care. Many of California’s SBHCs started as Healthy Start programs. Healthy Start funding peaked at $39 million in the 1990s. In 2007, the program was funded at $10 million. Since 2007, no new Healthy Start grants have been awarded. <h2>Federal Laws Regarding School-Based Health Centers</h2> <h3>Patient Protection and Affordable Care Act (aka Health Care Reform) (2010)</h3> Public Law 111-148, Title IV, Subtitle B, Sec 4101 This piece of legislation defines school-based health centers as providing comprehensive primary care services, including both physical and mental health services, at or near a school, in a clinic operated by a qualified sponsoring agency. It establishes and appropriates funds for a one-time grant program for school-based health center facilities, equipment, and related expenditures. It authorizes but does not appropriate funds for a school-based health center grant program for equipment, training, management and operations, and personnel. Read the full text of the section of the legislation defining SBHCs. Read the portion of the Patient Protection and Affordable Care Act focused on SBHCs . <h3>Children’s Health Insurance Program Reauthorization Act/Social Security Act (2009)</h3> Public Law 74-271, Sec 2110(c)(9) This piece of legislation defines school-based health centers as providing comprehensive primary care services at or near a school, in a clinic operated by a sponsoring agency. It defines sponsoring agency as a hospital, public health department, community health center, nonprofit health care agency, local educational agency, or a program administered by the Indian Health Service, Bureau of Indian Affairs, or an Indian tribe or organization. Read the full text of the section of the legislation defining SBHCs ."
                ]
              },
              "modified": "2025-06-04T22:21:02",
              "slug": "existing-federal-and-state-laws",
              "status": "publish",
              "excerpt": "<p>California Laws Related to School-Based Health Centers AJR 10 (Brownley): School-Based Health Centers (2011) Resolution Chapter 68, Statutes of 2011; sponsored by the California School-Based Health Alliance This resolution was passed by the California Legislature in 2011. AJR 10 affirms the Legislature’s support for the federal school-based health center program authorized by Congress in 2010 [&hellip;]</p>\n",
              "children": [],
              "document_uuid": "f5a180de-5c4e-51be-b09a-db194020caf7"
            }
          ],
          "document_uuid": "9ee5b508-1c6d-5030-948c-b013119cf0ba"
        },
        {
          "page_id": 794,
          "title": "Trainings &amp; Technical Assistance",
          "link": "https://www.schoolhealthcenters.org/our-work/technical-assistance/",
          "content": {
            "full_text": "The California School-Based Health Alliance offers a wide range of workshops, technical assistance, and training services to help your school-based health center or school district start or improve health services. Training & TA topics are listed below and categorized by theme. Workshops, technical assistance, and training can all be tailored to meet the needs of your site. <h2>Are you a member of the California School-Based Health Alliance?</h2> Organization members receive between 2 and 5 hours of free technical assistance depending on level of support. <h2>Training Topics</h2> <h3>School-Based Health Center & Wellness Center Start-Up, Financing, Legal Issues</h3> Planning a school-based health center or wellness center but not sure how to get started? Looking for a partner health care provider or school? Forming a planning committee with new stakeholders? We can provide facilitated start-up planning committee meetings, as well as trainings on: <h3>Operations & Practice</h3> Want your SBHC to adopt best practices in clinical care, operations and school integration? We can provide trainings on: <h3>Youth Leadership & Engagement</h3> Looking to engage youth at your school-based health center or wellness center, or to develop your youth development skills? Planning to link your youth program to the statewide movement for school health? We can provide workshops to youth or trainings to adult facilitators on: <h3>Mental Health in Schools & School-Based Health Centers/Wellness Centers</h3> Interested in bringing mental health services on campus? Looking to improve school climate or conduct teacher trainings on mental health? We can assist you in planning and implementing comprehensive school mental health services for all students through: <h2>Looking for more?</h2> We offer contracted training and services for in-depth program support",
            "chunks": [
              "The California School-Based Health Alliance offers a wide range of workshops, technical assistance, and training services to help your school-based health center or school district start or improve health services. Training & TA topics are listed below and categorized by theme. Workshops, technical assistance, and training can all be tailored to meet the needs of your site. <h2>Are you a member of the California School-Based Health Alliance?</h2> Organization members receive between 2 and 5 hours of free technical assistance depending on level of support. <h2>Training Topics</h2> <h3>School-Based Health Center & Wellness Center Start-Up, Financing, Legal Issues</h3> Planning a school-based health center or wellness center but not sure how to get started? Looking for a partner health care provider or school? Forming a planning committee with new stakeholders? We can provide facilitated start-up planning committee meetings, as well as trainings on: <h3>Operations & Practice</h3> Want your SBHC to adopt best practices in clinical care, operations and school integration? We can provide trainings on: <h3>Youth Leadership & Engagement</h3> Looking to engage youth at your school-based health center or wellness center, or to develop your youth development skills? Planning to link your youth program to the statewide movement for school health? We can provide workshops to youth or trainings to adult facilitators on: <h3>Mental Health in Schools & School-Based Health Centers/Wellness Centers</h3> Interested in bringing mental health services on campus? Looking to improve school climate or conduct teacher trainings on mental health? We can assist you in planning and implementing comprehensive school mental health services for all students through: <h2>Looking for more?</h2> We offer contracted training and services for in-depth program support"
            ]
          },
          "modified": "2025-11-08T00:33:13",
          "slug": "technical-assistance",
          "status": "publish",
          "excerpt": "<p>The California School-Based Health Alliance offers a wide range of workshops, technical assistance, and training services to help your school-based health center or school district start or improve health services. Training &amp; TA topics are listed below and categorized by theme. Workshops, technical assistance, and training can all be tailored to meet the needs of [&hellip;]</p>\n",
          "children": [
            {
              "page_id": 3887,
              "title": "Webinars",
              "link": "https://www.schoolhealthcenters.org/our-work/technical-assistance/webinars/",
              "content": {
                "full_text": "<h2>Super-Powered Behavioral Health Care for Youth: Care Team Collaboration & the Role of Psychiatry in School-Based Health Care</h2> Tuesday, January 27, 12:00-1:00 pm Pacific: Explore the essential role of care team collaboration in supporting school-aged youth, inclusive of psychiatric clinicians and the role of psychiatric medication as part of a comprehensive treatment approach. Designed for school staff, therapists, and school-based primary care providers, this presentation aims to demystify psychiatric medications, focusing on their purpose, potential benefits and risks, common misconceptions, and strategies for fostering open, supportive conversations with students and families. Participants will learn how to partner effectively with psychiatric clinicians to ensure a unified approach, enhanced communication, and alignment of treatment goals across educational and healthcare settings. By embracing teamwork, school-based professionals can help youth achieve better mental health outcomes, empowering them to thrive academically, socially, and emotionally. Presenters: Michelle “Shelly” Nakaishi , Pediatric Primary Care Mental Health Specialist, UCSF Benioff’s Children’s Hospital Oakland; Petra Steinbuchel , Director of Cal-MAP, UCSF <h2>Improving ACEs through PCEs: A Special Session with California’s Surgeon General</h2> Wednesday, February 4, 11:00 am-12:00 pm Pacific: Learn about statewide efforts to reduce Adverse Childhood Experiences (ACEs) and strengthen Positive Childhood Experiences (PCEs) through school-based partnerships. California’s Surgeon General, Dr. Diana Ramos will share how youth-centered strategies, trauma-informed practices, and ACEs screenings in school settings can help identify needs earlier and support whole-child wellbeing. Attendees will gain practical guidance for integrating these approaches into daily school health operations to create safer, more supportive environments for all students. Presenters: Diana E. Ramos , California Surgeon General, Office of the California Surgeon General; Amy Blackshaw , MSW, Behavioral Health Project Director, California School-Based Health Alliance Sign up for our newsletter to get updates on the latest webinars. <h2>Past Webinars</h2> Resource Topic Health Issue I am a … Keywords <h4>Certified Wellness Coaches: Voices from California’s New Wellness Support Profession</h4> October 29, 2025: Hear directly from Certified Wellness Coaches (CWCs) currently working in California schools and wellness centers. As a vital part of the Children and Youth Behavioral Health Initiative (CYBHI), CWCs are expanding the state’s capacity to support youth behavioral health. Our panel shares how they provide non-clinical preventive and early intervention services, including… <h4>Protecting California’s Students: Supporting Immigrant & LGBTQ+ Youth During Challenging Times</h4> October 23, 2025: As harmful policies targeting vulnerable communities continue to emerge across the country, California schools play a critical role in remaining safe, inclusive spaces for all students, especially immigrant and LGBTQ+ youth. This webinar focuses on the shifting landscape of LGBTQ+ and immigration-related issues affecting youth and families. It provides school health professionals, educators,… <h4>Effective Youth-Driven Substance Use Prevention in Schools</h4> October 14, 2025: Continuation schools often face higher rates of youth vaping and cannabis use, yet they’re also sites of innovation and impact. This webinar shares tobacco use prevention education best practices for engaging youth in meaningful, peer-led substance use prevention, drawing on successes from six school sites across California. Featuring a case study from Sierra… <h4>Safety First Curriculum</h4> October 8, 2025: Stanford REACH Lab’s Safety First Curriculum is made up of 13 lessons on alcohol, opioids/fentanyl, psychedelics, and other drugs. The purpose of all of their curriculum is to encourage youth to abstain from use, but this curriculum also provides high school students with scientifically accurate information to empower them to quit and/or reduce… <h4>PRIDE Curriculum Training</h4> September 24, 2025: Explore Stanford REACH Lab’s PRIDE curriculum – a 4-lesson evidence-informed curriculum on nicotine/tobacco and cannabis created by the Stanford REACH Lab in collaboration with youth, educators, parents, and counselors from the LGBTQ+ community. The curriculum’s lessons focus on health effects, identity and intersectionality, stress and wellness, and how marketing targets particular groups –… <h4>Advancing Your COST: School Health Collaboration in Action</h4> September 18, 2025: Effective coordination of school health services starts with a strong and collaborative Coordination of Services Team (COST). Each team member plays a vital role—requiring active engagement, communication, and collaboration. In this webinar, you’ll explore how to strengthen your team’s impact and examine the integral role you play in ensuring a more responsive, student-centered… <h4>LGBTQ+ Support in Education: Policy, Practice & Partnership in California Schools</h4> May 14, 2025: Learn how the California Department of Education (CDE) is advancing support for LGBTQ+ students, staff, and families. This presentation will highlight LGBTQ+ affirming legislation, provide an overview of upcoming Providing Relevant, Inclusive Support that Matters for LGBTQ+ Students (PRISM) trainings and associated requirements, and explore promising practices for fostering inclusive school environments and… <h4>Supporting Youth with ACEs & Toxic Stress: Resources from Live Beyond, the Office of the California Surgeon General’s Youth Co-Created Campaign</h4> April 10, 2025: Hear from campaign representatives and youth advisors for an in-depth look at the Office of the California Surgeon General’s Live Beyond campaign. Explore the campaign’s goals, the youth co-creation process, and essential resources for educators and adults supporting youth affected by Adverse Childhood Experiences (ACEs) and toxic stress. Hear key research insights, engagement… <h4>Supporting Youth with ACEs: Healing Strategies for Response and Connection</h4> January 29, 2025: This insightful webinar is focused on supporting youth with Adverse Childhood Experiences (ACEs) and equipping them with tools to thrive. Led by ACEs Aware Young Adult Patient Advisors and health professionals, this webinar highlights evidence-based approaches and practical techniques to help youth manage stress, build coping skills, and enhance their mental well-being. Whether… <h4>CATCH My Breath Youth Vaping Prevention</h4> December 3, 2024: CATCH My Breath is a peer-reviewed, evidence-based nicotine vaping prevention program that utilizes a peer-led teaching approach for grades 5-12 and has been proven effective at reducing the likelihood that students will experiment with vaping. Learn how to access and implement the user-friendly CATCH My Breath youth nicotine vaping prevention program within their…",
                "chunks": [
                  "<h2>Super-Powered Behavioral Health Care for Youth: Care Team Collaboration & the Role of Psychiatry in School-Based Health Care</h2> Tuesday, January 27, 12:00-1:00 pm Pacific: Explore the essential role of care team collaboration in supporting school-aged youth, inclusive of psychiatric clinicians and the role of psychiatric medication as part of a comprehensive treatment approach. Designed for school staff, therapists, and school-based primary care providers, this presentation aims to demystify psychiatric medications, focusing on their purpose, potential benefits and risks, common misconceptions, and strategies for fostering open, supportive conversations with students and families. Participants will learn how to partner effectively with psychiatric clinicians to ensure a unified approach, enhanced communication, and alignment of treatment goals across educational and healthcare settings. By embracing teamwork, school-based professionals can help youth achieve better mental health outcomes, empowering them to thrive academically, socially, and emotionally. Presenters: Michelle “Shelly” Nakaishi , Pediatric Primary Care Mental Health Specialist, UCSF Benioff’s Children’s Hospital Oakland; Petra Steinbuchel , Director of Cal-MAP, UCSF <h2>Improving ACEs through PCEs: A Special Session with California’s Surgeon General</h2> Wednesday, February 4, 11:00 am-12:00 pm Pacific: Learn about statewide efforts to reduce Adverse Childhood Experiences (ACEs) and strengthen Positive Childhood Experiences (PCEs) through school-based partnerships. California’s Surgeon General, Dr. Diana Ramos will share how youth-centered strategies, trauma-informed practices, and ACEs screenings in school settings can help identify needs earlier and support whole-child wellbeing. Attendees will gain practical guidance for integrating these approaches into daily school health operations to create safer, more supportive environments for all students. Presenters: Diana E. Ramos , California Surgeon General, Office of the California Surgeon General; Amy Blackshaw , MSW, Behavioral Health Project Director, California School-Based Health Alliance Sign up for our newsletter to get updates on the latest webinars. <h2>Past Webinars</h2> Resource Topic Health Issue I am a … Keywords <h4>Certified Wellness Coaches: Voices from California’s New Wellness Support Profession</h4> October 29, 2025: Hear directly from Certified Wellness Coaches (CWCs) currently working in California schools and wellness centers. As a vital part of the Children and Youth Behavioral Health Initiative (CYBHI), CWCs are expanding the state’s capacity to support youth behavioral health. Our panel shares how they provide non-clinical preventive and early intervention services, including… <h4>Protecting California’s Students: Supporting Immigrant & LGBTQ+ Youth During Challenging Times</h4> October 23, 2025: As harmful policies targeting vulnerable communities continue to emerge across the country, California schools play a critical role in remaining safe, inclusive",
                  "to emerge across the country, California schools play a critical role in remaining safe, inclusive spaces for all students, especially immigrant and LGBTQ+ youth. This webinar focuses on the shifting landscape of LGBTQ+ and immigration-related issues affecting youth and families. It provides school health professionals, educators,… <h4>Effective Youth-Driven Substance Use Prevention in Schools</h4> October 14, 2025: Continuation schools often face higher rates of youth vaping and cannabis use, yet they’re also sites of innovation and impact. This webinar shares tobacco use prevention education best practices for engaging youth in meaningful, peer-led substance use prevention, drawing on successes from six school sites across California. Featuring a case study from Sierra… <h4>Safety First Curriculum</h4> October 8, 2025: Stanford REACH Lab’s Safety First Curriculum is made up of 13 lessons on alcohol, opioids/fentanyl, psychedelics, and other drugs. The purpose of all of their curriculum is to encourage youth to abstain from use, but this curriculum also provides high school students with scientifically accurate information to empower them to quit and/or reduce… <h4>PRIDE Curriculum Training</h4> September 24, 2025: Explore Stanford REACH Lab’s PRIDE curriculum – a 4-lesson evidence-informed curriculum on nicotine/tobacco and cannabis created by the Stanford REACH Lab in collaboration with youth, educators, parents, and counselors from the LGBTQ+ community. The curriculum’s lessons focus on health effects, identity and intersectionality, stress and wellness, and how marketing targets particular groups –… <h4>Advancing Your COST: School Health Collaboration in Action</h4> September 18, 2025: Effective coordination of school health services starts with a strong and collaborative Coordination of Services Team (COST). Each team member plays a vital role—requiring active engagement, communication, and collaboration. In this webinar, you’ll explore how to strengthen your team’s impact and examine the integral role you play in ensuring a more responsive, student-centered… <h4>LGBTQ+ Support in Education: Policy, Practice & Partnership in California Schools</h4> May 14, 2025: Learn how the California Department of Education (CDE) is advancing support for LGBTQ+ students, staff, and families. This presentation will highlight LGBTQ+ affirming legislation, provide an overview of upcoming Providing Relevant, Inclusive Support that Matters for LGBTQ+ Students (PRISM) trainings and associated requirements, and explore promising practices for fostering inclusive school environments and… <h4>Supporting Youth with ACEs & Toxic Stress: Resources from Live Beyond, the Office of the California Surgeon General’s Youth Co-Created Campaign</h4> April 10, 2025: Hear from campaign representatives and youth advisors for an in-depth look at the Office of the California Surgeon",
                  "representatives and youth advisors for an in-depth look at the Office of the California Surgeon General’s Live Beyond campaign. Explore the campaign’s goals, the youth co-creation process, and essential resources for educators and adults supporting youth affected by Adverse Childhood Experiences (ACEs) and toxic stress. Hear key research insights, engagement… <h4>Supporting Youth with ACEs: Healing Strategies for Response and Connection</h4> January 29, 2025: This insightful webinar is focused on supporting youth with Adverse Childhood Experiences (ACEs) and equipping them with tools to thrive. Led by ACEs Aware Young Adult Patient Advisors and health professionals, this webinar highlights evidence-based approaches and practical techniques to help youth manage stress, build coping skills, and enhance their mental well-being. Whether… <h4>CATCH My Breath Youth Vaping Prevention</h4> December 3, 2024: CATCH My Breath is a peer-reviewed, evidence-based nicotine vaping prevention program that utilizes a peer-led teaching approach for grades 5-12 and has been proven effective at reducing the likelihood that students will experiment with vaping. Learn how to access and implement the user-friendly CATCH My Breath youth nicotine vaping prevention program within their…"
                ]
              },
              "modified": "2025-12-04T00:27:23",
              "slug": "webinars",
              "status": "publish",
              "excerpt": "<p>Super-Powered Behavioral Health Care for Youth: Care Team Collaboration &amp; the Role of Psychiatry in School-Based Health Care Tuesday, January 27, 12:00-1:00 pm Pacific: Explore the essential role of care team collaboration in supporting school-aged youth, inclusive of psychiatric clinicians and the role of psychiatric medication as part of a comprehensive treatment approach. Designed for [&hellip;]</p>\n",
              "children": [],
              "document_uuid": "99dbde36-af19-5936-85e5-4b69c433993e"
            }
          ],
          "document_uuid": "53f82853-5143-57f7-96b6-4fac59cb19e0"
        },
        {
          "page_id": 792,
          "title": "Supporting School-Based Health Centers",
          "link": "https://www.schoolhealthcenters.org/our-work/supporting-school-based-health-centers/",
          "content": {
            "full_text": "As the statewide nonprofit working to advance school-based health centers and wellness centers (SBHCs/WCs), our goal is to grow the number in California to 500 by 2030. In 2012, California had 200 SBHCs/WCs; today, there are 400 and counting . Across California , more than 408,000 students attend a school that has a health or wellness center, and many more have access to other types of school health services. <h2>How Do We Define SBHCs/WCs?</h2> A school-based health center (SBHC) is a student-focused health center or clinic located at or near a school that provides age-appropriate, medical services 2 by clinicians 3 . It may also provide behavioral health, dental, optometry, and/or ancillary services (i.e. health education, youth engagement, case management). A wellness center (WC) means a student-focused center 1 located at or near a school that provides age-appropriate, clinical behavioral health services 2 by providers 4 . It may also provide non-medical ancillary services. The American Academy of Pediatrics considers SBHCs to be an important way for students to get access to care and—because they are mostly located in communities with a high proportion of historically disadvantaged populations—an effective way to advance health equity. 1 The center may be a facility or a mobile unit, and must include at least one confidential treatment space appropriate to services provided, as well as an additional area for reception, enrollment, and triage 2 Services may be provided in-person or via telehealth 3 As defined by HRSA 4 As defined by California Board of Behavioral Sciences <h3>A Growing Movement</h3> School-based health centers and wellness centers are an innovative way to help ensure that children and youth have access to health care and do well in school. California has 400 and counting. See Impact & Locations School-based health centers and wellness centers (SBHCs/WCs) are uniquely situated to bring health care professionals and educators together to address the multifaceted needs of children, youth and families. Some SBHCs/WCs serve only students, while others also serve family members or the broader community surrounding the school. See where school-based health can have the most impact in California. <h3>Effectively Delivering Health Care to Young People</h3> SBHCs/WCs put health care where students already spend most of their time – at school. They offer: Research has shown, and teachers and educators intuitively know, that healthier children are better students because they are able to focus in class and are not distracted by hunger, pain, stress, or a chronic illness. <h4>Take a Virtual Tour!</h4>",
            "chunks": [
              "As the statewide nonprofit working to advance school-based health centers and wellness centers (SBHCs/WCs), our goal is to grow the number in California to 500 by 2030. In 2012, California had 200 SBHCs/WCs; today, there are 400 and counting . Across California , more than 408,000 students attend a school that has a health or wellness center, and many more have access to other types of school health services. <h2>How Do We Define SBHCs/WCs?</h2> A school-based health center (SBHC) is a student-focused health center or clinic located at or near a school that provides age-appropriate, medical services 2 by clinicians 3 . It may also provide behavioral health, dental, optometry, and/or ancillary services (i.e. health education, youth engagement, case management). A wellness center (WC) means a student-focused center 1 located at or near a school that provides age-appropriate, clinical behavioral health services 2 by providers 4 . It may also provide non-medical ancillary services. The American Academy of Pediatrics considers SBHCs to be an important way for students to get access to care and—because they are mostly located in communities with a high proportion of historically disadvantaged populations—an effective way to advance health equity. 1 The center may be a facility or a mobile unit, and must include at least one confidential treatment space appropriate to services provided, as well as an additional area for reception, enrollment, and triage 2 Services may be provided in-person or via telehealth 3 As defined by HRSA 4 As defined by California Board of Behavioral Sciences <h3>A Growing Movement</h3> School-based health centers and wellness centers are an innovative way to help ensure that children and youth have access to health care and do well in school. California has 400 and counting. See Impact & Locations School-based health centers and wellness centers (SBHCs/WCs) are uniquely situated to bring health care professionals and educators together to address the multifaceted needs of children, youth and families. Some SBHCs/WCs serve only students, while others also serve family members or the broader community surrounding the school. See where school-based health can have the most impact in California. <h3>Effectively Delivering Health Care to Young People</h3> SBHCs/WCs put health care where students already spend most of their time – at school. They offer: Research has shown, and teachers and educators intuitively know, that healthier children are better students because they are able to focus in class and are not distracted by",
              "better students because they are able to focus in class and are not distracted by hunger, pain, stress, or a chronic illness. <h4>Take a Virtual Tour!</h4>"
            ]
          },
          "modified": "2025-09-09T19:33:05",
          "slug": "supporting-school-based-health-centers",
          "status": "publish",
          "excerpt": "<p>As the statewide nonprofit working to advance school-based health centers and wellness centers (SBHCs/WCs), our goal is to grow the number in California to 500 by 2030. In 2012, California had 200 SBHCs/WCs;&nbsp;today, there are 400 and counting.&nbsp;Across California, more than&nbsp;408,000 students&nbsp;attend a school that has a health or wellness center, and many more have [&hellip;]</p>\n",
          "children": [
            {
              "page_id": 2766,
              "title": "Profiles of SBHCs/WCs",
              "link": "https://www.schoolhealthcenters.org/our-work/supporting-school-based-health-centers/profiles/",
              "content": {
                "full_text": "Children and youth at schools across California get increased access to quality health care with every new school-based health center and wellness center (SBHC/WC) that opens. SBHCs/WCs are usually located directly on a school campus and provide primary care like any health clinic. They are typically staffed by nurse practitioners, nurses, mental health providers, as well as part-time physicians and medical students. Services are provided at no or low cost. No one is refused service for inability to pay. SBHCs/WCs across California provide elementary, middle, and high school students with easy access to health care. Many SBHCs/WCs also offer dental care, mental health care, leadership programs, after-school programs, and even have gardens for growing fresh produce. Here you can see what is happening at California’s SBHCs/WCs. Don’t see your SBHC/WC? Tell us about your SBHC/WC here . If you would like to start an SBHC at your school you can navigate our resources to get started. <h2>Take a Virtual Tour of California SBHCs/WCs!</h2> Swipe to see more <h2>Case Studies</h2> <h4>A Lifeline to Students During the Pandemic</h4> The impact of having a school-based health center (SBHC) that provides counseling services, health services, and a space for young folks to engage in wellness is one that I personally would have loved to experience as a young person. I have never been to a school that has developed such a culture of care, responsibility,… <h4>California Students Creatively Share Health Knowledge at Y2Y</h4> By Jubilee AdamsYouth Board Member In November 2024, the California School-Based Health Alliance (CSHA) brought together over 250 attendees – including 180 youth – from across the state of California to connect with one another at the annual Youth 2 Youth (Y2Y) conference. This year’s conference took place in Ontario at the Inland Empire Health… <h4>Distributing Naloxone in SBHCs: Addressing a Public Health Challenge</h4> By Sai Tulugu La Clínica is a federally qualified health center (FQHC) that operates several school-based health centers (SBHCs) in partnership with the Oakland Unified School District. The health center was founded in 1971 by a group of students at the University of California, Berkeley, as a community-based clinic to address the lack of high-quality… <h4>Engaging Youth in Tobacco Prevention</h4> The most effective way to reach young people with prevention education is through their peers. School-based health centers excel at engaging youth in peer-to-peer education campaigns to improve population health. The California School-Based Health Alliance and The Los Angeles Trust for Children’s Health – which serves as the Los Angeles Unified School District’s backbone health entity –… <h4>From the Garden to the Kitchen: West Oakland Middle School (WOMS)</h4> WOMS is deeply engaged in making the campus and community healthier places for students to live, work, and play. The school-based health center’s (SBHC) leaders are focusing on primary prevention to complement the much-needed medical care. New efforts to promote healthy eating are bringing many stakeholders – including students, parents, community members, and others –…",
                "chunks": [
                  "Children and youth at schools across California get increased access to quality health care with every new school-based health center and wellness center (SBHC/WC) that opens. SBHCs/WCs are usually located directly on a school campus and provide primary care like any health clinic. They are typically staffed by nurse practitioners, nurses, mental health providers, as well as part-time physicians and medical students. Services are provided at no or low cost. No one is refused service for inability to pay. SBHCs/WCs across California provide elementary, middle, and high school students with easy access to health care. Many SBHCs/WCs also offer dental care, mental health care, leadership programs, after-school programs, and even have gardens for growing fresh produce. Here you can see what is happening at California’s SBHCs/WCs. Don’t see your SBHC/WC? Tell us about your SBHC/WC here . If you would like to start an SBHC at your school you can navigate our resources to get started. <h2>Take a Virtual Tour of California SBHCs/WCs!</h2> Swipe to see more <h2>Case Studies</h2> <h4>A Lifeline to Students During the Pandemic</h4> The impact of having a school-based health center (SBHC) that provides counseling services, health services, and a space for young folks to engage in wellness is one that I personally would have loved to experience as a young person. I have never been to a school that has developed such a culture of care, responsibility,… <h4>California Students Creatively Share Health Knowledge at Y2Y</h4> By Jubilee AdamsYouth Board Member In November 2024, the California School-Based Health Alliance (CSHA) brought together over 250 attendees – including 180 youth – from across the state of California to connect with one another at the annual Youth 2 Youth (Y2Y) conference. This year’s conference took place in Ontario at the Inland Empire Health… <h4>Distributing Naloxone in SBHCs: Addressing a Public Health Challenge</h4> By Sai Tulugu La Clínica is a federally qualified health center (FQHC) that operates several school-based health centers (SBHCs) in partnership with the Oakland Unified School District. The health center was founded in 1971 by a group of students at the University of California, Berkeley, as a community-based clinic to address the lack of high-quality… <h4>Engaging Youth in Tobacco Prevention</h4> The most effective way to reach young people with prevention education is through their peers. School-based health centers excel at engaging youth in peer-to-peer education campaigns to improve population health. The California School-Based Health Alliance and The",
                  "in peer-to-peer education campaigns to improve population health. The California School-Based Health Alliance and The Los Angeles Trust for Children’s Health – which serves as the Los Angeles Unified School District’s backbone health entity –… <h4>From the Garden to the Kitchen: West Oakland Middle School (WOMS)</h4> WOMS is deeply engaged in making the campus and community healthier places for students to live, work, and play. The school-based health center’s (SBHC) leaders are focusing on primary prevention to complement the much-needed medical care. New efforts to promote healthy eating are bringing many stakeholders – including students, parents, community members, and others –…"
                ]
              },
              "modified": "2025-08-15T18:42:05",
              "slug": "profiles",
              "status": "publish",
              "excerpt": "<p>Children and youth at schools across California get increased access to quality health care with every new school-based health center and wellness center (SBHC/WC) that opens. SBHCs/WCs are usually located directly on a school campus and provide primary care like any health clinic. They are typically staffed by nurse practitioners, nurses, mental health providers, as [&hellip;]</p>\n",
              "children": [],
              "document_uuid": "ce5e80f0-20d1-512e-b866-d9445161079e"
            }
          ],
          "document_uuid": "cad4f502-7259-50dc-96c5-6a7023bfbf93"
        }
      ],
      "document_uuid": "1567749a-6394-5dd0-8f5b-40313ee0c6b0"
    },
    {
      "page_id": 117,
      "title": "Search",
      "link": "https://www.schoolhealthcenters.org/search-test/",
      "content": {
        "full_text": "search",
        "chunks": [
          "search"
        ]
      },
      "modified": "2025-04-25T14:24:12",
      "slug": "search-test",
      "status": "publish",
      "excerpt": "<p>search</p>\n",
      "children": [],
      "document_uuid": "f8a89257-b43f-503d-b19c-2bb55dd12e58"
    },
    {
      "page_id": 79,
      "title": "Home",
      "link": "https://www.schoolhealthcenters.org/",
      "content": {
        "full_text": "<h1>Putting Health Care Where Kids Are</h1> <h2>About CSHA</h2> The California School-Based Health Alliance (CSHA) is the statewide non-profit organization dedicated to improving the health & academic success of children & youth by advancing health services in schools. <h3>SUPPORTING SCHOOL BASED HEALTH CENTERS</h3> <h3>TECHNICAL ASSISTANCE & TRAININGS</h3> <h3>POLICY & ADVOCACY IN CALIFORNIA</h3> <h3>RESOURCES & GUIDANCE</h3> <h2>Save the Date for Our 2026 Conference</h2> April 27-28 at the Hilton Los Angeles/Universal City <h2>Explore Our Resources</h2> See our A-Z guide to starting a school-based health and wellness center! See how to protect student data and confidentiality. See where school-based health can have the most impact. Swipe to see more <h2>About School-Based Health</h2> School-based health centers and wellness centers (SBHCs/WCs) are an innovative way to help ensure that children and youth have access to health care and do well in school. A school-based health center (SBHC) is a student-focused health center or clinic located at or near a school that provides age-appropriate, medical services by clinicians. It may also provide behavioral health, dental, optometry, and/or ancillary services (i.e. health education, youth engagement, case management). A wellness center (WC) is a student-focused center located at or near a school that provides age-appropriate, clinical behavioral health services by providers. It may also provide non-medical ancillary services. Research has shown, and teachers and educators intuitively know, that healthier children are better students because they are able to focus in class and are not distracted by hunger, pain, stress, or a chronic illness. <h2>Get the Latest Information on School Health</h2> Sign up to receive our free newsletter and stay updated on learning opportunities and more. Organizations that want to receive technical assistance, discounted conference registration, and access to regular member calls can become a member.",
        "chunks": [
          "<h1>Putting Health Care Where Kids Are</h1> <h2>About CSHA</h2> The California School-Based Health Alliance (CSHA) is the statewide non-profit organization dedicated to improving the health & academic success of children & youth by advancing health services in schools. <h3>SUPPORTING SCHOOL BASED HEALTH CENTERS</h3> <h3>TECHNICAL ASSISTANCE & TRAININGS</h3> <h3>POLICY & ADVOCACY IN CALIFORNIA</h3> <h3>RESOURCES & GUIDANCE</h3> <h2>Save the Date for Our 2026 Conference</h2> April 27-28 at the Hilton Los Angeles/Universal City <h2>Explore Our Resources</h2> See our A-Z guide to starting a school-based health and wellness center! See how to protect student data and confidentiality. See where school-based health can have the most impact. Swipe to see more <h2>About School-Based Health</h2> School-based health centers and wellness centers (SBHCs/WCs) are an innovative way to help ensure that children and youth have access to health care and do well in school. A school-based health center (SBHC) is a student-focused health center or clinic located at or near a school that provides age-appropriate, medical services by clinicians. It may also provide behavioral health, dental, optometry, and/or ancillary services (i.e. health education, youth engagement, case management). A wellness center (WC) is a student-focused center located at or near a school that provides age-appropriate, clinical behavioral health services by providers. It may also provide non-medical ancillary services. Research has shown, and teachers and educators intuitively know, that healthier children are better students because they are able to focus in class and are not distracted by hunger, pain, stress, or a chronic illness. <h2>Get the Latest Information on School Health</h2> Sign up to receive our free newsletter and stay updated on learning opportunities and more. Organizations that want to receive technical assistance, discounted conference registration, and access to regular member calls can become a member."
        ]
      },
      "modified": "2025-12-15T17:11:27",
      "slug": "home",
      "status": "publish",
      "excerpt": "<p>Explore Our Resources About School-Based Health School-based health centers and wellness centers (SBHCs/WCs) are an innovative way to help ensure that children and youth have access to health care and do well in school.&nbsp; A school-based health center (SBHC) is a student-focused health center or clinic located at or near a school that provides age-appropriate, [&hellip;]</p>\n",
      "children": [],
      "document_uuid": "cfd1a295-4a7f-52f2-9aa3-ba8325ae24f5"
    },
    {
      "page_id": 24,
      "title": "Membership",
      "link": "https://www.schoolhealthcenters.org/membership/",
      "content": {
        "full_text": "The California School-Based Health Alliance (CSHA) is the statewide nonprofit organization helping to put more health services in schools. Being an organizational member of CSHA helps support the mission to create a more equitable future for children and youth in the Golden State. Organizations that want to receive individualized support for starting and expanding school health services, discounted conference registration, and access to knowledge and resources beyond what we have on our website are encouraged to become members. *Looking for more? We offer contracted training and services for in-depth program support. Contact Us Thank you to the following organizations that have become members of the California School-Based Health Alliance for the 2025-26 year. <h3>Local Education Agencies (LEAs)</h3> Alvord Unified School District Apple Valley Unified School District Bakersfield City School District Del Norte Unified School District Eureka City Schools Folsom Cordova Unified School District Fowler Unified School District Fresno County Superintendent of Schools Glenn County Office of Education Inland Career Education Center Lake County Office of Education Marin County Office of Education Mendocino County Office of Education Northern Humboldt Union High School District Orange County Department of Education Rialto Unified School District Sacramento City Unified School District Salinas Union High School District San Bernardino County Superintendent of Schools San Francisco Unified School District San Luis Obispo County Office of Education Snowline Joint Unified School District Southern Humboldt Joint Unified School District Tahoe Truckee Unified School District Tulare County Office of Education Upland Unified School District Ventura Unified School District Visalia Unified School District <h3>Health Care Partners</h3> Altura Centers for Health B.E.T.T.E.R. Psych Services Corp. Camarena Health Comprehensive Community Health Centers El Dorado Community Health Centers Gold Coast Health Plan Healthy Campus Herald Christian Health Center La Clínica de La Raza Leading Public Health Enterprises, Inc. LifeLong Medical Care Native American Health Center Neighborhood Healthcare SAC Health St. John’s Community Health School Health Clinics of Santa Clara County Tiburcio Vasquez Health Center UCSF Benioff Children’s Hospital Oakland Vista Community Clinic <h3>Governmental & Nonprofit Partners</h3> 2020 Vision Youth Alameda County Health Alameda Family Services City of Berkeley Central Valley Health Network County of Monterey East Bay Agency for Children East Bay Asian Youth Center Essential Access Health Fred Finch Youth Center The Los Angeles Trust for Children’s Health University of California San Francisco, School Health Evaluation & Research Vesper Society <h2>Become a Member of CSHA</h2> Join the movement to put health care where kids are with an organizational membership. Our membership year runs from September 1 through August 31. <h2>Payment Information</h2> The California School-Based Health Alliance is a 501(c)(3) organization and all donations are tax-deductible to the full extent of the law. <h3>Are You Looking to Support CSHA as an Individual?</h3> We no longer have individual membership options. If you are an individual who believes in the power of school-based health centers to transform education for students, we encourage you to make a meaningful donation to build our capacity to connect and strengthen school-based health and wellness centers across California. <h2>Who We Are</h2> The California School-Based Health Alliance (CSHA) is the statewide non-profit organization dedicated to improving the health & academic success of children & youth by advancing health services in schools.",
        "chunks": [
          "The California School-Based Health Alliance (CSHA) is the statewide nonprofit organization helping to put more health services in schools. Being an organizational member of CSHA helps support the mission to create a more equitable future for children and youth in the Golden State. Organizations that want to receive individualized support for starting and expanding school health services, discounted conference registration, and access to knowledge and resources beyond what we have on our website are encouraged to become members. *Looking for more? We offer contracted training and services for in-depth program support. Contact Us Thank you to the following organizations that have become members of the California School-Based Health Alliance for the 2025-26 year. <h3>Local Education Agencies (LEAs)</h3> Alvord Unified School District Apple Valley Unified School District Bakersfield City School District Del Norte Unified School District Eureka City Schools Folsom Cordova Unified School District Fowler Unified School District Fresno County Superintendent of Schools Glenn County Office of Education Inland Career Education Center Lake County Office of Education Marin County Office of Education Mendocino County Office of Education Northern Humboldt Union High School District Orange County Department of Education Rialto Unified School District Sacramento City Unified School District Salinas Union High School District San Bernardino County Superintendent of Schools San Francisco Unified School District San Luis Obispo County Office of Education Snowline Joint Unified School District Southern Humboldt Joint Unified School District Tahoe Truckee Unified School District Tulare County Office of Education Upland Unified School District Ventura Unified School District Visalia Unified School District <h3>Health Care Partners</h3> Altura Centers for Health B.E.T.T.E.R. Psych Services Corp. Camarena Health Comprehensive Community Health Centers El Dorado Community Health Centers Gold Coast Health Plan Healthy Campus Herald Christian Health Center La Clínica de La Raza Leading Public Health Enterprises, Inc. LifeLong Medical Care Native American Health Center Neighborhood Healthcare SAC Health St. John’s Community Health School Health Clinics of Santa Clara County Tiburcio Vasquez Health Center UCSF Benioff Children’s Hospital Oakland Vista Community Clinic <h3>Governmental & Nonprofit Partners</h3> 2020 Vision Youth Alameda County Health Alameda Family Services City of Berkeley Central Valley Health Network County of Monterey East Bay Agency for Children East Bay Asian Youth Center Essential Access Health Fred Finch Youth Center The Los Angeles Trust for Children’s Health University of California San Francisco, School Health Evaluation & Research Vesper Society <h2>Become a Member of CSHA</h2> Join the movement to put health care where",
          "Vesper Society <h2>Become a Member of CSHA</h2> Join the movement to put health care where kids are with an organizational membership. Our membership year runs from September 1 through August 31. <h2>Payment Information</h2> The California School-Based Health Alliance is a 501(c)(3) organization and all donations are tax-deductible to the full extent of the law. <h3>Are You Looking to Support CSHA as an Individual?</h3> We no longer have individual membership options. If you are an individual who believes in the power of school-based health centers to transform education for students, we encourage you to make a meaningful donation to build our capacity to connect and strengthen school-based health and wellness centers across California. <h2>Who We Are</h2> The California School-Based Health Alliance (CSHA) is the statewide non-profit organization dedicated to improving the health & academic success of children & youth by advancing health services in schools."
        ]
      },
      "modified": "2025-12-22T17:32:58",
      "slug": "membership",
      "status": "publish",
      "excerpt": "<p>The California School-Based Health Alliance (CSHA) is the statewide nonprofit organization helping to put more health services in schools. Being an organizational member of CSHA helps support the mission to create a more equitable future for children and youth in the Golden State. Organizations that want to receive individualized support for starting and expanding school [&hellip;]</p>\n",
      "children": [
        {
          "page_id": 3782,
          "title": "Thank You for Supporting Student Health",
          "link": "https://www.schoolhealthcenters.org/membership/thank-you/",
          "content": {
            "full_text": "<h2>Thank you for supporting the California School-Based Health Alliance!</h2> You will receive a separate email confirmation of your payment if you successfully paid online with a credit card. If you requested an invoice, you will receive it by email soon. Ready to explore our member resources? Sign in to access all the resources available to current California School-Based Health Alliance members. The password is in your confirmation email. If you cannot find the email, please check your spam folder.",
            "chunks": [
              "<h2>Thank you for supporting the California School-Based Health Alliance!</h2> You will receive a separate email confirmation of your payment if you successfully paid online with a credit card. If you requested an invoice, you will receive it by email soon. Ready to explore our member resources? Sign in to access all the resources available to current California School-Based Health Alliance members. The password is in your confirmation email. If you cannot find the email, please check your spam folder."
            ]
          },
          "modified": "2025-08-06T21:55:40",
          "slug": "thank-you",
          "status": "publish",
          "excerpt": "<p>Thank you for supporting the&nbsp;California School-Based Health Alliance! You will receive a separate email confirmation of your payment if you successfully paid online with a credit card. If you requested an invoice, you will receive it by email soon. Ready to explore our member resources? Sign in to access all the resources available to current California School-Based [&hellip;]</p>\n",
          "children": [],
          "document_uuid": "953411df-e183-52fb-90d7-57f6448b060d"
        }
      ],
      "document_uuid": "fbf6f5ba-3e3c-5dbf-a67e-e01c7140ccf6"
    },
    {
      "page_id": 22,
      "title": "About",
      "link": "https://www.schoolhealthcenters.org/about/",
      "content": {
        "full_text": "The California School-Based Health Alliance is the statewide nonprofit organization helping to put more health services in schools. <h2>Our Mission</h2> The California School-Based Health Alliance aims to improve the health and academic success of children and youth by advancing health services in schools. <h3>Our Goals</h3> Healthy Children. Too many children come to school every day suffering from conditions that seriously impact their ability to learn and succeed. Successful Students. Healthy students miss fewer classes, are less likely to drop out and have a better chance of success in school and beyond. Equity and Access. School-based health centers (SBHCs) offer services in a place that is familiar, trusted, age-appropriate, and convenient for all students and families – in school. <h3>Our Work</h3> <h2>Join Us</h2> Sign up to receive our newsletter and occasional updates on student health in California. <h3>Support CSHA</h3> We are supported by private foundations, donations, and organizational and individual members . We are a state affiliate of the national School-Based Health Alliance in Washington, D.C. You can support our work for school-based health by becoming a member . We have earned a Platinum Seal with Candid (formerly GuideStar). We are a 501(c)(3) Public Charity.",
        "chunks": [
          "The California School-Based Health Alliance is the statewide nonprofit organization helping to put more health services in schools. <h2>Our Mission</h2> The California School-Based Health Alliance aims to improve the health and academic success of children and youth by advancing health services in schools. <h3>Our Goals</h3> Healthy Children. Too many children come to school every day suffering from conditions that seriously impact their ability to learn and succeed. Successful Students. Healthy students miss fewer classes, are less likely to drop out and have a better chance of success in school and beyond. Equity and Access. School-based health centers (SBHCs) offer services in a place that is familiar, trusted, age-appropriate, and convenient for all students and families – in school. <h3>Our Work</h3> <h2>Join Us</h2> Sign up to receive our newsletter and occasional updates on student health in California. <h3>Support CSHA</h3> We are supported by private foundations, donations, and organizational and individual members . We are a state affiliate of the national School-Based Health Alliance in Washington, D.C. You can support our work for school-based health by becoming a member . We have earned a Platinum Seal with Candid (formerly GuideStar). We are a 501(c)(3) Public Charity."
        ]
      },
      "modified": "2025-08-01T20:55:33",
      "slug": "about",
      "status": "publish",
      "excerpt": "<p>The California School-Based Health Alliance is the statewide nonprofit organization helping to put more health services in schools. Our Mission The California School-Based Health Alliance aims to improve the health and academic success of children and youth by advancing health services in schools. Our Goals Healthy Children.&nbsp;Too many children come to school every day suffering [&hellip;]</p>\n",
      "children": [
        {
          "page_id": 808,
          "title": "Youth Board",
          "link": "https://www.schoolhealthcenters.org/about/youth-board/",
          "content": {
            "full_text": "Mission Statement: The California School-Based Health Alliance Youth Board aims to amplify youth engagement and access to school-based health through leadership, advocacy, and empowerment throughout California. In 2007, five young people formed the California School-Based Health Alliance (CSHA) Youth Board, a group of school health advocates from across California committed to the advancement of school-based health care, empowered by their lived experiences with adolescent health, school health, and community roots. Today, our Youth Board members continue to advocate for youth’s voice to be integrated into CSHA’s mission, projects, and building further opportunities for School-Based Health Centers to strengthen their commitment to implementing youth leadership, voice, and experiences. <h2>Youth Board Members</h2> <h3>Jubilee Adams</h3> Youth Board Member <h3>Nancy Aguilar</h3> Youth Board Member <h3>Charlize Chloe Castillo</h3> Youth Board Member <h3>Camara Christian</h3> Youth Board Member <h3>Rehma Shahid</h3> Youth Board Member <h3>Taaliyah Tucker</h3> Youth Board Member",
            "chunks": [
              "Mission Statement: The California School-Based Health Alliance Youth Board aims to amplify youth engagement and access to school-based health through leadership, advocacy, and empowerment throughout California. In 2007, five young people formed the California School-Based Health Alliance (CSHA) Youth Board, a group of school health advocates from across California committed to the advancement of school-based health care, empowered by their lived experiences with adolescent health, school health, and community roots. Today, our Youth Board members continue to advocate for youth’s voice to be integrated into CSHA’s mission, projects, and building further opportunities for School-Based Health Centers to strengthen their commitment to implementing youth leadership, voice, and experiences. <h2>Youth Board Members</h2> <h3>Jubilee Adams</h3> Youth Board Member <h3>Nancy Aguilar</h3> Youth Board Member <h3>Charlize Chloe Castillo</h3> Youth Board Member <h3>Camara Christian</h3> Youth Board Member <h3>Rehma Shahid</h3> Youth Board Member <h3>Taaliyah Tucker</h3> Youth Board Member"
            ]
          },
          "modified": "2025-10-17T17:04:40",
          "slug": "youth-board",
          "status": "publish",
          "excerpt": "<p>Mission Statement: The California School-Based Health Alliance Youth Board aims to amplify youth engagement and access to school-based health through leadership, advocacy, and empowerment throughout California. In 2007, five young people formed the California School-Based Health Alliance (CSHA) Youth Board, a group of school health advocates from across California committed to the advancement of school-based [&hellip;]</p>\n",
          "children": [],
          "document_uuid": "1b8ebfcc-3044-556d-a16f-4f4e610460d4"
        },
        {
          "page_id": 804,
          "title": "Job Opportunities",
          "link": "https://www.schoolhealthcenters.org/about/job-listings/",
          "content": {
            "full_text": "<h2>Job Opportunities With Our Partners</h2> <h3>Contra Costa Health Services</h3> <h3>Ridgecrest Regional Hospital</h3> <h3>Community Clinic Association of Los Angeles County Jobs Board</h3> <h3>Asian Health Services</h3> <h3>Axis Community Health</h3> <h3>East Bay Agency for Children</h3> <h3>La Clinica</h3> <h3>LifeLong Medical Care</h3> <h3>Native American Health Center</h3> <h3>Tiburcio Vasquez Health Center</h3> <h3>Bay Area Community Health</h3> <h2>Other Public Health Job Openings</h2> <h3>Public Health Institute (PHI)</h3> PHI has a constantly updated list of health sector jobs . <h3>Anti-Violence Program Job Openings</h3> The California Partnership to End Domestic Violence lists ongoing anti-violence program job opportunities from across the state on its website . The California School-Based Health Alliance is an equal opportunity employer that actively pursues and hires a diverse workforce. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, disability (mental or physical), gender identity or expression, genetic information, marital status, medical condition, military veteran status, national origin, political affiliation, pregnancy, race, religion or creed, sex, sexual orientation, or any other factor that is not related to the job.",
            "chunks": [
              "<h2>Job Opportunities With Our Partners</h2> <h3>Contra Costa Health Services</h3> <h3>Ridgecrest Regional Hospital</h3> <h3>Community Clinic Association of Los Angeles County Jobs Board</h3> <h3>Asian Health Services</h3> <h3>Axis Community Health</h3> <h3>East Bay Agency for Children</h3> <h3>La Clinica</h3> <h3>LifeLong Medical Care</h3> <h3>Native American Health Center</h3> <h3>Tiburcio Vasquez Health Center</h3> <h3>Bay Area Community Health</h3> <h2>Other Public Health Job Openings</h2> <h3>Public Health Institute (PHI)</h3> PHI has a constantly updated list of health sector jobs . <h3>Anti-Violence Program Job Openings</h3> The California Partnership to End Domestic Violence lists ongoing anti-violence program job opportunities from across the state on its website . The California School-Based Health Alliance is an equal opportunity employer that actively pursues and hires a diverse workforce. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, disability (mental or physical), gender identity or expression, genetic information, marital status, medical condition, military veteran status, national origin, political affiliation, pregnancy, race, religion or creed, sex, sexual orientation, or any other factor that is not related to the job."
            ]
          },
          "modified": "2025-11-24T22:37:15",
          "slug": "job-listings",
          "status": "publish",
          "excerpt": "<p>Job Opportunities With Our Partners The California School-Based Health Alliance is an equal opportunity employer that actively pursues and hires a diverse workforce. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, disability (mental or physical), gender identity or expression, genetic information, marital status, medical condition, military veteran status, national [&hellip;]</p>\n",
          "children": [],
          "document_uuid": "a0242c21-3fa8-547a-9c9d-67c2a22b40d7"
        },
        {
          "page_id": 806,
          "title": "Thanks to Our Supporters",
          "link": "https://www.schoolhealthcenters.org/about/our-supporters/",
          "content": {
            "full_text": "Special thanks to our supporters for helping us give every child the opportunity to be healthy and successful. Behavioral Health Student Services Act, partnership with Center for Applied Research Solutions California Department of Education Tobacco Use Prevention Education Funding California Department of Toxic Substances Control Kaiser Permanente (Northern and Southern California) San Bernardino County Superintendent of Schools Santa Clara County Office of Education The California Endowment Tobacco-Related Disease Research Program, partnership with Stanford University The UCLA-UCSF ACEs Aware Family Resilience Network (UCAAN) Vesper Society <h2>Members</h2> We are grateful to the organizations that demonstrate support for our work to expand school-based health in California. <h3>Conference Sponsors</h3> We invite companies and agencies that support increased access to health care to join us at our annual statewide conference. <h2>Who We Are</h2> The California School-Based Health Alliance (CSHA) is the statewide non-profit organization dedicated to improving the health & academic success of children & youth by advancing health services in schools.",
            "chunks": [
              "Special thanks to our supporters for helping us give every child the opportunity to be healthy and successful. Behavioral Health Student Services Act, partnership with Center for Applied Research Solutions California Department of Education Tobacco Use Prevention Education Funding California Department of Toxic Substances Control Kaiser Permanente (Northern and Southern California) San Bernardino County Superintendent of Schools Santa Clara County Office of Education The California Endowment Tobacco-Related Disease Research Program, partnership with Stanford University The UCLA-UCSF ACEs Aware Family Resilience Network (UCAAN) Vesper Society <h2>Members</h2> We are grateful to the organizations that demonstrate support for our work to expand school-based health in California. <h3>Conference Sponsors</h3> We invite companies and agencies that support increased access to health care to join us at our annual statewide conference. <h2>Who We Are</h2> The California School-Based Health Alliance (CSHA) is the statewide non-profit organization dedicated to improving the health & academic success of children & youth by advancing health services in schools."
            ]
          },
          "modified": "2025-06-03T17:53:16",
          "slug": "our-supporters",
          "status": "publish",
          "excerpt": "<p>Special thanks to our supporters for helping us give every child the opportunity to be healthy and successful. Behavioral Health Student Services Act, partnership with Center for Applied Research Solutions California Department of Education Tobacco Use Prevention Education Funding California Department of Toxic Substances Control Kaiser Permanente (Northern and Southern California) San Bernardino County Superintendent [&hellip;]</p>\n",
          "children": [],
          "document_uuid": "40b4753e-0bdb-511d-a6f7-665b6f165891"
        },
        {
          "page_id": 810,
          "title": "Contact Us",
          "link": "https://www.schoolhealthcenters.org/about/contact-us/",
          "content": {
            "full_text": "Please complete the form below.",
            "chunks": [
              "Please complete the form below."
            ]
          },
          "modified": "2025-09-12T19:59:37",
          "slug": "contact-us",
          "status": "publish",
          "excerpt": "<p>Please complete the form below.</p>\n",
          "children": [],
          "document_uuid": "11158fa4-458a-51d0-a4e6-a5335a1e6446"
        },
        {
          "page_id": 802,
          "title": "Board",
          "link": "https://www.schoolhealthcenters.org/about/board/",
          "content": {
            "full_text": "<h3>Jessica Saint-Paul</h3> President <h3>Dareen Khatib</h3> Vice President <h3>Deanna Niebuhr</h3> Treasurer <h3>Mario Alfaro</h3> Board Member <h3>Jazzmin Hicks-Bonam</h3> Board Member <h3>Michael Lombardo</h3> Board Member <h3>Felipe Mercado</h3> Board Member <h3>Stephanie Ocampo</h3> Board Member <h3>Maryjane Puffer</h3> Board Member <h3>Sharla E. Smith</h3> Board Member <h3>Carmen Vega</h3> Board Member",
            "chunks": [
              "<h3>Jessica Saint-Paul</h3> President <h3>Dareen Khatib</h3> Vice President <h3>Deanna Niebuhr</h3> Treasurer <h3>Mario Alfaro</h3> Board Member <h3>Jazzmin Hicks-Bonam</h3> Board Member <h3>Michael Lombardo</h3> Board Member <h3>Felipe Mercado</h3> Board Member <h3>Stephanie Ocampo</h3> Board Member <h3>Maryjane Puffer</h3> Board Member <h3>Sharla E. Smith</h3> Board Member <h3>Carmen Vega</h3> Board Member"
            ]
          },
          "modified": "2025-05-27T22:35:40",
          "slug": "board",
          "status": "publish",
          "excerpt": "",
          "children": [],
          "document_uuid": "f71381ac-dcc4-52f5-bbdb-6de3b1ef6844"
        },
        {
          "page_id": 69,
          "title": "Our Staff",
          "link": "https://www.schoolhealthcenters.org/about/staff/",
          "content": {
            "full_text": "<h3>Sergio J. Morales</h3> Executive Director <h3>Ally Wick</h3> Technical Assistance Manager <h3>Amy Blackshaw</h3> Behavioral Health Project Director <h3>Amy Ranger</h3> Deputy Director <h3>Sierra Lau</h3> School Health Project Director <h3>Tracy Nguyen</h3> Training Manager <h3>Irma Rosa Viera</h3> Youth Engagement Coordinator <h3>Judy Singharath</h3> Administrative Manager <h3>Marcel Reynolds</h3> Dir. Strategic Communications & Membership <h3>Marina Quintanilla</h3> Advocacy & Strategic Partnerships Manager",
            "chunks": [
              "<h3>Sergio J. Morales</h3> Executive Director <h3>Ally Wick</h3> Technical Assistance Manager <h3>Amy Blackshaw</h3> Behavioral Health Project Director <h3>Amy Ranger</h3> Deputy Director <h3>Sierra Lau</h3> School Health Project Director <h3>Tracy Nguyen</h3> Training Manager <h3>Irma Rosa Viera</h3> Youth Engagement Coordinator <h3>Judy Singharath</h3> Administrative Manager <h3>Marcel Reynolds</h3> Dir. Strategic Communications & Membership <h3>Marina Quintanilla</h3> Advocacy & Strategic Partnerships Manager"
            ]
          },
          "modified": "2025-06-12T19:10:02",
          "slug": "staff",
          "status": "publish",
          "excerpt": "",
          "children": [],
          "document_uuid": "677588af-6094-5d7c-b746-27d1c9e2af1d"
        }
      ],
      "document_uuid": "46da15e7-1c85-57e8-ad65-bf8310d56841"
    },
    {
      "page_id": 18,
      "title": "Resources",
      "link": "https://www.schoolhealthcenters.org/resources/",
      "content": {
        "full_text": "Here you can find resources to help you plan a school-based health center (SBHC), expand and enhance services at your existing SBHC, and find resources on various aspects of student health and learning. Resource Type Resource Topic Health Topic I am a … <h4>Creating Safer Spaces for LGBTQIA+ Youth – A Quick Guide</h4> The California School-Based Health Alliance (CSHA) believes that advancing health equity and justice for young people requires centering the voices, leadership, and assets of all youth. CSHA strongly recommends that all school-based health centers and wellness centers (SBHC/WCs) actively tailor their spaces and practices to affirm and empower LGBTQIA+ youth. SBHC/WCs must help dismantle the… <h4>Certified Wellness Coaches: Voices from California’s New Wellness Support Profession</h4> October 29, 2025: Hear directly from Certified Wellness Coaches (CWCs) currently working in California schools and wellness centers. As a vital part of the Children and Youth Behavioral Health Initiative (CYBHI), CWCs are expanding the state’s capacity to support youth behavioral health. Our panel shares how they provide non-clinical preventive and early intervention services, including… <h4>Protecting California’s Students: Supporting Immigrant & LGBTQ+ Youth During Challenging Times</h4> October 23, 2025: As harmful policies targeting vulnerable communities continue to emerge across the country, California schools play a critical role in remaining safe, inclusive spaces for all students, especially immigrant and LGBTQ+ youth. This webinar focuses on the shifting landscape of LGBTQ+ and immigration-related issues affecting youth and families. It provides school health professionals, educators,… <h4>2025 Inland Empire School-Based Health Symposium Resources</h4> 2025 Keynote Speaker Dr. Maya Boustani is an Associate Professor of Psychology at Loma Linda University and a licensed clinical child and adolescent psychologist. She is dedicated to bridging the gap between research and real-world practice to make mental healthcare more accessible for youth and families, especially in school settings. Her work focuses on creating practical… <h4>Effective Youth-Driven Substance Use Prevention in Schools</h4> October 14, 2025: Continuation schools often face higher rates of youth vaping and cannabis use, yet they’re also sites of innovation and impact. This webinar shares tobacco use prevention education best practices for engaging youth in meaningful, peer-led substance use prevention, drawing on successes from six school sites across California. Featuring a case study from Sierra…",
        "chunks": [
          "Here you can find resources to help you plan a school-based health center (SBHC), expand and enhance services at your existing SBHC, and find resources on various aspects of student health and learning. Resource Type Resource Topic Health Topic I am a … <h4>Creating Safer Spaces for LGBTQIA+ Youth – A Quick Guide</h4> The California School-Based Health Alliance (CSHA) believes that advancing health equity and justice for young people requires centering the voices, leadership, and assets of all youth. CSHA strongly recommends that all school-based health centers and wellness centers (SBHC/WCs) actively tailor their spaces and practices to affirm and empower LGBTQIA+ youth. SBHC/WCs must help dismantle the… <h4>Certified Wellness Coaches: Voices from California’s New Wellness Support Profession</h4> October 29, 2025: Hear directly from Certified Wellness Coaches (CWCs) currently working in California schools and wellness centers. As a vital part of the Children and Youth Behavioral Health Initiative (CYBHI), CWCs are expanding the state’s capacity to support youth behavioral health. Our panel shares how they provide non-clinical preventive and early intervention services, including… <h4>Protecting California’s Students: Supporting Immigrant & LGBTQ+ Youth During Challenging Times</h4> October 23, 2025: As harmful policies targeting vulnerable communities continue to emerge across the country, California schools play a critical role in remaining safe, inclusive spaces for all students, especially immigrant and LGBTQ+ youth. This webinar focuses on the shifting landscape of LGBTQ+ and immigration-related issues affecting youth and families. It provides school health professionals, educators,… <h4>2025 Inland Empire School-Based Health Symposium Resources</h4> 2025 Keynote Speaker Dr. Maya Boustani is an Associate Professor of Psychology at Loma Linda University and a licensed clinical child and adolescent psychologist. She is dedicated to bridging the gap between research and real-world practice to make mental healthcare more accessible for youth and families, especially in school settings. Her work focuses on creating practical… <h4>Effective Youth-Driven Substance Use Prevention in Schools</h4> October 14, 2025: Continuation schools often face higher rates of youth vaping and cannabis use, yet they’re also sites of innovation and impact. This webinar shares tobacco use prevention education best practices for engaging youth in meaningful, peer-led substance use prevention, drawing on successes from six school sites across California. Featuring a case study from Sierra…"
        ]
      },
      "modified": "2025-10-01T17:25:25",
      "slug": "resources",
      "status": "publish",
      "excerpt": "<p>Here you can find resources to help you plan a school-based health center (SBHC), expand and enhance services at your existing SBHC, and find resources on various aspects of student health and learning.&nbsp; Resource Type Resource Topic Health Topic I am a &#8230;</p>\n",
      "children": [],
      "document_uuid": "7040ce9d-86c4-5986-a65c-b10b44767288"
    }
  ]
}